{
  "baseline_attrs_count": 1,
  "enriched_attrs_count": 2,
  "merge_stats": {
    "merged": [
      {
        "title": "Mike Rother - Advancing practice of scientific thinking at ...",
        "url": "https://www.linkedin.com/in/mike-rother-472900297",
        "snippet": "# Mike Rother\nAdvancing practice of scientific thinking at work, and in education. Author of Toyota Kata, The Toyota Kata Practice Guide, Toyota Kata Culture, Learning to See. Educators, visit katatogrow.com!\nResearcher at [University of Michigan College of Engineering](https://www.linkedin.com/school/university-of-michigan-college-of-engineering)\nAnn Arbor, Michigan, United States (US)\n3,319 connections • 11,751 followers\n## About\nI'm on LinkedIn to share news, ideas, and opinions among scientific thinking / Toyota…\n## Experience\n### Researcher at [University of Michigan College of Engineering](https://www.linkedin.com/school/university-of-michigan-college-of-engineering) (Current)\nCompany: 10,001+ employees • Educational • Higher Education\nDepartment: Research • Level: Specialist\n## Skills\nstories\n## Publications\n### 'Learning to See' (1999)\n[View Publication](https://linkedin.com/redir/redirect?url=www.amazon.com/Learning-See-Stream-Mapping-Eliminate/dp/0966784308&urlhash=O_1f&trk=public_profile_publication-button)\n### 'Toyota Kata' (2009)\n[View Publication](https://linkedin.com/redir/redirect?url=www.amazon.com/Toyota-Kata-Managing-Improvement-Adaptiveness/dp/0071635238&urlhash=NUxk&trk=public_profile_publication-button)\n## Activity\n### https://www.linkedin.com/posts/grahamcpcetraining_kata-activity-7407690231996370944-HSs5\nActivity: Liked by\nWhat an amazing quote regarding the calming effect of #kata.\n“Confidence comes not from certainty, but from having a method to find the next step.”…\n### https://www.linkedin.com/posts/andrea-lee-b27b8b180_dojo-kata-coach-activity-7407556722468450304-aWJ3\nActivity: Liked by\nThe #dojo is transformative for any #kata #coach and today, Allison Lawless had her transformative moment facilitating her first dojo and doing so…\n### https://www.linkedin.com/posts/annepartington_leadership-innovationculture-futureofwork-activity-7397383115016400897-dPKj\nActivity: Liked by\nCuriosity is the key that unlocks new possibilities.\nLately, I keep coming back to this: innovation grows when curiosity leads and judgment steps…\n### https://nl.www.linkedin.com/posts/elskeheeren_buzzwords-zijn-lekker-makkelijk-totdat-je-activity-7407366651500707840-W5Hk\nActivity: Liked by\nBuzzwords zijn lekker makkelijk. Totdat je iets moet DOEN\nExperimenteren, psychologische veiligheid. Een complexe wereld, onzekerheid. Er wordt…\n### https://www.linkedin.com/posts/tracydefoe_yearinreview-activity-7407125854146895873-1icN\nActivity: Liked by\nShout out to Tilo Schwarz, the person I connected with the most on LinkedIn this year. #YearinReview\n### https://www.linkedin.com/posts/ari-vaisanen_yearinreview-katacoachingdojo-activity-7407139069584936960-nf4n\nActivity: Liked by\nShout out to Tilo Schwarz, the person I connected with the most on LinkedIn in year 2025 #YearinReview #KataCoachingDojo\n...and not only on LinkedIn…\n### https://www.linkedin.com/posts/spreadtheleanlove_we-do-not-learn-from-experience-we-learn-activity-7407061040196116481-JSek\nActivity: Liked by\n“We do not learn from experience… we learn from reflecting on experience.” -John Dewey\nIt’s the holiday season, when red and green is everywhere...…\n### https://www.linkedin.com/posts/mike-rother-472900297_𝗜𝗺𝗽𝗿𝗼𝘃𝗲𝗺𝗲𝗻𝘁-𝗮𝘀-𝗜𝗻𝗾𝘂𝗶𝗿𝘆-activity-7407082265761001472-LGoA\nActivity: Shared by\n𝗜𝗺𝗽𝗿𝗼𝘃𝗲𝗺𝗲𝗻𝘁 𝗮𝘀 𝗜𝗻𝗾𝘂𝗶𝗿𝘆\nThis seems like a strong example of scientific thinking and scientific process in practice, and a nice…"
      },
      {
        "title": "The Toyota Kata Website",
        "url": "https://public.websites.umich.edu/~jmondisa/TK/Homepage.html",
        "snippet": "TOYOTA KATA\n\n3.\n\nKata Creates\n\nCulture\n\n5.\n\nThe TK\n\nStarter Kata\n\nValue Stream Mapping\n\nSupporting Materials\n\nExtras\n\n1.\n\nImprovement Kata\n\nChallenge\n\n2.\n\nCoaching\n\nKata\n\n4.\n\nGetting\n\nStarted\n\nTOYOTA\n\nKATA\n\nThe\n\nImprovement\n\nKata Exercise\n\nA way to practice and develop scientific thinking\n\nMy name is Mike Rother. We studied Toyota’s management system and here’s what we\n\nfound: They practice and teach a pattern of scientific thinking every day, with managers and supervisors as the coaches. Toyota Kata shows you how anyone can do that with their team.\n\nTake advantage of the many resources on this website. If you’re a manager, supervisor or\n\nteam leader, get the [Toyota Kata Practice Guide](https://www.amazon.com/Toyota-Kata-Practice-Guide-Practicing/dp/1264983816). If you’re a K-12 educator, check out\n\n[Kata in the Classroom](https://www.katatogrow.com/). If you’re a professor, visit [Toyota Kata at University](https://polesante.hec.ca/toyota-kata/).\n\nYou’ll also find many Toyota Kata resources around the web. A few examples:\n\nToyota Kata is a way for managers and educators to initiate and\n\ncoach practice of practical scientific-thinking skills in their teams,\n\nto develop and mobilize creative capability. Competitive conditions\n\nfavor teams and organizations that know how to adapt. It’s not as\n\ndifficult as you might think, because you can begin by practicing a\n\nset of simple “Starter Kata.”\n\nToyota Kata is about starter practice routines for developing scientific\n\nthinking. From there each individual & team can develop their own way.\n\nToyota Kata is a skill-building process that shifts you and your team from a natural tendency to\n\njump to conclusions ... to thinking, working and reacting more scientifically. Best of all, you only\n\nneed to practice 20 minutes a day, under the guidance of your coach.\n\nHow to\n\nrun a KPD\n\nFind one\n\nnear you!\n\nTK\n\nVideos\n\nThe Kata Schools\n\nPractitioner\n\nDays\n\nPopular\n\nPresentations\n\nSlide\n\nShares\n\nTK at\n\nUniversity\n\nFor K-12\n\nEducators\n\nTK In\n\nEducation\n\nFor\n\nProfessors\n\nTK basics on\n\nyour laptop\n\n3hr Online\n\nCourse"
      },
      {
        "title": "The Improvement Kata",
        "url": "http://www-personal.umich.edu/~mrother/The_Improvement_Kata.html",
        "snippet": "The Improvement Kata\n3.\nKata Creates\nCulture\n5.\nThe TK\nStarter Kata\n![](The_Improvement_Kata_files/shapeimage_1.png)\n![](The_Improvement_Kata_files/shapeimage_2.png)\nValue Stream Mapping\nSupporting Materials\n![](The_Improvement_Kata_files/shapeimage_3.png)\nExtras\n![](The_Improvement_Kata_files/shapeimage_4.png)\n1.\nImprovement Kata\n![](The_Improvement_Kata_files/shapeimage_5.png)\nChallenge\n![](The_Improvement_Kata_files/shapeimage_6.png)\n2.\nCoaching\nKata\n![](The_Improvement_Kata_files/shapeimage_7.png)\n![](The_Improvement_Kata_files/shapeimage_8.png)\n4.\nGetting\nStarted\n![](The_Improvement_Kata_files/shapeimage_9.png)\nTOYOTA\nKATA\n![](The_Improvement_Kata_files/TK_LOGO_FINAL_WHITE.png)\nThe\nImprovement\nKata Exercise\n![](The_Improvement_Kata_files/shapeimage_10.png)\n![](The_Improvement_Kata_files/shapeimage_11.png)\nThe Improvement Kata + Starter Kata\n[![](The_Improvement_Kata_files/ST%20Diagram.jpg)](KATA_Files/Scientific_Thinking.pdf)\n[![](The_Improvement_Kata_files/Screen%20shot%202015-11-06%20at%206.32.27%20PM.jpg)](KATA_Files/IK_Poster.pdf)\nA four-step model of scientific thinking, with practice routines\nToday's prescriptions probably won’t fit tomorrow's problems, and the path to a\nchallenging goal can’t be determined in advance anyway. Your best bet is to practice\na universal means of developing your own solutions (a “meta skill” for any situation).\nThat’s what you learn by practicing the Improvement Kata.\nWhen conditions are complex and dynamic, scientific thinking may be the best\napproach we have for navigating. Scientific thinking means knowing that any idea\nshould be tested. It means learning to compare what you think (theory) with what\nactually happens (evidence), and adjusting based on what you discover from the\ndifference. It’s a way of thinking that makes us better at reaching difficult goals\nthrough unpredictable territory.\nHowever, scientific thinking is not our natural, default\nmode. What normally happens is that our brain\nquickly and unconsciously jumps to conclusions.\nScientific thinking is not difficult, it’s just not our habit.\nAdults learn scientific thinking through practice. There are simple “Starter Kata” practice\nroutines for each step of the Improvement Kata, and for coaching, whichspeed up your\nlearning and make it easier to scale in teams and organizations. The Improvement Kata\nmodels a pattern of practical, everyday scientific thinking, and the\nStarter Kata are what you practice to develop the thinking.\nInstructions for the Starter Kata are inthe[Toyota Kata Practice Guide](https://www.amazon.com/Toyota-Kata-Practice-Guide-Practicing/dp/1264983816).\n![](The_Improvement_Kata_files/TOK.jpg)\n[Next:  2. The Coaching Kata &gt;&gt;](The_Coaching_Kata.html)\n![](The_Improvement_Kata_files/shapeimage_12.png)\n&quot;If you go through the Improvement Kata process\nyou'll get to where you need to get to.  And the\nmore times you do it the better you will get at it.&quot;\n\\~ Jim Huntzinger, President, Lean Frontiers\n&quot;Go where there is no path\nand leave a trail.&quot;\\~ Emerson\n![](The_Improvement_Kata_files/shapeimage_13.png)\nExcerpt from:  Ichijo, Kazuo and Nonaka, Ikujiro,Knowledge Creation and Management:  New Challenges for Managers, Oxford University Press, 2006, page 25.\nLearning to Learn\nKnowledge assets are not just the knowledge already created, such as know-how, patents, technologies, or brands, but also include the knowledge to create knowledge, such as the organizational capability to innovate.  Although current views on knowledge assets tend to focus on the former because they are easier to measure and deal with, it is the latter that need more attention because they are the source of new knowledge to be created, and therefore a source of the future value of the firm.\nOne of the most important knowledge assets for a firm is a firm-specifickata(roughly, &quot;pattern&quot; or &quot;Way of doing things&quot;) of dialogues and practices.  Nelson and Winter (1982) emphasize the importance of routines for the firm's evolutionary process.  Here, we focus on &quot;creative routines&quot; ofkata, which make knowledge creation possible by fostering creativity and preserving efficiency.\n![](The_Improvement_Kata_files/Screen%20shot%202014-05-05%20at%209.36.32%20AM.jpg)\n![](The_Improvement_Kata_files/shapeimage_14.png)\nImprovement Kata Poster\n(click image for a pdf)\nYou can start practicing one Starter Kata today:\n1. ★You’re a manager who needs to run a meeting and are wondering how to best do that.\n2. ★You would like to add useful (and marketable) skills to your personal portfolio.\n3. ★You’re an educator who wants to help students practice critical-thinking STEM skills.\n4. ★You want to empower your teams.\n5. ★You’re curious about the Improvement Kata.\n6. ★You want to develop the necessary mindset to use Lean techniques.\n7. ★Your new business is growing and you need a management system.\nTake a first mini step today. Print out theImprovement Kata posterand get a fewfive\nquestion cards. Read through the questions on the card, in the order shown, with your\nteam, in meetings, etc. You’ll be adding scientific-thinking focus and flow to any meeting.\n[![](The_Improvement_Kata_files/IK%20Poster.jpg)](KATA_Files/IK_Poster.pdf)\n[![](The_Improvement_Kata_files/TK_Card_Front.jpg)](KATA_Files/5Q_Card.pdf)\nFive-Question Card\n(click the card, or get preprinted cards[here](https://www.dollarbillcoursepacks.com/collections/dollar-bill-printing-products/products/toyota-kata))\n![](The_Improvement_Kata_files/shapeimage_15.jpg)\n[![](The_Improvement_Kata_files/Backstory%20Button.jpg)](KATA_Files/TK_Backstory.pdf)\nClick to read about\nthe TK research\nand findings\n[![](The_Improvement_Kata_files/click-button.png)](KATA_Files/5Q_Card.pdf)\n[![](The_Improvement_Kata_files/Intro%20to%20IK%20Thumb.jpg)](http://www.slideshare.net/mike734/introduction-to-the-improvement-kata)\n[![](The_Improvement_Kata_files/Memory%20Aid%20Thumb.jpg)](https://www.youtube.com/watch?v=INMQHgrkcM4)\n[![](The_Improvement_Kata_files/SK%20Button.jpg)](KATA_Files/Starter_Kata_Flowchart.pdf)"
      },
      {
        "title": "Building Scientific Thinking Habits by Practicing Kata",
        "url": "https://nwirc.org/building-scientific-thinking-habits-by-practicing-kata/",
        "snippet": "[Skip to the content](https://nwirc.org/building-scientific-thinking-habits-by-practicing-kata/#site-content)\n![Building Scientific Thinking Habits by Practicing Kata](https://nwirc.org/wp-content/themes/NWIRCTheme/images/resource_hero.jpg)\n# Building Scientific Thinking Habits by Practicing Kata\n#### _By Mike Rother_\n**(Author of _Toyota Kata, The Toyota Kata Practice Guide, Toyota Kata Culture_, and _Learning to See)_**\nLean training seemed fairly straightforward in the 1990s, as it focused on tools and general concepts. But deeper study of Toyota showed us that its visible tools and practices are built on an invisible, scientific way of thinking. At Toyota you set challenging goals and experiment your way toward them—adding to knowledge as you take steps—instead of trying to decide your way to them.\nThat’s a way of thinking and acting you have to learn, because it does not come naturally to humans. The default way we think about problems often involves jumping to conclusions—not scientific thinking—because the brain doesn’t like uncertainty. The unconscious part of our brain takes bits of surface information, quickly extrapolates to fill in blanks, and gives us a false sense of confidence. And then we start making costly mistakes. However… we do have the power to change our thinking.\n**Deliberate Practice to Change Habits**\nChanging mindset involves weaving new neural pathways, by practicing a new way, which over time replace old pathways. Want to lose weight? Practice new patterns of eating and exercise. This raises the bar on educating ourselves to think more scientifically, since books, seminars or workshops alone probably won’t change our habits. There are many practice guides for learning how to play music, cook, paint, play a sport, play chess, and countless other pursuits, yet surprisingly few for the useful skill of scientific thinking. Toyota Kata aims to change this.\n**Some Ingredients**\nWe have a pretty good idea of what does work for changing habits of mind—daily practice sessions of some new routines, in the real workplace, with corrective feedback from a coach. Every time you think or do something you’re more likely to do it again. First, we’ll need some model of scientific thinking, in components or steps that can be taught one by one. Second, there should be a coach who can provide corrective feedback to the learner, so the learner practices and internalizes the right new patterns. Finally, we need some specific routines to practice, especially for beginners. These ingredients are exactly what the Toyota Kata Practice Guide provides.\nThe Improvement Kata is a four-step scientific pattern that learners follow to experiment their way through obstacles and achieve tough goals. The Coaching Kata is a pattern for teaching the Improvement Kata. It helps coaches practice sensing how the learner is thinking and giving effective feedback, in daily interactions called “coaching cycles.” But wait, there’s more. There are small, specific practice routines—called Starter Kata— for each step of the Improvement Kata. This is where beginners start and is an entryway to developing new skills and changing your mindset.\n**Starter Kata Help Us Build New Habits**\nPracticing Kata has been utilized for centuries as a way of preserving effective skillsets, transmitting them from person to person, and building effective teamwork. The goal is to master each Starter Kata’s fundamental pattern so you can then build on and adapt it in a variety of contexts as a reflex, with little thought or hesitation. Starter Kata are like a beginner musician practicing a musical scale. That’s their role. You don’t stick with playing a musical scale forever, you build on what you learned from practicing it. And the next learner who comes along then begins with the same Starter Kata. This is particularly useful if you want to build a shared way of thinking and acting—a deliberate culture—in a team or organization, because everyone begins with the same basics and develops a common language. Ultimately, though, Kata are not the important thing. What is important are the scientific skills and mindset that practicing them imparts, which you and your organization can use to strive for your particular goals, again and again. A good approach for the dynamic, unpredictable 21st\nCentury!\n* * *\n[Previous Post](https://nwirc.org/road-trip-to-targeted-pet-treats/) [Next Post](https://nwirc.org/nwircs-molly-reichard-is-certified-working-genius-facilitator/)"
      },
      {
        "title": "Mike Rother",
        "url": "https://en.wikipedia.org/wiki/Mike_Rother",
        "snippet": "[Jump to content](https://en.wikipedia.org/en.wikipedia.org#bodyContent)\n\nFrom Wikipedia, the free encyclopedia\n\nAmerican business academic\n\nFor the German experimental musician and composer, see [Michael Rother](https://en.wikipedia.org/wiki/Michael_Rother).\n\n| |\n| --- |\n| **A major contributor to this article appears to have a [close connection](https://en.wikipedia.org/wiki/Wikipedia:Conflict_of_interest) with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly [neutral point of view](https://en.wikipedia.org/wiki/Wikipedia:Neutral_point_of_view). Please discuss further on the [talk page](https://en.wikipedia.org/wiki/Talk:Mike_Rother)._(April 2017)__([Learn how and when to remove this message](https://en.wikipedia.org/wiki/Help:Maintenance_template_removal))_ |\n\n**Mike Rother** (born 1958, Michigan, USA) is an American researcher. He introduced the widespread business practices of _[Value Stream Mapping](https://en.wikipedia.org/wiki/Value_Stream_Mapping)_ and Toyota Kata (Improvement Kata + Coaching Kata). He has been affiliated with the [Industrial Technology Institute](https://en.wikipedia.org/w/index.php?title=Industrial_Technology_Institute&action=edit&redlink=1) ( [Ann Arbor](https://en.wikipedia.org/wiki/Ann_Arbor)), the [University of Michigan College of Engineering](https://en.wikipedia.org/wiki/University_of_Michigan_College_of_Engineering), the [Fraunhofer Institute](https://en.wikipedia.org/wiki/Fraunhofer_Institute) for Manufacturing Engineering and Automation ( [Stuttgart](https://en.wikipedia.org/wiki/Stuttgart)), and the [Technical University Dortmund](https://en.wikipedia.org/wiki/Technical_University_Dortmund).\n\n## Publications\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Mike_Rother&action=edit&section=1)\\]\n\n- _Learning to See: Value Stream Mapping to Add Value and Eliminate MUDA_ (1999)\n- _Creating Continuous Flow: An Action Guide for Managers, Engineers and Production Associates_ (2001)\n- _[Toyota Kata](https://en.wikipedia.org/wiki/Toyota_Kata): Managing People for Improvement, Adaptiveness and Superior Results_ (2009)\n- _The Toyota Kata Practice Guide: Practicing Scientific Thinking Skills for Superior Results in 20 Minutes a Day_ (2017)\n- _Toyota Kata Culture: Building Organizational Capability and Mindset through Kata Coaching_ (2017)\n\n## Awards\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Mike_Rother&action=edit&section=2)\\]\n\n- [Shingo Prize](https://en.wikipedia.org/wiki/Shingo_Prize) for Excellence in Manufacturing Research: Research and Professional Publication Award, 1999, 2003 and 2011[\\[1\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-1)\n- Association for Manufacturing Excellence Hall of Fame, 2013[\\[2\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-2)\n\n## References\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Mike_Rother&action=edit&section=3)\\]\n\n1. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-1)**[\"Recognition\"](https://web.archive.org/web/20141030002227/http://shingo.org/recognition/). Shingo Institute. Archived from [the original](http://shingo.org/recognition/) on 2014-10-30. Retrieved 2017-05-03.\n2. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-2)**[\"AME Hall of Fame\"](http://www.ame.org/ame-hall-fame). 21 January 2015. Retrieved 2017-05-03.\n\n## External links\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Mike_Rother&action=edit&section=4)\\]\n\n- Entry at Google Scholar [\\[1\\]](https://scholar.google.com/citations?user=nuHLW0sAAAAJ&hl=en&cstart=0&pagesize=20)\n- Entry at Research Gate [\\[2\\]](https://www.researchgate.net/profile/Mike_Rother)\n- Entry at University of Michigan [\\[3\\]](http://isd.engin.umich.edu/people/mike-rother)\n- Entry at WebMii [\\[4\\]](http://webmii.com/people?n=%22Mike%20Rother%22)\n\n| [Authority control databases](https://en.wikipedia.org/wiki/Help:Authority_control) |\n| --- |\n| International | - [ISNI](https://isni.org/isni/0000000071025118) - [VIAF](https://viaf.org/viaf/40274945) - [GND](https://d-nb.info/gnd/123006708) - [WorldCat](https://id.oclc.org/worldcat/entity/E39PBJmP746CJJKKcbPCJcDpfq) |\n| National | - [United States](https://id.loc.gov/authorities/no2001071107) - [Italy](https://opac.sbn.it/nome/UMCV311708) - [Czech Republic](https://aleph.nkp.cz/F/?func=find-c&local_base=aut&ccl_term=ica=utb2014832182&CON_LNG=ENG) - [Netherlands](http://data.bibliotheken.nl/id/thes/p274593750) - [Korea](https://lod.nl.go.kr/resource/KAC200803123) - [Poland](https://dbn.bn.org.pl/descriptor-details/9810623317105606) - [Israel](https://www.nli.org.il/en/authorities/987007316222505171) |\n| Academics | - [Google Scholar](https://scholar.google.com/citations?user=nuHLW0sAAAAJ) |\n| People | - [DDB](https://www.deutsche-digitale-bibliothek.de/person/gnd/123006708) |\n| Other | - [IdRef](https://www.idref.fr/081575866) - [Yale LUX](https://lux.collections.yale.edu/view/person/2ab4047e-832c-4c6e-b38d-8feffbb3bfe8) |\n\nRetrieved from \" [https://en.wikipedia.org/w/index.php?title=Mike\\_Rother&oldid=1246041283](https://en.wikipedia.org/w/index.php?title=Mike_Rother&oldid=1246041283)\"\n\n[Categories](https://en.wikipedia.org/wiki/Help:Category):\n\n- [1958 births](https://en.wikipedia.org/wiki/Category:1958_births)\n- [Writers from Michigan](https://en.wikipedia.org/wiki/Category:Writers_from_Michigan)\n- [American business theorists](https://en.wikipedia.org/wiki/Category:American_business_theorists)\n- [American business writers](https://en.wikipedia.org/wiki/Category:American_business_writers)\n- [University of Michigan faculty](https://en.wikipedia.org/wiki/Category:University_of_Michigan_faculty)\n- [Academic staff of the Technical University of Dortmund](https://en.wikipedia.org/wiki/Category:Academic_staff_of_the_Technical_University_of_Dortmund)\n- [Living people](https://en.wikipedia.org/wiki/Category:Living_people)\n\nHidden categories:\n\n- [Articles with short description](https://en.wikipedia.org/wiki/Category:Articles_with_short_description)\n- [Short description matches Wikidata](https://en.wikipedia.org/wiki/Category:Short_description_matches_Wikidata)\n- [Wikipedia articles with possible conflicts of interest from April 2017](https://en.wikipedia.org/wiki/Category:Wikipedia_articles_with_possible_conflicts_of_interest_from_April_2017)\n\nSearch\n\nSearch\n\nMike Rother\n\n1 language [Add topic](https://en.wikipedia.org/en.wikipedia.org)"
      },
      {
        "title": "Mike ROTHER | University of Michigan, Ann Arbor | U-M | Research profile",
        "url": "https://www.researchgate.net/profile/Mike-Rother",
        "snippet": "- [Home](https://www.researchgate.net/)\n- [University of Michigan](https://www.researchgate.net/institution/University-of-Michigan)\n- Mike Rother\n\n![Mike Rother](https://i1.rgstatic.net/ii/profile.image/11431281229744898-1710589159104_Q128/Mike-Rother.jpg)\n\n# Mike Rother [University of Michigan \\| U-M](https://www.researchgate.net/institution/University-of-Michigan)\n\nContact\n\n**Connect with experts in your field**\n\nJoin ResearchGate to contact this researcher and connect with your scientific community.\n\n[Join for free](https://www.researchgate.net/signup.SignUp.html)\n\n[Log in](https://www.researchgate.net/login?_sg=laC_w9QdcQ0-NX_oPPhQetKs0ys5MNKyUbm6PV-ZwKIk7aqjO1ZME_N4y4DjjUTX54iWOxjysG90tg)\n\nContact\n\n**Connect with experts in your field**\n\nJoin ResearchGate to contact this researcher and connect with your scientific community.\n\n[Join for free](https://www.researchgate.net/signup.SignUp.html)\n\n[Log in](https://www.researchgate.net/login?_sg=laC_w9QdcQ0-NX_oPPhQetKs0ys5MNKyUbm6PV-ZwKIk7aqjO1ZME_N4y4DjjUTX54iWOxjysG90tg)\n\n## About\n\n15\n\nPublications\n\n124,387\n\nReads\n\n**How we measure 'reads'**\n\nA 'read' is counted each time someone views a publication summary (such as the title, abstract, and list of authors), clicks on a figure, or views or downloads the full-text. [Learn more](https://explore.researchgate.net/display/support/Reads)\n\n3,147\n\nCitations\n\nIntroduction\n\nI work on making scientific thinking a skill and habit that anyone can learn -- and in the process become more comfortable with uncertainty -- through deliberate practice of the Improvement Kata and Coaching Kata patterns. Visit these two websites for more information... BUSINESS: ( [http://www-personal.umich.edu/~mrother/Homepage.html](https://www.researchgate.net/deref/http%3A%2F%2Fwww-personal.umich.edu%2F~mrother%2FHomepage.html)) K-12 EDUCATION: ( [www.katatogrow.com](https://www.researchgate.net/deref/http%3A%2F%2Fwww.katatogrow.com)).\n\n**Skills and Expertise**\n\n[Organizational Learning](https://www.researchgate.net/topic/Organizational-Learning)\n\nEducation\n\nSeptember 1987 - June 1989\n\n[![University of Michigan](https://i1.rgstatic.net/ii/institution.image/AS%3A11431281216329144%401704720862995_m)](https://www.researchgate.net/institution/University-of-Michigan)\n\n[**University of Michigan**](https://www.researchgate.net/institution/University-of-Michigan)\n\nField of study\n\n- Industrial & Operations Engineering\n\nSeptember 1976 - June 1981\n\n[![Michigan State University](https://i1.rgstatic.net/ii/institution.image/AS%3A267460614262784%401440778987042_m)](https://www.researchgate.net/institution/Michigan_State_University)\n\n[**Michigan State University**](https://www.researchgate.net/institution/Michigan_State_University)\n\nField of study\n\n- Market Research\n\n## Publications\n\nPublications (15)\n\n[Agile in a dynamic world](https://www.researchgate.net/publication/329306947_Agile_in_a_dynamic_world)\n\nArticle\n\n- Nov 2018\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n- [![M. Rosenthal](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)M. Rosenthal](https://www.researchgate.net/scientific-contributions/M-Rosenthal-2150222858)\n\n[View](https://www.researchgate.net/publication/329306947_Agile_in_a_dynamic_world)\n\n[![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)](https://www.researchgate.net/figure/fig1_325719370)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n[An Approach to Becoming Agile in a Dynamic World. Helping employees develop scientific thinking empowers them to solve problems and make decisions.](https://www.researchgate.net/publication/325719370_An_Approach_to_Becoming_Agile_in_a_Dynamic_World_Helping_employees_develop_scientific_thinking_empowers_them_to_solve_problems_and_make_decisions)\n\nArticle\n\nFull-text available\n\n- Jun 2018\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\nThe authors propose the following:\n(1) In complex, dynamic conditions, organizations do well to operate in an adaptive, Agile manner. This requires moving some decision-making downward, closer to where the action and quick feedback are, as opposed to traditional, centralized command-and-control.\n(2) Successfully moving decision-making downward ma...\n\n[View](https://www.researchgate.net/publication/325719370_An_Approach_to_Becoming_Agile_in_a_Dynamic_World_Helping_employees_develop_scientific_thinking_empowers_them_to_solve_problems_and_make_decisions)\n\n[![Figure I.1. Every time you think or do something, you are more likely...](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)](https://www.researchgate.net/figure/Every-time-you-think-or-do-something-you-are-more-likely-to-do-it-again_fig1_318109888)\n\n[![Figure I.2. Practicing Starter Kata helps you develop new thinking by...](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)](https://www.researchgate.net/figure/Practicing-Starter-Kata-helps-you-develop-new-thinking-by-introducing-new-behaviors_fig2_318109888)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n[The Toyota Kata Practice Guide: Developing Scientific Thinking Skills for Superior Results](https://www.researchgate.net/publication/318109888_The_Toyota_Kata_Practice_Guide_Developing_Scientific_Thinking_Skills_for_Superior_Results)\n\nBook\n\nFull-text available\n\n- Oct 2017\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\nCompanion to the book 'Toyota Kata.' Designed to help a coach (the manager) and a learner work together in developing scientific thinking skill and mindset through short daily practice.\n\n[View](https://www.researchgate.net/publication/318109888_The_Toyota_Kata_Practice_Guide_Developing_Scientific_Thinking_Skills_for_Superior_Results)\n\n[Toyota Kata Culture: Building Organizational Capability and Mindset through Kata Coaching](https://www.researchgate.net/publication/317292688_Toyota_Kata_Culture_Building_Organizational_Capability_and_Mindset_through_Kata_Coaching)\n\nBook\n\nFull-text available\n\n- May 2017\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\nIllustrates how one can develop a deliberate, scientific-thinking organizational culture, to develop and mobilize creative capability.\n\n[View](https://www.researchgate.net/publication/317292688_Toyota_Kata_Culture_Building_Organizational_Capability_and_Mindset_through_Kata_Coaching)\n\n[Cinq étapes pour mettre en œuvre la méthode Kata dans votre entreprise](https://www.researchgate.net/publication/301575413_Cinq_etapes_pour_mettre_en_oeuvre_la_methode_Kata_dans_votre_entreprise)\n\nArticle\n\n- Mar 2016\n\n- [![Sylvain Landry](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Sylvain Landry](https://www.researchgate.net/scientific-contributions/Sylvain-Landry-2107606622)\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n- [![Francis Halin](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Francis Halin](https://www.researchgate.net/scientific-contributions/Francis-Halin-2107612484)\n\nTerme emprunté aux arts martiaux, le kata est un mode de pensée qui privilégie la transmission du savoir au sein d’une organisation grâce à une pratique susceptible d’en accroître la compétitivité. Comment vous en inspirer au sein de votre entreprise ?\n\n[View](https://www.researchgate.net/publication/301575413_Cinq_etapes_pour_mettre_en_oeuvre_la_methode_Kata_dans_votre_entreprise)\n\n[![Figure 6. What is fundamental versus what is changeable  ](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)](https://www.researchgate.net/figure/What-is-fundamental-versus-what-is-changeable_fig1_283638261)\n\n[![Figure 7. Levels of skill development  ](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)](https://www.researchgate.net/figure/Levels-of-skill-development_fig2_283638261)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)\n\n[About the Toyota Kata Research](https://www.researchgate.net/publication/283638261_About_the_Toyota_Kata_Research)\n\nResearch\n\nFull-text available\n\n- Nov 2015\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\nBackground information about the original TK research and our ongoing efforts.\n\n[View](https://www.researchgate.net/publication/283638261_About_the_Toyota_Kata_Research)\n\n[One of the best](https://www.researchgate.net/publication/291129911_One_of_the_best)\n\nArticle\n\n- Feb 2014\n\n- [![Daniel T. Jones](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Daniel T. Jones](https://www.researchgate.net/profile/Daniel-Jones-72)\n- [![D. Markovitz](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)D. Markovitz](https://www.researchgate.net/scientific-contributions/D-Markovitz-2094825790)\n- [![J.P. Womack](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)J.P. Womack](https://www.researchgate.net/scientific-contributions/James-P-Womack-4902692)\n- \\[...\\]\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\n[View](https://www.researchgate.net/publication/291129911_One_of_the_best)\n\n[Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results](https://www.researchgate.net/publication/216744993_Toyota_Kata_Managing_People_for_Improvement_Adaptiveness_and_Superior_Results)\n\nBook\n\nFull-text available\n\n- Apr 2009\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\n[View](https://www.researchgate.net/publication/216744993_Toyota_Kata_Managing_People_for_Improvement_Adaptiveness_and_Superior_Results)\n\n[Learning to See](https://www.researchgate.net/publication/216776370_Learning_to_See)\n\nBook\n\n- Jun 1999\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n- [![John Y Shook](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)John Y Shook](https://www.researchgate.net/profile/John-Shook-3)\n\n[View](https://www.researchgate.net/publication/216776370_Learning_to_See)\n\n[Learning to See: Value Stream Mapping to Create Value and Eliminate Muda](https://www.researchgate.net/publication/244433983_Learning_to_See_Value_Stream_Mapping_to_Create_Value_and_Eliminate_Muda)\n\nBook\n\nFull-text available\n\n- Jun 1999\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\n[View](https://www.researchgate.net/publication/244433983_Learning_to_See_Value_Stream_Mapping_to_Create_Value_and_Eliminate_Muda)\n\n[Learning to See: Value Stream Mapping to Create Value and Eliminate Muda](https://www.researchgate.net/publication/246671677_Learning_to_See_Value_Stream_Mapping_to_Create_Value_and_Eliminate_Muda)\n\nBook\n\n- Jun 1999\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n- [![John Y Shook](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)John Y Shook](https://www.researchgate.net/profile/John-Shook-3)\n\n[View](https://www.researchgate.net/publication/246671677_Learning_to_See_Value_Stream_Mapping_to_Create_Value_and_Eliminate_Muda)\n\n[Crossroads: Which Way Will You Turn on the Road to Lean?](https://www.researchgate.net/publication/347571577_Crossroads_Which_Way_Will_You_Turn_on_the_Road_to_Lean)\n\nChapter\n\n- Nov 1997\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\n[View](https://www.researchgate.net/publication/347571577_Crossroads_Which_Way_Will_You_Turn_on_the_Road_to_Lean)\n\n[Course Title: Lean Construction Concepts and Methods](https://www.researchgate.net/publication/242284102_Course_Title_Lean_Construction_Concepts_and_Methods)\n\nArticle\n\n- [![Jeffrey Liker](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Jeffrey Liker](https://www.researchgate.net/scientific-contributions/Jeffrey-Liker-2014883945)\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n- [![John Y Shook](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)John Y Shook](https://www.researchgate.net/profile/John-Shook-3)\n\n[View](https://www.researchgate.net/publication/242284102_Course_Title_Lean_Construction_Concepts_and_Methods)\n\n[Criando Fluxo Contínuo](https://www.researchgate.net/publication/266072464_Criando_Fluxo_Continuo)\n\nArticle\n\n- [![Abelardo](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Abelardo](https://www.researchgate.net/scientific-contributions/Abelardo-2054703016)\n- [![Alves De Queiroz](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Alves De Queiroz](https://www.researchgate.net/scientific-contributions/Alves-De-Queiroz-2054765375)\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n- [![Rick Harris](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Rick Harris](https://www.researchgate.net/scientific-contributions/Rick-Harris-2054742151)\n\n[View](https://www.researchgate.net/publication/266072464_Criando_Fluxo_Continuo)\n\n[Value-Stream Mapping in a Make-to-Order Environment](https://www.researchgate.net/publication/267374365_Value-Stream_Mapping_in_a_Make-to-Order_Environment)\n\nArticle\n\nFull-text available\n\n- [![Mike Rother](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mN89OjNfwAJDwOxHEacwgAAAABJRU5ErkJggg==)Mike Rother](https://www.researchgate.net/profile/Mike-Rother)\n\nMake-to-order, very high variety and custom-product situations are often mistakenly considered unsuitable for continuous flow processing and load leveling, since the work content involved in making each different product type varies too much. In fact, you can approximate continuous flow and achieve many of its benefits in most make-to-order process...\n\n[View](https://www.researchgate.net/publication/267374365_Value-Stream_Mapping_in_a_Make-to-Order_Environment)\n\n[iframe](https://72a61b9193c66a0077719c2ee44cdf33.safeframe.googlesyndication.com/safeframe/1-0-40/html/container.html)\n\n**We and our partners use cookies** ✕\n\nBy using this site, you consent to the processing of your personal data, the storing of cookies on your device, and the use of similar technologies for personalization, ads, analytics, etc. For more information or to opt out, see our [Privacy Policy](https://www.researchgate.net/privacy-policy)\n\n[iframe](https://www.medtargetsystem.com/iframe/transition?client-origin=https%3A%2F%2Fwww.researchgate.net)[iframe](https://aim-tag.hcn.health/iframe.html?client-origin=https%3A%2F%2Fwww.researchgate.net&pageview-id=30523340-3ac0-11ef-8bce-f9ba998426bd&session=%7B%22id%22%3A%228608d350-3abd-11ef-ada0-917579cab140%22%2C%22timestamp%22%3A1720177114000%7D&stps=%7B%22clientCookieStore%22%3A%2285fd3a90-3abd-11ef-81a2-2d819fb4555a%22%2C%22clientLocalStorageStore%22%3A%2285fd3a90-3abd-11ef-81a2-2d819fb4555a%22%7D)[iframe](https://s.amazon-adsystem.com/iu3?cm3ppd=1&d=dtb-pub&csif=t&gdpr=0&dl=n-index_n-sharethrough_ppt_n-MediaNet_cnv)[iframe](https://tpc.googlesyndication.com/sodar/sodar2/225/runner.html)[iframe](https://www.google.com/recaptcha/api2/aframe)[iframe](https://contextual.media.net/checksync.php?vsSync=1&cs=8&cv=31&https=1&cid=8CUD41G14&prvid=99%2C77%2C56%2C590%2C261%2C294%2C251%2C262%2C461%2C222%2C157%2C201%2C246%2C4%2C203%2C214%2C446%2C326%2C10000%2C459%2C229%2C9%2C82%2C97&itype=PREBID&purpose1=1&gdprconsent=1&gdpr=0&coppa=0&usp_status=0&usp_consent=1)[iframe](https://js-sec.indexww.com/um/ixmatch.html)[iframe](https://ads.pubmatic.com/AdServer/js/user_sync.html?kdntuid=1&p=161519)[iframe](https://eb2.3lift.com/sync?)"
      },
      {
        "title": "Toyota Kata",
        "url": "https://en.wikipedia.org/wiki/Toyota_Kata",
        "snippet": "[Jump to content](https://en.wikipedia.org/en.wikipedia.org#bodyContent)\n\nFrom Wikipedia, the free encyclopedia\n\n| Front cover |\n| Author | Mike Rother |\n| Language | English |\n| Subject | [Management](https://en.wikipedia.org/wiki/Management) |\n| Publisher | [McGraw-Hill](https://en.wikipedia.org/wiki/McGraw-Hill) |\n| Publication date | August 4, 2009 |\n| Publication place | United States |\n| Media type | Hardcover & eBook |\n| Pages | 306 |\n| [ISBN](https://en.wikipedia.org/wiki/ISBN_(identifier)) | [978-0-07-163523-3](https://en.wikipedia.org/wiki/Special:BookSources/978-0-07-163523-3) |\n| [OCLC](https://en.wikipedia.org/wiki/OCLC_(identifier)) | [459790467](https://www.worldcat.org/oclc/459790467) |\n| [Dewey Decimal](https://en.wikipedia.org/wiki/Dewey_Decimal_Classification) | 658.3/01 22 |\n| [LC Class](https://en.wikipedia.org/wiki/LCC_(identifier)) | HD62.15 .R685 2010 |\n\nToyota Kata\n\n_**Toyota Kata**_ is a management book by [Mike Rother](https://en.wikipedia.org/wiki/Mike_Rother). The book explains the Improvement Kata and Coaching Kata, which are a means for making the [continual improvement process](https://en.wikipedia.org/wiki/Continual_improvement_process) as observed at the [Toyota Production System](https://en.wikipedia.org/wiki/Toyota_Production_System) teachable.[\\[1\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-1)\n\n## Overview\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Toyota_Kata&action=edit&section=1)\\]\n\n_Toyota Kata_ defines _management_ as, “the systematic pursuit of desired conditions by utilizing human capabilities in a concerted way.”[\\[2\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-Rother2009-2): 15  Rother proposes that it is not solutions themselves that provide sustained competitive advantage and long-term survival, but the degree to which an organization has mastered an effective routine for developing fitting solutions again and again, along unpredictable paths. This requires teaching the skills behind the solution.[\\[3\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-3)\n\nIn this management approach a primary job of leaders and managers is to develop people so that desired results can be achieved. They do this by having the organization members (leaders and managers included) deliberately practice a routine, or [kata](https://en.wikipedia.org/wiki/Kata), that develops and channels their creative abilities. _Kata_ are patterns that are practiced so they become second nature, and were originally movement sequences in martial arts.[\\[2\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-Rother2009-2): 15 [\\[4\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-4)\n\nTwo major components of a kata are a **Coaching Kata** and an **Improvement Kata.** The Coaching Kata helps to develop skill in supporting learners — as the learner practices an Improvement Kata. Without coaching, a learner may not practice correctly or ineffectively, and a change is less likely. But because coaching itself is a skill that requires practice, the Coaching Kata helps to develop the skills to support a learner practicing an Improvement Kata. In other word, the Coaching Kata is practiced by managers, supervisors and team leaders who want to coach their learners in a scientific way of thinking and acting.\n\n## The Improvement Kata\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Toyota_Kata&action=edit&section=2)\\]\n\nThe Improvement Kata is a routine for moving from the current situation to a new situation in a creative, directed, meaningful way. It is based on a four-part model:\n\n1. In consideration of a vision or direction...\n2. Grasp the current condition.\n3. Define the next target condition.\n4. Move toward that target condition iteratively, which uncovers obstacles that need to be worked on.\n\nIn contrast to approaches that attempt to predict the path and focus on implementation, the Improvement Kata builds on discovery that occurs along the way. Teams using the Improvement Kata learn as they strive to reach a target condition, and adapt based on what they are learning.[\\[5\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-5)\n\n_Toyota Kata_ submits that the Improvement Kata pattern of thinking and behavior is universal; applicable not only in business but in education, politics, daily living, etc.. The book's underlying message is that when people practice and learn a kata for how to proceed through unclear territory, they don't need to fear the obstacles, changes and unknowns they encounter. Rather than trying to hold on to a sense of certainty based on one's perspective, people can derive confidence from a kata for working through uncertainty.[\\[2\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-Rother2009-2): 18\n\nThe notion of Improvement Kata as a process of continuous improvement contributed also to the formation of the DevOps movement.[\\[6\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-6)\n\n## The Coaching Kata\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Toyota_Kata&action=edit&section=3)\\]\n\nThe Coaching Kata is a routine used to teach the improvement kata and requires prior experience with practicing the Improvement Kata.[\\[2\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-Rother2009-2): 171  The teaching approach embodied in the improvement kata within the [Toyota](https://en.wikipedia.org/wiki/Toyota) model emphasizes a continuous, respectful mentor-mentee relationship. This method is centered around several key principles:[\\[7\\]](https://en.wikipedia.org/en.wikipedia.org#cite_note-7)\n\n1. Ongoing Coaching Necessity\n2. Foundation of Respect and TrustUniversal Coaching System\n3. High Skill Standards for Coaches\n4. Importance of A3 Thinking\n5. Role of the Coach\n6. Self-Directed Solution Finding\n7. Accountability of Results\n\nThis method showcases a patient, respectful, and immersive learning culture, where [continuous improvement](https://en.wikipedia.org/wiki/Continual_improvement_process) is not just a goal but a journey of collaborative growth and shared responsibility.\n\n## References\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Toyota_Kata&action=edit&section=4)\\]\n\n1. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-1)**[\"Centre for Industrial services\"](https://cis.tennessee.edu/consulting/Pages/KATA.aspx). University of Tennessee.\n2. ^ [_**a**_](https://en.wikipedia.org/en.wikipedia.org#cite_ref-Rother2009_2-0) [_**b**_](https://en.wikipedia.org/en.wikipedia.org#cite_ref-Rother2009_2-1) [_**c**_](https://en.wikipedia.org/en.wikipedia.org#cite_ref-Rother2009_2-2) [_**d**_](https://en.wikipedia.org/en.wikipedia.org#cite_ref-Rother2009_2-3)Mike Rother (4 September 2009). [_Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results_](https://books.google.com/books?id=rFDq1DYprzYC). McGraw Hill Professional. [ISBN](https://en.wikipedia.org/wiki/ISBN_(identifier)) [978-0-07-163985-9](https://en.wikipedia.org/wiki/Special:BookSources/978-0-07-163985-9).\n3. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-3)**[\"Toyota Kata course\"](http://asq.org/training/toyota-kata-improving-and-coaching-your-way-to-success_TKWS.html). ASQ.\n4. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-4)**[\"Toyota Kata Engaged leadership\"](http://theleanthinker.com/2010/06/28/toyota-kata-the-how-of-engaged-leadership/). The Lean Thinker Blog. 28 June 2010.\n5. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-5)**[\"Kata Habits\"](http://www.systems2win.com/LK/lean/kata.htm). Systems2win.\n6. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-6)**The DevOps Handbook: How to Create World-Class Agility, Reliability, and Security in Technology Organizations, Gene Kim, Patrick Debois, John Willis, Jezz Humble, 2016, p.6 and p.355\n7. **[^](https://en.wikipedia.org/en.wikipedia.org#cite_ref-7)**Jurasz, Jarosław; Wołoszczuk, Wiktor; Wołoszczuk, Jarosław Jurasz , Wiktor (2022-10-29). [\"KATA in Toyota Production System\"](https://leancommunity.org/kata/). _Lean Community_. Retrieved 2024-01-13.`{{cite web}}`: CS1 maint: multiple names: authors list ( [link](https://en.wikipedia.org/wiki/Category:CS1_maint:_multiple_names:_authors_list))\n\n## External links\n\n\\[ [edit](https://en.wikipedia.org/w/index.php?title=Toyota_Kata&action=edit&section=5)\\]\n\n- Dave Moran, [Book review](http://www.softwareresults.us/2011/09/book-review-toyota-kata.html), Software Results, 23 September 2011\n- Dirk Dusharme, [A Kata for Developing Solutions](http://www.qualitydigest.com/inside/quality-insider-article/kata-dynamic-conditions.html) – interview with Mike Rother, QualityDigest.com, 10 June 2010\n- Kata Practitioner Days KPD, [Open source recommendations for running a KPD](https://katasummit.com/kpd/) – sample agendas and promotion ideas\n- KataCon, [Annual Gathering of Kata Proponents](http://katasummit.com)\n\nRetrieved from \" [https://en.wikipedia.org/w/index.php?title=Toyota\\_Kata&oldid=1213209760](https://en.wikipedia.org/w/index.php?title=Toyota_Kata&oldid=1213209760)\"\n\n[Categories](https://en.wikipedia.org/wiki/Help:Category):\n\n- [Business books](https://en.wikipedia.org/wiki/Category:Business_books)\n- [2009 non-fiction books](https://en.wikipedia.org/wiki/Category:2009_non-fiction_books)\n- [Toyota Production System](https://en.wikipedia.org/wiki/Category:Toyota_Production_System)\n\nHidden category:\n\n- [CS1 maint: multiple names: authors list](https://en.wikipedia.org/wiki/Category:CS1_maint:_multiple_names:_authors_list)\n\nSearch\n\nSearch\n\n_Toyota Kata_\n\n5 languages [Add topic](https://en.wikipedia.org/en.wikipedia.org)"
      },
      {
        "title": "Mike Rother: books, biography, latest update",
        "url": "https://www.amazon.com/stores/Mike-Rother/author/B002AQBVLE?isDramIntegrated=true&shoppingPortalEnabled=true",
        "snippet": "![](https://fls-na.amazon.com/1/batch/1/OP/ATVPDKIKX0DER:134-0058438-9441214:3ZWRQ5DVX3AT7EYSDX0V$uedata=s:%2Frd%2Fuedata%3Fstaticb%26id%3D3ZWRQ5DVX3AT7EYSDX0V:0)![](https://m.media-amazon.com/images/G/01/gno/sprites/nav-sprite-global-1x-reorg-privacy._CB546805360_.png)\n\n[![Visit Mike Rother Store on Amazon](https://m.media-amazon.com/images/S/amzn-author-media-prod/81q0p50dnluc2i52jqq8vd26fn._SY450_CR0%2C0%2C450%2C450_.jpg)](https://www.amazon.com/stores/author/B002AQBVLE)\n\n[![Visit Mike Rother Store on Amazon](https://m.media-amazon.com/images/S/amzn-author-media-prod/81q0p50dnluc2i52jqq8vd26fn._SY450_CR0%2C0%2C450%2C450_.jpg)](https://www.amazon.com/stores/author/B002AQBVLE)\n\n# Mike Rother\n\n## About the author\n\nThank you to all the people, teams and organizations practicing the Toyota Kata \"Starter Kata\" to develop practical, everyday scientific thinking skills—for working together in meeting challenges. We're learning with you! Visit the Toyota Kata Website at: www-personal.umich.edu/~mrother\n\n[Read full bio](https://www.amazon.com/stores/author/B002AQBVLE/about)\n\n## Most popular\n\n![](https://m.media-amazon.com/images/I/91sjFIFmmJL._CR0%2C0%2C0%2C130_.jpg)\n\nToyota Kata: Managing People for Improvement, Adaptiveness and Superior Results\n\n_4.6 out of 5 stars_\n\n712\n\n4.6 out of 5 stars. 712 customer reviews.\n\nKindle Edition\n\n$14.79was: $32.40\n\n## Books\n\n**We couldn’t find anything matching these filters** Clear filters (0)\n\n## Customers also bought items by\n\n- [![](https://m.media-amazon.com/images/S/amzn-author-media-prod/it3hsf1c096r1jguein5072pen._SX300_CR0%2C0%2C300%2C300_.jpg)\\\n\\\nJeffrey K. Liker](https://www.amazon.com/stores/author/B001H6NRUQ?ref_=ast_author_cabib)\n- [![](https://m.media-amazon.com/images/I/21pOwqsJImL._SX169_CR0%2C0%2C169%2C169_.jpg)\\\n\\\nJames P. Womack](https://www.amazon.com/stores/author/B000APGWAM?ref_=ast_author_cabib)\n- [![](https://m.media-amazon.com/images/I/11S5yGbQALL._SX130_CR0%2C0%2C130%2C130_.jpg)\\\n\\\nEliyahu M. Goldratt](https://www.amazon.com/stores/author/B000APWH4C?ref_=ast_author_cabib)\n- [![](https://m.media-amazon.com/images/I/7108IZpb3AL._SY300_CR47%2C0%2C300%2C300_.jpg)\\\n\\\nArt Smalley](https://www.amazon.com/stores/author/B003AUTKXU?ref_=ast_author_cabib)\n\nBack to top\n\nGet to Know Us\n\n- [Careers](https://www.amazon.jobs)\n- [Amazon Newsletter](https://email.aboutamazon.com/l/637851/2020-10-29/pd87g?utm_source=gateway&utm_medium=amazonfooters&utm_campaign=newslettersubscribers&utm_content=amazonnewssignup)\n- [About Amazon](https://www.aboutamazon.com/?utm_source=gateway&utm_medium=footer&token=about)\n- [Accessibility](https://www.amazon.com/b?node=15701038011&ie=UTF8)\n- [Sustainability](https://sustainability.aboutamazon.com/?utm_source=gateway&utm_medium=footer&ref_=susty_footer)\n- [Press Center](https://www.amazon.com/pr)\n- [Investor Relations](https://www.amazon.com/ir)\n- [Amazon Devices](https://www.amazon.com/gp/browse.html?node=2102313011&ref_=footer_devices)\n- [Amazon Science](https://www.amazon.science)\n\nMake Money with Us\n\n- [Sell on Amazon](https://sell.amazon.com/?ld=AZFSSOA_FTSELL-C&ref_=footer_soa)\n- [Sell apps on Amazon](https://developer.amazon.com)\n- [Supply to Amazon](https://supply.amazon.com)\n- [Protect & Build Your Brand](https://sell.amazon.com/brand-registry?ld=AZUSSOA_ABR-FT)\n- [Become an Affiliate](https://affiliate-program.amazon.com/)\n- [Become a Delivery Driver](https://www.fountain.com/jobs/amazon-delivery-service-partner?utm_source=amazon.com&utm_medium=footer)\n- [Start a Package Delivery Business](https://logistics.amazon.com/marketing?utm_source=amzn&utm_medium=footer&utm_campaign=home)\n- [Advertise Your Products](https://advertising.amazon.com/?ref=ext_amzn_ftr)\n- [Self-Publish with Us](https://www.amazon.com/gp/seller-account/mm-summary-page.html?ld=AZFooterSelfPublish&topic=200260520&ref_=footer_publishing)\n- [Become an Amazon Hub Partner](https://www.amazon.com/b/?node=120788043011)\n- › [See More Ways to Make Money](https://www.amazon.com/b/?node=18190131011&ld=AZUSSOA-seemore&ref_=footer_seemore)\n\nAmazon Payment Products\n\n- [Amazon Visa](https://www.amazon.com/iss/credit/rewardscardmember?plattr=CBFOOT&ref_=footer_cbcc)\n- [Amazon Store Card](https://www.amazon.com/credit/storecard/member?plattr=PLCCFOOT&ref_=footer_plcc)\n- [Amazon Secured Card](https://www.amazon.com/dp/product/B084KP3NG6?plattr=SCFOOT&ref_=footer_ACB)\n- [Amazon Business Card](https://www.amazon.com/dp/B07984JN3L?plattr=ACOMFO&ie=UTF-8)\n- [Shop with Points](https://www.amazon.com/hp/shopwithpoints/servicing)\n- [Credit Card Marketplace](https://www.amazon.com/gp/browse.html?node=3561432011&ref_=footer_ccmp)\n- [Reload Your Balance](https://www.amazon.com/gp/browse.html?node=10232440011&ref_=footer_reload_us)\n- [Gift Cards](https://www.amazon.com/b/?node=2238192011&ref=shop_footer_payments_gc_desktop)\n- [Amazon Currency Converter](https://www.amazon.com/gp/browse.html?node=388305011&ref_=footer_tfx)\n\nLet Us Help You\n\n- [Your Account](https://www.amazon.com/gp/css/homepage.html?ref_=footer_ya)\n- [Your Orders](https://www.amazon.com/gp/css/order-history?ref_=footer_yo)\n- [Shipping Rates & Policies](https://www.amazon.com/gp/help/customer/display.html?nodeId=468520&ref_=footer_shiprates)\n- [Amazon Prime](https://www.amazon.com/gp/prime?ref_=footer_prime)\n- [Returns & Replacements](https://www.amazon.com/gp/css/returns/homepage.html?ref_=footer_hy_f_4)\n- [Manage Your Content and Devices](https://www.amazon.com/hz/mycd/myx?ref_=footer_myk)\n- [Recalls and Product Safety Alerts](https://www.amazon.com/product-safety-alerts?ref_=footer_bsx_ypsa)\n- [Registry & Gift List](https://www.amazon.com/registries?ref_=nav_footer_registry_giftlist_desktop)\n- [Help](https://www.amazon.com/gp/help/customer/display.html?nodeId=508510&ref_=footer_gw_m_b_he)\n\n[English](https://www.amazon.com/customer-preferences/edit?ie=UTF8&preferencesReturnUrl=%2F&ref_=footer_lang) [United States](https://www.amazon.com/customer-preferences/country?ie=UTF8&preferencesReturnUrl=%2F&ref_=footer_icp_cp)\n\n- [**Amazon Music** Stream millions\\\n\\\nof songs](https://music.amazon.com?ref=dm_aff_amz_com)\n- [**Amazon Ads** Reach customers\\\n\\\nwherever they\\\n\\\nspend their time](https://advertising.amazon.com/?ref=footer_advtsing_amzn_com)\n- [**6pm** Score deals\\\n\\\non fashion brands](https://www.6pm.com)\n- [**AbeBooks** Books, art\\\n\\\n& collectibles](https://www.abebooks.com)\n- [**ACX** Audiobook Publishing\\\n\\\nMade Easy](https://www.acx.com/)\n- [**Sell on Amazon** Start a Selling Account](https://sell.amazon.com/?ld=AZUSSOA-footer-aff&ref_=footer_sell)\n- [**Veeqo** Shipping Software\\\n\\\nInventory Management](https://www.veeqo.com/?utm_source=amazon&utm_medium=website&utm_campaign=footer)\n\n- [**Amazon Business** Everything For\\\n\\\nYour Business](https://www.amazon.com/business?ref_=footer_retail_b2b)\n- [**Amazon Fresh** Groceries & More\\\n\\\nRight To Your Door](https://www.amazon.com/alm/storefront?almBrandId=QW1hem9uIEZyZXNo&ref_=footer_aff_fresh)\n- [**AmazonGlobal** Ship Orders\\\n\\\nInternationally](https://www.amazon.com/gp/browse.html?node=230659011&ref_=footer_amazonglobal)\n- [**Home Services** Experienced Pros\\\n\\\nHappiness Guarantee](https://www.amazon.com/services?ref_=footer_services)\n- [**Amazon Web Services** Scalable Cloud\\\n\\\nComputing Services](https://aws.amazon.com/what-is-cloud-computing/?sc_channel=EL&sc_campaign=amazonfooter)\n- [**Audible** Listen to Books & Original\\\n\\\nAudio Performances](https://www.audible.com)\n- [**Box Office Mojo** Find Movie\\\n\\\nBox Office Data](https://www.boxofficemojo.com/?ref_=amzn_nav_ftr)\n\n- [**Goodreads** Book reviews\\\n\\\n& recommendations](https://www.goodreads.com)\n- [**IMDb** Movies, TV\\\n\\\n& Celebrities](https://www.imdb.com)\n- [**IMDbPro** Get Info Entertainment\\\n\\\nProfessionals Need](https://pro.imdb.com?ref_=amzn_nav_ftr)\n- [**Kindle Direct Publishing** Indie Digital & Print Publishing\\\n\\\nMade Easy](https://kdp.amazon.com)\n- [**Amazon Photos** Unlimited Photo Storage\\\n\\\nFree With Prime](https://www.amazon.com/gp/browse.html?node=13234696011&ref_=_gno_p_foot)\n- [**Prime Video Direct** Video Distribution\\\n\\\nMade Easy](https://videodirect.amazon.com/home/landing)\n- [**Shopbop** Designer\\\n\\\nFashion Brands](https://www.shopbop.com)\n\n- [**Amazon Resale** Great Deals on\\\n\\\nQuality Used Products](https://www.amazon.com/gp/browse.html?node=10158976011&ref_=footer_wrhsdls)\n- [**Whole Foods Market** America’s Healthiest\\\n\\\nGrocery Store](https://www.wholefoodsmarket.com)\n- [**Woot!** Deals and\\\n\\\nShenanigans](https://www.woot.com/)\n- [**Zappos** Shoes &\\\n\\\nClothing](https://www.zappos.com)\n- [**Ring** Smart Home\\\n\\\nSecurity Systems](https://ring.com)\n- [**eero WiFi** Stream 4K Video\\\n\\\nin Every Room](https://eero.com/)\n- [**Blink** Smart Security\\\n\\\nfor Every Home](https://blinkforhome.com/?ref=nav_footer)\n\n- [**Neighbors App** Real-Time Crime\\\n\\\n& Safety Alerts](https://shop.ring.com/pages/neighbors-app)\n- [**Amazon Subscription Boxes** Top subscription boxes – right to your door](https://www.amazon.com/gp/browse.html?node=14498690011&ref_=amzn_nav_ftr_swa)\n- [**PillPack** Pharmacy Simplified](https://www.pillpack.com)\n- [**Amazon Renewed** Like-new products\\\n\\\nyou can trust](https://www.amazon.com/gp/browse.html?node=12653393011&ref_=footer_usrenew)\n\n- [Conditions of Use](https://www.amazon.com/gp/help/customer/display.html?nodeId=508088&ref_=footer_cou)\n- [Privacy Notice](https://www.amazon.com/gp/help/customer/display.html?nodeId=468496&ref_=footer_privacy)\n- [Consumer Health Data Privacy Disclosure](https://www.amazon.com/gp/help/customer/display.html?ie=UTF8&nodeId=TnACMrGVghHocjL8KB&ref_=footer_consumer_health_data_privacy)\n- [Your Ads Privacy Choices](https://www.amazon.com/privacyprefs?ref_=footer_iba)\n\n© 1996-2025, Amazon.com, Inc. or its affiliates"
      },
      {
        "title": "Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results",
        "url": "https://books.google.com/books/about/Toyota_Kata_Managing_People_for_Improvem.html?id=rFDq1DYprzYC",
        "snippet": "[Sign in](https://www.google.com/accounts/Login?service=print&continue=https://books.google.com/books%3Fid%3DrFDq1DYprzYC%26hl%3Den&hl=en&ec=GAZACg)\n\nHidden fields\n\n[![Screen reader users: click this link for accessible mode. Accessible mode has the same essential features but works better with your reader.](https://www.google.com/images/cleardot.gif)](https://books.google.com/books/about/Toyota_Kata_Managing_People_for_Improvem.html?id=rFDq1DYprzYC&hl=en&output=html_text)\n\n## [Books](https://books.google.com/books)\n\nTry the new Google Books\n\nCheck out the new look and enjoy easier access to your favorite features\n\n[Try it now](https://www.google.com/books/edition/_/rFDq1DYprzYC?hl=en&newbks=1)\n\n[No thanks](javascript://https:%2F%2Fbooks.google.com%2Fbooks%2Fabout%2FToyota_Kata_Managing_People_for_Improvem.html%3Fid=rFDq1DYprzYC)\n\n![](https://books.google.com/googlebooks/images/material/ogen_bookshelf.png)\n\n [![](https://books.google.com/googlebooks/images/material/book_icon_color.png)Try the new Google Books![](https://books.google.com/googlebooks/images/material/arrow_right_black_24dp.png)](https://www.google.com/books/edition/_/rFDq1DYprzYC?hl=en&newbks=1)\n\n1. [Try the new Google Books](https://www.google.com/books/edition/Toyota_Kata_Managing_People_for_Improvem/rFDq1DYprzYC?hl=en&newbks=1)\n2. [My library](https://www.google.com/accounts/Login?service=print&continue=https://books.google.com/books%3Fop%3Dlibrary&hl=en)\n3. [Help](http://books.google.com/support/topic/4359341?hl=en)\n4. [Advanced Book Search](https://books.google.com/advanced_book_search)\n\n[Buy eBook - $17.82](https://play.google.com/store/books/details?id=rFDq1DYprzYC&rdid=book-rFDq1DYprzYC&rdot=1&source=gbs_atb&pcampaignid=books_booksearch_atb)\n\nGet this book in print\n\n- [Amazon.com](http://www.amazon.com/gp/search?index=books&linkCode=qs&keywords=9780071639859)\n- [Barnes&Noble.com](https://www.barnesandnoble.com/w/_/_?ean=9780071639859)\n- [Books-A-Million](http://www.booksamillion.com/product/9780071639859)\n- [IndieBound](http://www.indiebound.org/book/9780071639859)\n- * * *\n\n- [Find in a library](https://books.google.com/url?id=rFDq1DYprzYC&q=http://worldcat.org/oclc/1103282485&clientid=librarylink&usg=AOvVaw3kz3PtefE_jaudRztIdl-0&source=gbs_buy_r)\n- [All sellers »](https://books.google.com/books?id=rFDq1DYprzYC&sitesec=buy&source=gbs_buy_r)\n\n| | | |\n| --- | --- | --- |\n| # Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results\n\n[![Front Cover](https://books.google.com/books/content?id=rFDq1DYprzYC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE70HlzC9iKvYsovusdDVjF0t3TrM6TB_3hnNMdolvu7VzzyzwAxWVwgnsqluvvW5-RtJDuivM5m2SrwJ-vxszz2gYF_qwX94F3CpCNtLYWGgd5zYThpfGC4dTG_qSQhDmagSAwPF)](https://books.google.com/books?id=rFDq1DYprzYC&printsec=frontcover&source=gbs_ge_summary_r&cad=0)\n\n[Mike Rother](https://www.google.com/search?tbo=p&tbm=bks&q=inauthor:%22Mike+Rother%22)\n\nMcGraw Hill Professional, Sep 4, 2009 \\- [Business & Economics](https://www.google.com/search?tbo=p&tbm=bks&q=subject:%22Business+%26+Economics%22&source=gbs_ge_summary_r&cad=0) \\- 400 pages\n\n**\" _Toyota Kata_ gets to the essence of how Toyota manages continuous improvement and human ingenuity, through its improvement kata and coaching kata. Mike Rother explains why typical companies fail to understand the core of lean and make limited progress—and what it takes to make it a real part of your culture.\"**\n\n**—Jeffrey K. Liker, bestselling author of _The Toyota Way_**\n**\"\\[ _Toyota Kata_ is\\] one of the stepping stones that will usher in a new era of management thinking.\"**\n\n**—The Systems Thinker**\n\n**\"How any organization in any industry can progress from old-fashioned management by results to a strikingly different and better way.\"**\n\n**—James P. Womack, Chairman and Founder, Lean Enterprise Institute**\n\n**\"Practicing the improvement kata is perhaps the best way we've found so far for actualizing PDCA in an organization.\"**\n\n**—John Shook, Chairman and CEO, Lean Enterprise Institute**\n\nThis game-changing book puts you behind the curtain at Toyota, providing new insight into the legendary automaker's management practices and offering practical guidance for leading and developing people in a way that makes the best use of their brainpower.\n\nDrawing on six years of research into Toyota's employee-management routines, _Toyota Kata_ examines and elucidates, for the first time, the company's organizational routines--called _kata_--that power its success with continuous improvement and adaptation. The book also reaches beyond Toyota to explain issues of human behavior in organizations and provide specific answers to questions such as:\n\n- How can we make improvement and adaptation part of everyday work throughout the organization?\n- How can we develop and utilize the capability of everyone in the organization to repeatedly work toward and achieve new levels of performance?\n- How can we give an organization the power to handle dynamic, unpredictable situations and keep satisfying customers?\n\nMike Rother explains how to improve our prevailing management approach through the use of two kata: Improvement Kata--a repeating routine of establishing challenging target conditions, working step-by-step through obstacles, and always learning from the problems we encounter; and Coaching Kata: a pattern of teaching the improvement kata to employees at every level to ensure it motivates their ways of thinking and acting.\n\nWith clear detail, an abundance of practical examples, and a cohesive explanation from start to finish, _Toyota Kata_ gives executives and managers at any level actionable routines of thought and behavior that produce superior results and sustained competitive advantage.\n\n| | | |\n| --- | --- | --- |\n| | | |\n\n[Preview this book »](https://books.google.com/books?id=rFDq1DYprzYC&printsec=frontcover) |\n\n### Selected pages\n\n[![Page 8](https://books.google.com/books/content?id=rFDq1DYprzYC&pg=PA8&img=1&zoom=1&sig=ACfU3U01_SRudb2r4sZrYAZFfCrnRWIf_A)](https://books.google.com/books?id=rFDq1DYprzYC&pg=PA8&source=gbs_selected_pages&cad=1)\n\n[Page 8](https://books.google.com/books?id=rFDq1DYprzYC&pg=PA8&source=gbs_selected_pages&cad=1)\n\n[![Table of Contents](https://books.google.com/books/content?id=rFDq1DYprzYC&pg=PR5&img=1&zoom=1&sig=ACfU3U2JcT2wEu_tv4P2EKZiTiV7WbE-RA)](https://books.google.com/books?id=rFDq1DYprzYC&pg=PR5&source=gbs_selected_pages&cad=1)\n\n[Table of Contents](https://books.google.com/books?id=rFDq1DYprzYC&pg=PR5&source=gbs_selected_pages&cad=1)\n\n### Contents\n\n| | |\n| --- | --- |\n| Part II Know Yourself | 21 |\n| | |\n| How Toyota Continuously Improves | 73 |\n| | |\n| How Toyota Teaches the Improvement Kata | 171 |\n| | |\n| What About Other Companies? | 229 |\n| | |\n| Conclusion | 261 |\n| | |\n| Appendix 1 Where Do You Start with the Improvement Kata? | 265 |\n| | |\n\n| | |\n| --- | --- |\n| Appendix 2 Process Analysis | 269 |\n| | |\n| Bibliography | 291 |\n| | |\n| Index | 297 |\n| | |\n| About the Author | 307 |\n| | |\n| [Copyright](https://books.google.com/books?id=rFDq1DYprzYC&printsec=copyright) | |\n| | |\n\n### Common terms and phrases\n\n[1x1 flow](https://books.google.com/books?id=rFDq1DYprzYC&q=1x1+flow&source=gbs_word_cloud_r&cad=3) [achieve](https://books.google.com/books?id=rFDq1DYprzYC&q=achieve&source=gbs_word_cloud_r&cad=3) [actually](https://books.google.com/books?id=rFDq1DYprzYC&q=actually&source=gbs_word_cloud_r&cad=3) [advance group](https://books.google.com/books?id=rFDq1DYprzYC&q=advance+group&source=gbs_word_cloud_r&cad=3) [assembly process](https://books.google.com/books?id=rFDq1DYprzYC&q=assembly+process&source=gbs_word_cloud_r&cad=3) [behavior patterns](https://books.google.com/books?id=rFDq1DYprzYC&q=behavior+patterns&source=gbs_word_cloud_r&cad=3) [capability](https://books.google.com/books?id=rFDq1DYprzYC&q=capability&source=gbs_word_cloud_r&cad=3) [challenge](https://books.google.com/books?id=rFDq1DYprzYC&q=challenge&source=gbs_word_cloud_r&cad=3) [changeover](https://books.google.com/books?id=rFDq1DYprzYC&q=changeover&source=gbs_word_cloud_r&cad=3) [Chapter](https://books.google.com/books?id=rFDq1DYprzYC&q=Chapter&source=gbs_word_cloud_r&cad=3) [coaching cycle](https://books.google.com/books?id=rFDq1DYprzYC&q=coaching+cycle&source=gbs_word_cloud_r&cad=3) [coaching kata](https://books.google.com/books?id=rFDq1DYprzYC&q=coaching+kata&source=gbs_word_cloud_r&cad=3) [continuous improvement](https://books.google.com/books?id=rFDq1DYprzYC&q=continuous+improvement&source=gbs_word_cloud_r&cad=3) [countermeasures](https://books.google.com/books?id=rFDq1DYprzYC&q=countermeasures&source=gbs_word_cloud_r&cad=3) [current condition](https://books.google.com/books?id=rFDq1DYprzYC&q=current+condition&source=gbs_word_cloud_r&cad=3) [define](https://books.google.com/books?id=rFDq1DYprzYC&q=define&source=gbs_word_cloud_r&cad=3) [develop](https://books.google.com/books?id=rFDq1DYprzYC&q=develop&source=gbs_word_cloud_r&cad=3) [effective](https://books.google.com/books?id=rFDq1DYprzYC&q=effective&source=gbs_word_cloud_r&cad=3) [efforts](https://books.google.com/books?id=rFDq1DYprzYC&q=efforts&source=gbs_word_cloud_r&cad=3) [engineers](https://books.google.com/books?id=rFDq1DYprzYC&q=engineers&source=gbs_word_cloud_r&cad=3) [example](https://books.google.com/books?id=rFDq1DYprzYC&q=example&source=gbs_word_cloud_r&cad=3) [experiment](https://books.google.com/books?id=rFDq1DYprzYC&q=experiment&source=gbs_word_cloud_r&cad=3) [factory](https://books.google.com/books?id=rFDq1DYprzYC&q=factory&source=gbs_word_cloud_r&cad=3) [facts and data](https://books.google.com/books?id=rFDq1DYprzYC&q=facts+and+data&source=gbs_word_cloud_r&cad=3) [Figure](https://books.google.com/books?id=rFDq1DYprzYC&q=Figure&source=gbs_word_cloud_r&cad=3) [five questions](https://books.google.com/books?id=rFDq1DYprzYC&q=five+questions&source=gbs_word_cloud_r&cad=3) [focus](https://books.google.com/books?id=rFDq1DYprzYC&q=focus&source=gbs_word_cloud_r&cad=3) [Fujio Cho](https://books.google.com/books?id=rFDq1DYprzYC&q=Fujio+Cho&source=gbs_word_cloud_r&cad=3) [Grasp the Current](https://books.google.com/books?id=rFDq1DYprzYC&q=Grasp+the+Current&source=gbs_word_cloud_r&cad=3) [heijunka](https://books.google.com/books?id=rFDq1DYprzYC&q=heijunka&source=gbs_word_cloud_r&cad=3) [implementation](https://books.google.com/books?id=rFDq1DYprzYC&q=implementation&source=gbs_word_cloud_r&cad=3) [improvement and adaptation](https://books.google.com/books?id=rFDq1DYprzYC&q=improvement+and+adaptation&source=gbs_word_cloud_r&cad=3) [improvement kata behavior](https://books.google.com/books?id=rFDq1DYprzYC&q=improvement+kata+behavior&source=gbs_word_cloud_r&cad=3) [Improvement Kata model](https://books.google.com/books?id=rFDq1DYprzYC&q=Improvement+Kata+model&source=gbs_word_cloud_r&cad=3) [inventory](https://books.google.com/books?id=rFDq1DYprzYC&q=inventory&source=gbs_word_cloud_r&cad=3) [Japanese Automobile Industry](https://books.google.com/books?id=rFDq1DYprzYC&q=Japanese+Automobile+Industry&source=gbs_word_cloud_r&cad=3) [kaizen](https://books.google.com/books?id=rFDq1DYprzYC&q=kaizen&source=gbs_word_cloud_r&cad=3) [lean manufacturing](https://books.google.com/books?id=rFDq1DYprzYC&q=lean+manufacturing&source=gbs_word_cloud_r&cad=3) [look](https://books.google.com/books?id=rFDq1DYprzYC&q=look&source=gbs_word_cloud_r&cad=3) [machine](https://books.google.com/books?id=rFDq1DYprzYC&q=machine&source=gbs_word_cloud_r&cad=3) [management by objectives](https://books.google.com/books?id=rFDq1DYprzYC&q=management+by+objectives&source=gbs_word_cloud_r&cad=3) [manufacturing](https://books.google.com/books?id=rFDq1DYprzYC&q=manufacturing&source=gbs_word_cloud_r&cad=3) [means](https://books.google.com/books?id=rFDq1DYprzYC&q=means&source=gbs_word_cloud_r&cad=3) [ment kata](https://books.google.com/books?id=rFDq1DYprzYC&q=ment+kata&source=gbs_word_cloud_r&cad=3) [mentee](https://books.google.com/books?id=rFDq1DYprzYC&q=mentee&source=gbs_word_cloud_r&cad=3) [mentor](https://books.google.com/books?id=rFDq1DYprzYC&q=mentor&source=gbs_word_cloud_r&cad=3) [mentor/mentee dialogue](https://books.google.com/books?id=rFDq1DYprzYC&q=mentor/mentee+dialogue&source=gbs_word_cloud_r&cad=3) [move](https://books.google.com/books?id=rFDq1DYprzYC&q=move&source=gbs_word_cloud_r&cad=3) [number of operators](https://books.google.com/books?id=rFDq1DYprzYC&q=number+of+operators&source=gbs_word_cloud_r&cad=3) [observe](https://books.google.com/books?id=rFDq1DYprzYC&q=observe&source=gbs_word_cloud_r&cad=3) [obstacles](https://books.google.com/books?id=rFDq1DYprzYC&q=obstacles&source=gbs_word_cloud_r&cad=3) [organization](https://books.google.com/books?id=rFDq1DYprzYC&q=organization&source=gbs_word_cloud_r&cad=3) [pacemaker](https://books.google.com/books?id=rFDq1DYprzYC&q=pacemaker&source=gbs_word_cloud_r&cad=3) [Pareto chart](https://books.google.com/books?id=rFDq1DYprzYC&q=Pareto+chart&source=gbs_word_cloud_r&cad=3) [Pc/t](https://books.google.com/books?id=rFDq1DYprzYC&q=Pc/t&source=gbs_word_cloud_r&cad=3) [PDCA cycles](https://books.google.com/books?id=rFDq1DYprzYC&q=PDCA+cycles&source=gbs_word_cloud_r&cad=3) [planned cycle](https://books.google.com/books?id=rFDq1DYprzYC&q=planned+cycle&source=gbs_word_cloud_r&cad=3) [process analysis](https://books.google.com/books?id=rFDq1DYprzYC&q=process+analysis&source=gbs_word_cloud_r&cad=3) [process improvement](https://books.google.com/books?id=rFDq1DYprzYC&q=process+improvement&source=gbs_word_cloud_r&cad=3) [process level](https://books.google.com/books?id=rFDq1DYprzYC&q=process+level&source=gbs_word_cloud_r&cad=3) [process target condition](https://books.google.com/books?id=rFDq1DYprzYC&q=process+target+condition&source=gbs_word_cloud_r&cad=3) [production process](https://books.google.com/books?id=rFDq1DYprzYC&q=production+process&source=gbs_word_cloud_r&cad=3) [pull system](https://books.google.com/books?id=rFDq1DYprzYC&q=pull+system&source=gbs_word_cloud_r&cad=3) [scientific thinking](https://books.google.com/books?id=rFDq1DYprzYC&q=scientific+thinking&source=gbs_word_cloud_r&cad=3) [scrap](https://books.google.com/books?id=rFDq1DYprzYC&q=scrap&source=gbs_word_cloud_r&cad=3) [sequence](https://books.google.com/books?id=rFDq1DYprzYC&q=sequence&source=gbs_word_cloud_r&cad=3) [shift](https://books.google.com/books?id=rFDq1DYprzYC&q=shift&source=gbs_word_cloud_r&cad=3) [situation](https://books.google.com/books?id=rFDq1DYprzYC&q=situation&source=gbs_word_cloud_r&cad=3) [skills](https://books.google.com/books?id=rFDq1DYprzYC&q=skills&source=gbs_word_cloud_r&cad=3) [solutions](https://books.google.com/books?id=rFDq1DYprzYC&q=solutions&source=gbs_word_cloud_r&cad=3) [standard](https://books.google.com/books?id=rFDq1DYprzYC&q=standard&source=gbs_word_cloud_r&cad=3) [Starter Kata](https://books.google.com/books?id=rFDq1DYprzYC&q=Starter+Kata&source=gbs_word_cloud_r&cad=3) [striving](https://books.google.com/books?id=rFDq1DYprzYC&q=striving&source=gbs_word_cloud_r&cad=3) [takt](https://books.google.com/books?id=rFDq1DYprzYC&q=takt&source=gbs_word_cloud_r&cad=3) [teaching](https://books.google.com/books?id=rFDq1DYprzYC&q=teaching&source=gbs_word_cloud_r&cad=3) [team leader](https://books.google.com/books?id=rFDq1DYprzYC&q=team+leader&source=gbs_word_cloud_r&cad=3) [team members](https://books.google.com/books?id=rFDq1DYprzYC&q=team+members&source=gbs_word_cloud_r&cad=3) [tion](https://books.google.com/books?id=rFDq1DYprzYC&q=tion&source=gbs_word_cloud_r&cad=3) [Toyota group](https://books.google.com/books?id=rFDq1DYprzYC&q=Toyota+group&source=gbs_word_cloud_r&cad=3) [Toyota Kata](https://books.google.com/books?id=rFDq1DYprzYC&q=Toyota+Kata&source=gbs_word_cloud_r&cad=3) [Toyota Motor Corporation](https://books.google.com/books?id=rFDq1DYprzYC&q=Toyota+Motor+Corporation&source=gbs_word_cloud_r&cad=3) [Toyota's improvement kata](https://books.google.com/books?id=rFDq1DYprzYC&q=Toyota%27s+improvement+kata&source=gbs_word_cloud_r&cad=3) [trying](https://books.google.com/books?id=rFDq1DYprzYC&q=trying&source=gbs_word_cloud_r&cad=3) [understand](https://books.google.com/books?id=rFDq1DYprzYC&q=understand&source=gbs_word_cloud_r&cad=3) [utilize](https://books.google.com/books?id=rFDq1DYprzYC&q=utilize&source=gbs_word_cloud_r&cad=3) [value stream](https://books.google.com/books?id=rFDq1DYprzYC&q=value+stream&source=gbs_word_cloud_r&cad=3) [vision](https://books.google.com/books?id=rFDq1DYprzYC&q=vision&source=gbs_word_cloud_r&cad=3)\n\n### About the author (2009)\n\n**Mike Rother** is an engineer, a teacher, and a guest researcher at the Technical University Dortmund. Rother’s work has bought him to numerous companies and hundreds of factories around the world, where he collaborates with people to test ideas and shares lessons learned. He splits his time between Ann Arbor, and Cologne, Germany. Rother has been entered into the Association of Manufacturing Excellence's Hall of Fame.\n\n### Bibliographic information\n\n| | |\n| --- | --- |\n| Title | Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results |\n| Author | [Mike Rother](https://www.google.com/search?tbo=p&tbm=bks&q=inauthor:%22Mike+Rother%22&source=gbs_metadata_r&cad=5) |\n| Edition | illustrated |\n| Publisher | McGraw Hill Professional, 2009 |\n| ISBN | 0071639853, 9780071639859 |\n| Length | 400 pages |\n| Subjects | [Business & Economics](https://www.google.com/search?tbo=p&tbm=bks&q=subject:%22Business+%26+Economics%22)  ›  [Training](https://www.google.com/search?tbo=p&tbm=bks&q=subject:%22Business+%26+Economics+Training%22) [Business & Economics / Management](https://www.google.com/search?tbo=p&tbm=bks&q=subject:%22Business+%26+Economics+/+Management%22&source=gbs_metadata_r&cad=5) [Business & Economics / Training](https://www.google.com/search?tbo=p&tbm=bks&q=subject:%22Business+%26+Economics+/+Training%22&source=gbs_metadata_r&cad=5) |\n| | |\n| Export Citation | [BiBTeX](https://books.google.com/books/download/Toyota_Kata_Managing_People_for_Improvem.bibtex?id=rFDq1DYprzYC&output=bibtex) [EndNote](https://books.google.com/books/download/Toyota_Kata_Managing_People_for_Improvem.enw?id=rFDq1DYprzYC&output=enw) [RefMan](https://books.google.com/books/download/Toyota_Kata_Managing_People_for_Improvem.ris?id=rFDq1DYprzYC&output=ris) |\n\n[About Google Books](https://books.google.com/intl/en/googlebooks/about.html) \\- [Privacy Policy](https://books.google.com/intl/en/googlebooks/privacy.html) \\- [Terms of Service](https://books.google.com/intl/en/googlebooks/tos.html) \\- [Information for Publishers](http://books.google.com/support/partner/?hl=en) \\- [Report an issue](http://books.google.com/support/answer/180577?hl=en&url=https://books.google.com/books/about/Toyota_Kata_Managing_People_for_Improvem.html?id=rFDq1DYprzYC&hl=en&v=rFDq1DYprzYC&is=atb) \\- [Help](http://books.google.com/support/topic/4359341?hl=en) \\- [Google Home](https://www.google.com/)"
      },
      {
        "title": "Kata Resources | Association for Manufacturing Excellence",
        "url": "https://www.ame.org/kata-resources",
        "snippet": "[Skip to main content](https://www.ame.org/kata-resources#main-content)\n\n# Kata Resources\n\nToyota Kata was developed by Mike Rother, a researcher, engineer, teacher, author and speaker on the subjects of management, leadership, improvement, adaptiveness and change in human organizations. In his 2009 book, “Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results,” Rother describes Toyota Kata as a means for developing, activating and mobilizing human potential in a way that makes scientific thinking a daily habit.\n\nIn “The Toyota Kata Practice Guide,” Rother describes scientific thinking as, “a continuous comparison between what we predict will happen next, seeing what actually happens and adjusting our understanding and actions based on what we learn from the difference.”\n\n![Toyota Kata Learning image](https://www.ame.org/files/learning_graphic_0.jpg)\n\nUsers can implement scientific thinking by practicing the Improvement Kata, which is one of the main elements within Toyota Kata. This Improvement Kata is a series of steps that provide a mindset for problem solving. These steps include:\n\n- **![Improvement Kata model](https://www.ame.org/files/improvement_kata_model.jpg)Understand the challenge.** This is typically a large, big-picture goal that may seem or feel out of reach. It also defines the purpose or reason behind improvement.\n- **Grasp the current condition.** This step invites users to ask, “Where are we now?” and includes the gathering of data and information that sets up the next step.\n- **Establish the next target condition.** Where do we want to go? What do we want to achieve? In this step, participants set tangible and measurable goals which include an achieve-by date, desired outcome and a general description of the process on how the target condition will be reached. Important to note, this step is part of the planning phase and is likely to change depending on the results of experimentation and achievement of milestones along the journey.\n- **Experiment toward the target condition.** This step is part of the execution stage and includes the actions needed to reach the target condition. The path towards the target condition is typically not a straight line and usually involves obstacles. This step usually involves a process of rapid learning and discovery of the steps that are working and those which are not. In this step, adjustments are made on the way to the target condition.\n\nThe steps outlined in the Improvement Kata are designed to help users, no matter which problem-solving or improvement method they are using.\n\nImplementing the Improvement Kata can be difficult because it often requires a new or different way of thinking and learners may revert to old patterns and habits. In addition, it can be difficult for learners to see where they are going wrong or making mistakes throughout the process. That’s where the other main element of Toyota Kata comes in.  Known as the Coaching Kata, this element of Kata focuses on the practice of teaching the Improvement Kata pattern.\n\nAn Improvement Kata coach helps provides guidance and support for learners and can help speed up the learning process. The coach helps the learner overcome setbacks, provides encouragement and has a vested interest in helping the learner succeed. Coaching however, also takes practice.\n\n[![Daily Kata coaching cycle](https://www.ame.org/files/the_daily_kata_coaching_cycle_0.jpeg)](http://www-personal.umich.edu/~mrother/KATA_Files/5Q_Card.pdf) Coaching cycles are a routine for helping the learner understand and acquire the scientific thinking pattern of the Improvement Kata. These cycles include a series of questions and opportunity for feedback. Coaching Kata is a dialogue between coach and learner and each cycle typically runs under 20 minutes and consists of five questions:\n\n\\- What is the target condition?\n\n\\- What is the actual condition now?\n\n\\- What obstacles do you think are preventing your from reaching the target condition? Which one are you addressing now?\n\n\\- What is your next step? (Next experiment) What do you expect?\n\n\\- How quickly can we go and see what we have learned from taking that step?\n\nThese questions, considered the coaching cycle, help reinforce the pattern of the Improvement Kata and helps reveal how the learner is thinking. Typically, this pattern of coaching includes asking a question, listening, comparing (the learner’s response to the desired pattern of thinking), and instructing.\n\nThe use of these Coaching Kata questions takes practice. With feedback from a second coach, these skills can be improved and become more effective.\n\nFor more detail on how to develop the scientific thinking skills of the Improvement Kata or the coaching skills of the Coaching Kata, consult Mike Rother’s “The Toyota Kata Practice Guide.” For more information about Toyota Kata visit [Mike Rother's Toyota Kata website](http://www-personal.umich.edu/~mrother/Homepage.html).\n\n_Images provided by Mike Rother_\n\n### **Mike Rother keynote at AME San Diego 2018:**\n\n[iframe](https://www.youtube.com/embed/bypjjo3Vuro)\n\n### **Mike Rother's Kata in the Classroom session from AME San Diego 2018:**\n\n[iframe](https://www.youtube.com/embed/829NkN_lQdc)\n\n### **Mike Rother's Introduction to Kata video:**\n\n[iframe](https://www.youtube.com/embed/1l68cFskC7Y)\n\n* * *\n\n## **Compact Kata Online Course - $70 for AME Members**\n\n![](https://www.ame.org/files/kataonlinelearningscreenshot.png)The Online Improvement Kata & Coaching Kata Basics Course is a self-paced, interactive online course in 11 modules. It's produced by the award-winning author, professor and lean specialist Dr. Jeffrey K. Liker. The course shows you the steps and practice routines of the Improvement Kata and Coaching Kata. Normally an $80 program, AME members can access the Kata course for a discounted $70. Click the link below to check it out or to get started!\n\n### [Take the Kata Course](http://www.kata.teachable.com/p/improvement-kata/?couponcode=AME_KATA&affcode=43912_lqtg6ukx%3Chttp://www.kata.teachable.com/p/improvement-kata/?affcode=43912_lqtg6ukx)\n\n* * *\n\n### **Kata Articles in Target magazine:**\n\n[![Harness the power of persistence - Target magazine](https://www.ame.org/files/harness_the_power_cover.png)](https://www.ame.org/files/harness_the_power_of_persistence_-_target_summer_2019.pdf)[![Rethinking how we train - Target magazine image](https://www.ame.org/files/rethinking_how_we_train_cover_image.png)](https://www.ame.org/files/rethinking_how_we_train_-_target_magazine_summer_2019.pdf)[![](https://www.ame.org/files/practice_the_improvement_kata_cover_image.jpg)](https://www.ame.org/files/practice_the_improvement_kata_-_target_spring_2019.pdf)[![](https://www.ame.org/files/how_toyota_kata_cover_image.jpg)](https://www.ame.org/files/how_toyota_kata_can_transform_lean_deployment_-_target_winter_2018.pdf)\n\n[![](https://www.ame.org/files/an_approach_to_becoming_agile_cover_image_0.jpg)](https://www.ame.org/files/an_approach_to_becoming_agile_-_target_summer_2018_0.pdf)[![](https://www.ame.org/files/building_ci_habits_through_practice_cover_image.jpg)](https://www.ame.org/files/building_ci_habits_through_practice_-_target_fall_2017.pdf)[![Kata for PDCA](https://www.ame.org/files/a_kata_for_pdca_cover_image.jpg)](https://www.ame.org/files/a_kata_for_pdca_-_target_summer_2014.pdf)[![Kata Starter Kit](https://www.ame.org/files/kata_starter_kit_supplement_cover_image.jpg)](https://www.ame.org/files/improvement_kata_starter_kit_supplement_-_target_summer_2014.pdf)\n\n[![](https://www.ame.org/files/shifting_focus_cover_image.jpg)](https://www.ame.org/files/shifting_focus_-_target_winter_2014.pdf)\n\n### **Additional Kata Articles/Resources:**\n\n- [My Kata anniversary (Healthcare Quality Improvement blog 7/21/19) by Joy Furnival](https://joyfurnival.wordpress.com/2019/07/21/my-kata-anniversary/)\n- [Toyota Kata Introduction to Kata video PowerPoint slides](https://www.tinyurl.com/TKintroSlides)\n- [A family's growth fueled by](https://www.ame.org/target/articles/2015/familys-growth-fueled-crisis-power-improvement-kata) [crisis](https://www.ame.org/target/articles/2015/familys-growth-fueled-crisis-power-improvement-kata) [: The power of the Improvement Kata (Target Online 8/24/15) by Tyson Ortiz](https://www.ame.org/target/articles/2015/familys-growth-fueled-crisis-power-improvement-kata)\n- [Why Toyota Kata May Be the Right Approach for You (Dan Markovitz (2/26/19)](https://www.markovitzconsulting.com/blog/why-toyota-kata-may-be-the-right-approach-for-you)\n- [Agile LEGO - Toyota Kata an alternative to Retrospectives by Hakan Forss (4/25/19)](https://hakanforss.wordpress.com/2012/04/25/agile-lego-toyota-kata-an-alternative-to-retrospectives/)\n- [Toyota Kata A3 Problem Solving by Mark Rosenthal (Quality Digest 2/24/14)](https://www.qualitydigest.com/inside/quality-insider-column/toyota-kata-a3-problem-solving.html)\n\n![](https://www.ame.org/files/logo.png)\n\n### Regions\n\n### Education\n\n### Events\n\n### Contact"
      },
      {
        "title": "The Improvement Kata Mindset",
        "url": "https://www.youtube.com/watch?v=Zhvd-oFqqhc",
        "snippet": "[iframe](https://accounts.google.com/ServiceLogin?service=youtube&uilel=3&passive=true&continue=https%3A%2F%2Fwww.youtube.com%2Fsignin%3Faction_handle_signin%3Dtrue%26app%3Ddesktop%26hl%3Den%26next%3D%252Fsignin_passive%26feature%3Dpassive&hl=en)\n\n[About](https://www.youtube.com/about/) [Press](https://www.youtube.com/about/press/) [Copyright](https://www.youtube.com/about/copyright/) [Contact us](https://www.youtube.com/t/contact_us/) [Creators](https://www.youtube.com/creators/) [Advertise](https://www.youtube.com/ads/) [Developers](https://developers.google.com/youtube) [Terms](https://www.youtube.com/t/terms) [Privacy](https://www.youtube.com/t/privacy) [Policy & Safety](https://www.youtube.com/about/policies/) [How YouTube works](https://www.youtube.com/howyoutubeworks?utm_campaign=ytgen&utm_source=ythp&utm_medium=LeftNav&utm_content=txt&u=https%3A%2F%2Fwww.youtube.com%2Fhowyoutubeworks%3Futm_source%3Dythp%26utm_medium%3DLeftNav%26utm_campaign%3Dytgen) [Test new features](https://www.youtube.com/new) [NFL Sunday Ticket](https://tv.youtube.com/learn/nflsundayticket)\n\n© 2024 Google LLC"
      },
      {
        "title": "How to Deploy the Improvement Kata v7.0",
        "url": "https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624",
        "snippet": "How to Deploy the Improvement Kata v7.0 | PDF\nDownload free for 30 daysSign in\n[Upload](https://www.slideshare.net/upload)[Language(EN)](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#)[Support](https://support.scribd.com/hc/en-us/articles/210135446-Our-support-team)\n[Business](https://www.slideshare.net/category/business)[Mobile](https://www.slideshare.net/category/mobile)[Social Media](https://www.slideshare.net/category/Social-Media)[Marketing](https://www.slideshare.net/category/Marketing)[Technology](https://www.slideshare.net/category/technology)[Art &amp; Photos](https://www.slideshare.net/category/art-photos)[Career](https://www.slideshare.net/category/career)[Design](https://www.slideshare.net/category/design)[Education](https://www.slideshare.net/category/education)[Presentations &amp; Public Speaking](https://www.slideshare.net/category/presentations-public-speaking)[Government &amp; Nonprofit](https://www.slideshare.net/category/government-nonprofit)[Healthcare](https://www.slideshare.net/category/healthcare)[Internet](https://www.slideshare.net/category/internet)[Law](https://www.slideshare.net/category/law)[Leadership &amp; Management](https://www.slideshare.net/category/leadership-management)[Automotive](https://www.slideshare.net/category/automotive)[Engineering](https://www.slideshare.net/category/engineering)[Software](https://www.slideshare.net/category/software)[Recruiting &amp; HR](https://www.slideshare.net/category/recruiting-hr)[Retail](https://www.slideshare.net/category/retail)[Sales](https://www.slideshare.net/category/sales)[Services](https://www.slideshare.net/category/services)[Science](https://www.slideshare.net/category/science)[Small Business &amp; Entrepreneurship](https://www.slideshare.net/category/small-business-entrepreneurship)[Food](https://www.slideshare.net/category/food)[Environment](https://www.slideshare.net/category/environment)[Economy &amp; Finance](https://www.slideshare.net/category/economy-finance)[Data &amp; Analytics](https://www.slideshare.net/category/data-analytics)[Investor Relations](https://www.slideshare.net/category/investor-relations)[Sports](https://www.slideshare.net/category/sports)[Spiritual](https://www.slideshare.net/category/spiritual)[News &amp; Politics](https://www.slideshare.net/category/news-politics)[Travel](https://www.slideshare.net/category/travel)[Self Improvement](https://www.slideshare.net/category/self-improvement)[Real Estate](https://www.slideshare.net/category/real-estate)[Entertainment &amp; Humor](https://www.slideshare.net/category/entertainment-humor)[Health &amp; Medicine](https://www.slideshare.net/category/health-medicine)[Devices &amp; Hardware](https://www.slideshare.net/category/devices-hardware)[Lifestyle](https://www.slideshare.net/category/lifestyle)\n## Change Language\nLanguageEnglishEspañolPortuguêsFrançaisDeutsche\nCancelSave\n[\n](https://www.slideshare.net/)\nSubmit search\nEN\n[\n![Mike Rother, profile picture](https://cdn.slidesharecdn.com/profile-photo-mike734-48x48.jpg?cb=1723757835)\n](https://www.slideshare.net/mike734)\nUploadedby[Mike Rother](https://www.slideshare.net/mike734)\nPDF, PPTX42,621views\n# How to Deploy the Improvement Kata v7.0\nAI-enhanced description\nThe document provides a detailed guide on deploying the Improvement Kata and Coaching Kata within organizations, highlighting the importance of systematic and scientific working patterns to achieve challenging goals. It emphasizes the need for daily practice, active coaching, and a well-structured deployment process involving an &#x27;advance group&#x27; to oversee the transition. Key lessons include integrating new practices into daily management and ensuring that all levels of leadership are proficient before coaching others.\n[Business](https://www.slideshare.net/category/business)◦[Education](https://www.slideshare.net/category/education)◦\nRelated topics:\n[Continuous Improvement](https://www.slideshare.net/tag/continuous-improvement)•\nRead more\n76Save\nShare\nEmbed\n## Embed presentation\nDownload\nDownload as PDF, PPTX\n[1/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#1)\n[2/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#2)\n[3/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#3)\n[4/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#4)\n[5/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#5)\n[6/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#6)\n[7/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#7)\n[8/ 55\nMost read\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#8)\n[9/ 55\nMost read\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#9)\n[10/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#10)\n[11/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#11)\n[12/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#12)\n[13/ 55\nMost read\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#13)\n[14/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#14)\n[15/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#15)\n[16/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#16)\n[17/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#17)\n[18/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#18)\n[19/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#19)\n[20/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#20)\n[21/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#21)\n[22/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#22)\n[23/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#23)\n[24/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#24)\n[25/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#25)\n[26/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#26)\n[27/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#27)\n[28/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#28)\n[29/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#29)\n[30/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#30)\n[31/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#31)\n[32/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#32)\n[33/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#33)\n[34/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#34)\n[35/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#35)\n[36/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#36)\n[37/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#37)\n[38/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#38)\n[39/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#39)\n[40/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#40)\n[41/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#41)\n[42/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#42)\n[43/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#43)\n[44/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#44)\n[45/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#45)\n[46/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#46)\n[47/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#47)\n[48/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#48)\n[49/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#49)\n[50/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#50)\n[51/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#51)\n[52/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#52)\n[53/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#53)\n[54/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#54)\n[55/ 55\n](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#55)\n![How to Deploy the Improvement Kata© Mike Rother 1\nHow to Deploy the\nImprovement Kata\nBased on our experiences so far\nMike\nRother\nBill\nCostantino\nBeth\nCarrington\nGerd\nAulinger\nv 7.0\nCopyright ©2015 by Mike Rother, all rights reserved\n1217 Baldwin Avenue / Ann Arbor, MI 48104 USA / tel: (734) 665-5411 / mrother@umich.edu\nFor reference\nsee:\nChapter\n9\nPublished\nApril 2011\n&amp; periodically\nupdated\nIncludes\nHow to\nRun Your\nADVANCE\nGROUP\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-1-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 2\nThe Improvement Kata and Coaching Kata are about teaching a\nsystematic and scientific way of working throughout an\norganization, to get better at reaching difficult goals.\nFor most organizations this will be a change process that involves\nhaving people develop new skills and mindset through deliberate,\ncoached practice. Managers guide the development of their\npeopleʼs skills by coaching them in daily practice on real goals. Of\ncourse, those managers will have to be among the first to practice\nand learn the new skills themselves, before they can coach others.\nIntentionally changing an organizationʼs culture is a significant\nundertaking. In this case there are scientific skills (the Improvement\nKata pattern) and teaching/coaching skills (the Coaching Kata). This\nSlideShare describes a well-tested approach for deploying IK/CK skill\ndevelopment in an organization. It is intended to be an input to your\nown deployment process and discoveries.\nINTRODUCTION\nMike Rother\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-2-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 3\nWHAT ITʼS ALL ABOUT:\n-- Learning Scientific Skills --\nThe Improvement Kata &amp; Coaching Kata\ncombine a scientific working pattern\nwith techniques of deliberate practice,\nto make scientific thinking a teachable\nmeta-skill that anyone can learn.\nThese foundational thinking habits are the basis for:\n•Learning how to successfully\npursue seemingly unattainable\ngoals in complex systems.\n•Enabling teams who are nearer to\na situation to make their own\ndecisions &amp; maneuver effectively.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-3-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 4\nMike\nGerd\nBill\nBeth\nWEʼVE LEARNED A LOT ABOUT DEPLOYING\nIMPROVEMENT-KATA SKILL DEVELOPMENT\nPracticing the Improvement Kata helps anyone get better at\nnavigating unknown territory and meeting challenges. To\nmake the pattern of the Improvement Kata a habit it should\nbe practiced and coached every day.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-4-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 5\nDEPLOYING THE IMPROVEMENT KATA\nINVOLVES SKILL-BUILDING PRACTICE\nThis document describes how to set up a coaching process in your\norganization, to train people in applying the Improvement Kata pattern\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-5-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 6\nFOUR INGREDIENTS\nFOR LEARNING A NEW HABIT AND SKILL\nPRACTICE\nDaily repetition\nCOACHING\nCorrective\nfeedback\nKATA\nStructured routine to\npractice (beginner)\nMASTERY\nOvercoming\nobstacles\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-6-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 7\nCOACHING IS A KEY INGREDIENT\nWithout coaching we lose our way and donʼt practice\nthe right pattern, or practice ineffectively.\nIf the Learner isnʼt learning the Improvement\nKata pattern or if the target condition is not\nbeing reached, examine the coaching.\nCOACHING\nCorrective\nfeedback\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-7-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 8\nTHE DEPLOYMENT GOAL IS TO MAKE PRACTICING\nAND COACHING THE IMPROVEMENT KATA PATTERN\nPART OF EVERY DAYʼS WORK\nPracticing the Improvement Kata should get integrated\ninto daily management, not just be an add-on project or workshop\nA slice of each day is focused on striving\ntoward a challenging target condition via\nthe Improvement Kata pattern.\nThis is guided via the Five Coaching Kata\nQuestions (Coach/Manager) and the\nPDCA Cycles Record (Learner) in daily\nCoaching Cycles.\nTroubleshooting\nStriving with the\nImprovement Kata\nThe Workday\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-8-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 9\nPRACTICE THE IMPROVEMENT KATA BY APPLYING\nIT TO A REAL PROCESS &amp; TARGET CONDITION\nLearners do 2 things simultaneously:\nStrive to reach a real target condition + practice the\npattern of the Improvement Kata\nTraining Doing\nDoing &amp;\nTraining\nNot this\nBut this\n(combined)\nHere the Coach can see in\nreal time where the Learner\nis, and introduce appropriate\nadjustments right away\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-9-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 10\nThe Four Steps of the IMPROVEMENT KATA\nIterate Toward\nthe Target\nCondition\nC C\nT C\nEstablish the\nNext Target\nCondition\nTarget\nCondition\nGrasp the\nCurrent\nCondition\nUnderstand\nthe\nDirection\nThe COACHING KATA\nʻExecutingʼ\nCoaching\nCycles\nCoach Learner\nʻPlanningʼ Coaching Cycles\nTHERE ARE PRACTICE ROUTINES FOR EACH STEP OF\nTHE IMPROVEMENT KATA + THE COACHING KATA\nLEARNER\nCOACH\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-10-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 11\nTHE IMPROVEMENT KATA &amp; COACHING KATA\nPRACTICE GUIDE HAS THE PRACTICE ROUTINES\nThis free online guidebook gives you step-by-step instructions\nA practice routine for\nGrasping the\nCurrent Condition\nA practice routine for\nEstablishing a\nTarget Condition\nA practice routine for\nIterating to the\nTarget Condition\nA practice routine for\nCoaching the IK\nA practice routine for\nSetting the Challenge\nAvailable on the\nToyota Kata Website\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-11-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 12\nLESSONS LEARNED\nABOUT DEPLOYING\nTHE IMPROVEMENT KATA\nThis is not something for every organization. Itʼs about a\ndifferent way of managing, not just adding techniques on top\nof how you currently manage. Itʼs a process of developing\nnew skill and mindset throughout an organization, not just a\nproblem-solving approach to implement.\nTo bring the pattern of the Improvement Kata into the\noperation of your organization and make it a habit, mid-level\nmanagement will have to actively coach it every day.\nYou may think deploying simply means getting people in the\norganization to start practicing the Improvement Kata, but in\nour experience an effort to deploy the Improvement Kata\nneeds to be monitored and guided. To do that be sure to\nEstablish an ʻAdvance Groupʼ as described in this document.\nR\nR\nR\nLessons\nLearned\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-12-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 13\nA gating factor is how much Coaching-Kata capability you\nare developing in your organization. You cannot expand\nwider and faster than your coaching capacity.\nTo be able to coach the Improvement Kata, a person has to\nknow how to do the Improvement Kata. Demonstrated\nproficiency with the Improvement Kata is ideally required\nbefore starting to coach.\nIt&#x27;s not sufficient for the organization&#x27;s leaders to simply\nsay they support the working pattern of the Improvement\nKata. If they donʼt practice it themselves in some way,\nthey will not understand it.\nR\nR\nR\nLessons\nLearned\ncontinued\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-13-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 14\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-14-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 15\nIMPROVEMENT KATA SKILL\nCOMES BEFORE COACHING SKILL\nTo coach the Improvement Kata you need\nexperience in applying the Improvement Kata\nSome proficiency\nwith the Improvement\nKata is required\nbefore you can coach\nPRACTICE\nImprovement\nKata\nPRACTICE\nCoaching\nKata\nAWARE\nof it\nAble to\nDO it\nAble to\nCOACH it\nKnow what\nKnow about the\nImprovement Kata\nKnow why\nCan teach others\nKnow how\nCan effectively apply\nthe Improvement Kata\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-15-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 16\nTHREE KINDS OF PRACTICING\n(1)\nAWARENESS\nʻPRACTICEʼ\nThis is the first real practice. Focused practice\nsessions with the Improvement Kata pattern,\nconducted on real processes in your\norganization, with real target conditions.\n(2)\nSKILL-BUILDING\nPRACTICE\n(3)\nDAILY\nPRACTICE\nInitial study of the topic\n- Read Toyota Kata &amp; The Talent Code.\n- Participate in a Toyota Kata course or workshop.\n- Get initial experience with the Improvement Kata\nand Coaching Kata routines.\nDaily practice and daily Coaching Cycles, now\nbuilt into your normal management routine\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-16-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 17\nPHASE I:\nIf your organization is interested in the IK / CK, start by forming a small group of &#x27;scouts&#x27;\nto study the subject. The scouts should take an Improvement Kata course, such as as\nthe ones offered by the University of Michigan and the Lean Enterprise Institute.\nPHASE II:\nNow the team of scouts better understands the scope of the task and how much itʼs\nabout culture change through deliberate practice. If the organization is still interested\nat this point then the next step is to form an Advance Group of about 5 people who will\noversee the deployment. This group should include at least one senior manager.\nAt this point an external coach can start working with the organization by coaching the\nAdvance Group. The external coach does not have responsibility for bringing the\nImprovement Kata into the organization. Thatʼs the responsibility of the Advance Group,\nwhich canʼt be delegated. Note that the Advance Group is not the start of a cascade,\nbut rather a group that will conduct PDCA of skill development at the organization level.\nAt this point the Advance Group practices applying the Improvement Kata to selected\nwork processes, under guidance of the external coach, in order to learn the\nImprovement Kata. This takes about 2 months.\nPHASE III:\nNow you can expand into the normal daily activity of middle managers by focusing on\napplying the Improvement Kata and Coaching Kata at work processes and their\nassociated chain of persons. You add processes as coaching capacity permits.\nThe Advance Group now monitors and shepherds the skill-development process.\nA THREE-PHASE DEPLOYMENT APPROACH\nOne way to bring the Improvement Kata into an organization\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-17-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 18\nTHE THREE-PHASE DEPLOYMENT APPROACH\nSupervisorsAdvance\nGroup\nPractices\nthe IK\nSenior\nManagers\nArea\nManagers\nSkill-Dev\nPlan\nPrepare\nForm an\nAdvance\nGroup\nScouts\nstudy the\nsubject\nBuilding\nPractice\nSkill\nPractice\nAwareness\nHave a few ʻScoutsʼ\nfamiliarize themselves\nwith the subject; by\nreading ʻToyota Kataʼ\n&amp; ʻThe Talent Codeʼ,\nand taking a Toyota\nKata course.\nPHASE I PHASE II\nPHASE III - Expansion into\nnormal business process of\nline managers, slice by slice\nPractice\nBuilding\nPractice\nSkill\nPractice\nAwareness\nCoaching\nCycles\nDaily\nExternal coach\nneeded here!\nThe basic deployment process is to\npractice the Improvement Kata pattern\nat one management level and pass it\ndown another level through one-on-\none coaching; so the behavior pattern\npermeates the organization.\nThe Advance Group observes and\nPDCAs the skill-development process\nPractice\nAwareness\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-18-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 19\nPHASE III: EXPANDING SLICE BY SLICE\n•A slice = a process and itʼs associated chain of persons.\n•Add slices only as your coaching capacity permits.\n•Once you start applying the Improvement Kata to a process\nyou should never stop. So itʼs better to start too small than\nto involve too many people too quickly.\nCoach &lt;---&gt; Learner\nrelationships\nAdvance\nGroup\nSite\nManager\nArea Mgr. or\nSupervisor\nPROCESSES\nProcess A\nProcess B\nSupervisor or\nTeam Leader\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-19-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 20\nWHAT YOUʼRE WORKING TOWARD\nThis is a depiction of what youʼre working toward:\nCoach-Learner relationships up-and-down a value stream.\nOf course, it takes time to build this kind of capability &amp; structure.\nResponsible for\na Value Stream\nResponsible for a\nValue Stream Loop\nResponsible\nfor a Process\nEach\nLearner\nhas a\nstoryboard\nVideo\nnext page\n3 minutes\non the\nwith\nJeff\nLiker\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-20-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 21\nWHAT IT LOOKS LIKE / HOW IT WORKS\nBased on an illustration by Emiel van Est\nUnderstand the\nDirection or\nChallenge\n(from level above)\nGrasp the\nCurrent\nCondition\nEstablish the\nNext Target\nCondition\nExperiment\nToward the\nTarget Condition\nPLANNING EXECUTING\nValue Stream\nLevel\nOrganization\nLevel\nProcess\nLevel\nLonger-Cycle\nExperiments\nShort-Cycle\nExperiments\nThe higher your level in the value stream, the bigger the goal you are\nresponsible for. A Target Condition at one level is the Challenge for\nthe next level down, and one level coaches the next level down.  Future State\nValue Stream\nMapping\nCurrent State\nValue Stream\nMapping\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-21-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 22\nSO WHO PRACTICES FIRST?\nAdvance\nGroup\nSite\nManager\nArea Mgr. or\nSupervisor\nPROCESSES\nProcess A\nProcess B\nSupervisor or\nTeam Leader\nPracticing is generally done top-down in a value stream. In\nPhase II the Advance Group and some designated coaches are\nthe first Learners (~9 persons).\nThen in Phase III you begin with managers, not supervisors,\npracticing on the actual processes they manage.\nWhy top down? Middle managers are key players in teaching\nand reinforcing habits of thinking and acting in an organization.\nIf you start IK projects with process supervisors but they are\nsurrounded by a different way of thinking among their\nmanagers then the projects are unlikely to sustain.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-22-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 23\nOrganization\nhas ʻscoutsʼ\nstudy the\nIK/CK topic\nForm\nAG\nAdvanceGroupmakes6or12-monthplan\nAdvance Group conducts bi-weekly reflections\nSlice 1\nSlice 2\nSlice 3\nSlice 4\nAG and first coaches\npractice the IK\nAdvanceGroupreflectionandnextplan\nIncreasing number of managers\nin the organization who are\nproficient coaches\nAdvance Group\nTraining:\nAG works on a series\nof 3 Target Conditions\n(does ~ 25 PDCA cycles)\non real processes\nTHE DEPLOYMENT TIMELINE (not to scale)\nPHASE I PHASE II PHASE III\nEXTERNAL COACH ROLE\nInitial instructor &amp; coach\nOn site frequently\n(eg. every 2 weeks)\nEXTERNAL COACH ROLE\nAs 2nd Coach\nOn site every\n2 - 4 weeks\nEXTERNAL COACH ROLE\nAs needed\nYou canʼt expand faster than you can develop Coaching proficiency. It is often\na slow-spreading process at first, that accelerates as you develop more\ncapability to improve and coach, as shown by the curve in the drawing. It can\neasily take most of a year to do good work in one value stream. You should\nbe achieving your Target Conditions all along, but don&#x27;t wonder if you are not\ngetting results that affect the bottom line of the entire organization right away.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-23-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 24\nLean tools, techniques and principles to improve quality,\ncost and delivery are as useful and important as ever, but\nthey should be applied within the context of the\nImprovement Kata. What are you trying to achieve?\nLean tools are brought in (pulled) situationally as needed.\nThe mindset youʼre trying to develop is one of working\niteratively to discover and do what is necessary to\nachieve a goal, as opposed to a mindset of pushing and\nimplementing pre-defined solutions or tools.\nFor example, if a kanban system will help a team achieve\nits target condition, then at that point kanban is brought\nin and utilized. Teams stay focused on their next target\ncondition.\nThis approach makes our efforts more meaningful and\nsuccessful. It teaches us more scientific &amp; effective\nhabits of thinking and acting.\nWHAT ABOUT THE\nLEAN TOOLS AND PRACTICES?\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-24-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 25\nAdvance Group (The Shepherds)\nResponsible for overall deployment of the\nImprovement Kata in the organization. The\nAdvance Group plans &amp; monitors the\ndeployment process, and introduces course\ncorrections (PDCAs the skill-building process).\n2nd Coach (Coach the Managers)\nResponsible for the coaching process.\nPeriodically observes coaching cycles\nbetween middle managers and Learners.\nEnsures connection between an overall\nchallenge and process-level improvement.\nMiddle Managers (The Coaches/Teachers)\nResponsible for teaching the Improvement\nKata and for the team’s results. Conducts\ncoaching cycles daily using the 5 questions.\nEnsures the Learner is working and\npracticing scientifically and experimentally\naccording to the Improvement Kata. The\ncoach’s job is to develop the Learner, not to\nimprove the process.\nLearner and Team (The Process Owners)\nResponsible for required performance in the\nrequired time and quality, and for improving\nthe process with the Improvement Kata. The\nLearner conducts experiments with PDCA and\ndevelops solutions, in dialogue with process\noperators and 1st Coach.\nTHE ROLES IN DEPLOYMENT\nImprovement\nKata\nCoaching\nKata 2nd\nCoach\nCoach\n(Manager)\nLearner\n&amp; Team\nAdvance\nGroup\nu\nv\nwx\nExternal\nCoach\ny\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-25-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 26\nAN EXTERNAL COACH\nThe role of an external coach is to help selected persons\nin your organization develop Coaching Kata proficiency as\nquickly and effectively as possible, so you can then teach\nand spread the Improvement Kata within your organization\nwith less and less reliance on outside expertise. \nAn external coach is used more at the beginning than later.\nItʼs important that IK training and coaching be done by\npersons inside your organization as soon as possible. The\nrole of the external coach is not to do all your training for\nyou, because that prevents your organization from\ndeveloping the necessary skills.\ny\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-26-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 27\nTHE “ADVANCE GROUP”\nA small group that plans, monitors and course-corrects\nthe deployment of Improvement Kata skill development\nin the organization\nx\nItʼs called the\n“Advance Group”\nbecause they go first\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-27-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 28\nEVERY IK DEPLOYMENT IS UNIQUE\nYou should apply the IK pattern to your IK deployment\nSince no two deployments of the Improvement Kata and Coaching Kata\nare alike, there is a need to go beyond just planning to continually\nexperimenting, observing and adjusting at the organizational (deployment)\nlevel. You can ask the Five Coaching Kata Questions at this level too.\nThis is a role for an “Advance Group.”\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-28-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 29\nSTART DEPLOYMENT WITH THE ADVANCE GROUP\nAKA “The Shepherds”\n•The Advance Group is not responsible for conducting all\ncoaching and training, nor for making improvement happen at\nall processes. That will be the responsibility of middle managers\nand leaders who coach in their areas.\n•Because internal coaches are needed, this is also a good\ntime to simultaneously train a few high-potential coaches who\ncan later coach in various areas of the organization as needed.\n•The Advance Group plus initial coaches should total no more\nthan 9 persons. A larger group becomes too difficult to\nmanage when everyoneʼs skill levels is ʻbeginnerʼ.\n•The Advance Group should include a senior executive (the\nsenior executive in small and mid-sized companies or sites).\n•The Advance Group is not a Lean staff group, although a Lean\nstaff member can be on the Advance Group. If you have a\nlean staff, their role may migrate toward being “master coaches”\nfor middle managers, who will be the heart of the IK effort.\n•The Advance Group will initially need training and guidance from\nan external coach, which can be an outside consultant.\nAdvance Group refers to a team of 3-5 people who orchestrate\nthe deployment of Improvement Kata thinking and skill in the\norganization or site. There can be one Advance Group for the\noverall organization and an Advance Group at each site.\nSuggestions for forming your Advance Group:\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-29-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 30\nWITHOUT AN ADVANCE GROUP TO SHEPHERD IT,\nCHANGE IS UNLIKELY TO SUCCEED\nPlanning a perfect deployment of new skills is impossible,\nso it will be important to sense obstacles, problems and\nweaknesses as they arise, learn from them and adapt the\ndeployment plan accordingly. This is normal and itʼs the\nresponsibility of the Advance Group.\nCurrent\nCondition\nObstacles\nProblems\nOld Habits\nAG\nTarget\nCondition\n(x) persons at (x) Dreyfus\nlevel of Improvement Kata\nskill, and (x) processes\nunder Improvement Kata\nmanagement, by (x) date.\nYouʼre working on a change in how your organization manages\npeople, so there&#x27;s a need for high-level PDCA.  The Advance\nGroup does this high-level reflecting and adjusting.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-30-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 31\nPhase II: ADVANCE GROUP PRACTICING\nTo be able to fulfill their shepherding role, the Advance Group members first\ndevelop some Improvement Kata skill by practicing on real work processes\n•The Advance Groupʼs practicing typically takes two months.\n•If the site does not already have a future-state value stream map\nto provide challenge, then the Advance Group may begin with\nVS Mapping, which adds additional time but is good experience.\n•To gain experience in all four steps of the IK, the Advance\nGroup members work toward three successive target conditions.\n•A key skill is “PDCA rigor,” and an Advance Group member should\npersonally experience at least 25 PDCA cycles.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-31-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 32\nSUGGESTIONS FOR\nADVANCE GROUP PRACTICING\nSelect focus processes that are well-suited for beginners to\npractice on. Typically these are compact processes that\nhave repetitive cycles. With beginners the primary goal is to\ninternalize the Improvement Kata pattern, not to address the\nmost complicated processes and problems.\nThe development of internal Kata coaches is a prerequisite\nfor teaching people how to work with the Improvement Kata\nevery day. However, at the start there are no experienced\ncoaches.\nTo bridge this gap you can do Phase II Advance Group\npracticing in a rotation model, whereby each person in turn\ntakes the role of Learner, Coach and 2nd Coach. This is a\ntemporary, artificial structure for Advance Group practicing\nand to quickly develop some internal coaching capacity.\nRemember, you can select a few extra persons to practice\ntogether with the Advance group, so youʼll have a few more\ncoaches for the initial deployment. (Eventually middle\nmanagers will be the coaches.)\nR\nR\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-32-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 33\nGroup 1\nGroup 2\nGroup 3\nLearnerCoach2nd\nCoach\nProcess 2\nProcess and\nSupervisor\nProcess 1\nProcess 3\nEXAMPLE\n•Select 3 processes with 3 persons practicing per process. This is the\nAdvance Group members + the additional coaches in training, for a\ntotal of 9 persons.\n•Since these are artificially-selected processes, the Learner pairs with\nthe process Supervisor to apply the Improvement Kata to the process.\n•The members in each group periodically rotate roles within their group.\nYOU CAN USE A ROTATION MODEL FOR GETTING THE\nADVANCE GROUP &amp; FIRST COACHES UP TO SPEED\nFor example for 9 Persons\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-33-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 34\nADVANCE GROUP PRACTICE-PLANNING FORM\nFill in persons and processes for Advance Group IK practicing\nProcess\nSupervisor(s)\n(pairs with Learner)\nAdvance Group\nMembers and\nCoaches in Training\nPRACTICE\nPROCESSES\nPractice\nDates\nStart:\nEnd:\nRotation\nFrequency\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-34-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 35\nPhase III:\nONCE THE ADVANCE GROUP HAS PRACTICED THE IK\nThe Advance Groupʼs focus now shifts to the following tasks:\nExpand IK practice into the organization “slice” by “slice”\nPrepare a 6 or 12-month skill-development plan.\nHelp start the process by coaching as necessary. At the\nearly stages when there are too few coaches, Advance Group\nmembers may also coach managers or be 2nd coaches.\nObserve coaching cycles. Check and adjust the deployment\nvia PDCA. This is the most important Advance Group task.\nConduct regular reflections of actual current conditions\nagainst the skill-development plan.\nEnsure that teams applying the IK are working toward an\nappropriate challenge. Ensure IK activities are connected\nto meaningful goals.\nq\nq\nq\nq\nq\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-35-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 36\nTHE ADVANCE GROUP PREPARES A\n6 or 12 MONTH SKILL-DEVELOPMENT PLAN\nThe basic question... what persons do you want to bring to what\nskill level with the Improvement Kata by 6 or 12 months from now?\nI. Vision (your ultimate goal related to IK skill)\nII. Challenge (related to IK skill, 6 to 12 months out)\nIII. Current Condition\nIV. Next Target Condition (1-3 months out)\nV. What We Will Measure\nUse the following headings in the plan\nObstacles &amp; necessary course corrections (PDCA)\nwill arise in the Advance Groupʼs bi-weekly reflections\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-36-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 37\nTHE ADVANCE GROUP THEN REFLECTS REGULARLY\nThe Advance Group reflects against the skill development plan\n(for example bi-weekly) and introduces adjustments as necessary\nBy conducting regular checks the Advance Group learns what it\nneeds to work on to achieve its target condition of skill development\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-37-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 38\nTHEORETICAL DEPLOYMENT\nCurrent\nManagement\nApproach\nImprovement\nKata Approach\nTime\nManagerʼs\nWorkday\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-38-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 39\nManagerʼs\nWorkday\nTHE REALITY\nHereʼs why you need an Advance Group!\nThe Advance Group conducts PDCA at the deployment level.\nImprovement\nKata Approach\nTime\nCurrent\nManagement\nApproach\nUnforeseen deployment\nobstacles, problems, etc.\nWithout an\nAdvance Group,\nthe deployment\ndies here\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-39-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 40\nWhen you execute a plan and work\ntoward a target condition youʼll need to\nmake adjustments based on what you\nlearn from the unforeseen obstacles and\nproblems you discover along the way.\nThe advance group does this by\nscheduling regular reflection times.\nBi-weekly, for example.\nCONDUCT REGULAR ADVANCE GROUP REFLECTIONS\nThis is where a lot of the success or failure in developing\nImprovement Kata skills and management will be determined\nAn Advance Group reflection\nis built around the same\n5 Coaching Kata Questions\nthat the Coaches use\nThe Five Question Card is a free download\non the Toyota Kata Website\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-40-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 41\nu\nv\nw\nProgress toward the system-level challenge\nAre individual process-level target conditions\nrelated to a higher-level challenge (lead time,\nproductivity, etc.), and is progress being made?\nProgress toward process target conditions\nRelevant metric(s) can be taken right from each\nwork processʼs target condition.\nLearnerʼs skill development\nHow well are the coaches doing in developing\nImprovement Kata skill in their learners? Use\nthe Dreyfus Levels to assess skill level.\nFrequency and duration of coaching cycles\nFor each coach, track the start and stop times of\ntheir coaching cycles. (Longer is not better.)\nLength of Learnersʼ PDCA cycles\nPDCA cycles should ideally be short &amp; frequent\nFIVE THINGS FOR THE\nADVANCE GROUP TO MEASURE\nx\ny\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-41-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 42\nLearnerʼs\nStoryboard\nProcess\nLearner\nCoaching is\nthe key variable\nIf the Learner is not\nlearning or the\ntarget condition is\nnot being reached,\nthe problem lies\nin the coaching\nCoach\nPAY PARTICULAR ATTENTION TO COACHING\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-42-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 43\nTo all Advance Groups...\nWATCH THE\nROLLOUT SPEED\nResist the temptation to roll out the Improvement Kata\nas broadly and quickly as possible. Thatʼs a sure bet\nfor failure because it will...\n-&gt; Multiply mistakes due to shortcutting the\nnecessary PDCAs.\n-&gt; Outrun your organizationʼs coaching capacity.\nThe Advance Group should practice and learn first.\nThen move ahead slowly at first, experimenting and\nadjusting. Gain speed as coaching capacity increases.\nAfter the first year itʼs better to say, “We could have\ngone faster,” than to say, “We went too fast.”\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-43-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 44\nMiddle managers, not Lean staff persons, should be\nthe main teachers of the Improvement Kata pattern\nin the organization. They are the primary coaches.\nMANAGERS\nManagers are the Improvement Kata teachers / coaches\nv\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-44-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 45\nTHE IK + CK = A WAY OF MANAGING!\nManagers teach the Improvement Kata pattern to their people\nevery day while those people work on real goals\nAlthough the Improvement Kata describes a routine\nfor continuous improvement, keep in mind that this\nkata is a way of managing people every day.\nBecause they are automatically teachers every day,\nmiddle managers may have more influence on an\norganizationʼs capability than any other group.\nThe Improvement Kata is a way of managing that\ngenerates skills and initiative to improve, adapt and\nkeep the organization moving forward.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-45-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 46\n2nd Coach\nParticipates\nperiodically\nPays particular\nattention to the Coach\n(coaches the Coach)\nLearnerʼs\nStoryboard\nProcess\nLearnerCoach\n(Manager)\nThe Coach is responsible for\nteaching the Improvement\nKata pattern, and for the results\nThe Coach uses the Coaching\nKata, asking the 5 CK questions\nLine\nManager\nThe team owns\nthe target condition\nand works to achieve it\nThe Learner &amp; team apply\nthe Improvement Kata\nTeam\nuv\nw\nTHE THREE CORE ROLES\nFOR DAILY PRACTICING\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-46-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 47\nCOACHING CYCLES ARE THE MANAGERʼS DAILY\nIMPROVEMENT-KATA TEACHING MECHANISM\nOnce they have practiced and learned the Improvement Kata,\nmanagers use daily Coaching Cycles as a teaching technique\nThe Coach uses the\nFive CK Questions\nThe Learner uses the\nPDCA Cycles Record\nCoaching cycles are a way to guide Learners\nin their Improvement Kata practice\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-47-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 48\nAdditional coaching cycles\nif necessary\nOne Day\nScheduled\nCoaching\nCycle\nFor detailed instructions on how to conduct Coaching Cycles\nsee the online Improvement Kata &amp; Coaching Kata Practice Guide\nOne coaching cycle involves a Coach asking the Learner the\nFive CK Questions, while at the process. We usually strive for\nthis to be done at least once every shift, taking 10-15 minutes.\n(Note: it takes some practice to get to 10-15 minute coaching\ncycles that are not just a formality.)\nCoaching cycles are conducted at regularly-scheduled times\n+ spontaneously when the need arises.\nAs necessary, after a coaching cycle the Coach may opt to\naccompany the Learner - which would be coaching - or simply\nto return for the next coaching cycle.\nCOACHING CYCLES\nFOR DAILY IMPROVEMENT KATA TRAINING\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-48-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 49\nRapid PDCA CyclesThe 5-Question Coaching Dialog\nTHESE ARE THE TWO FUNDAMENTAL ROUTINES\nAT THE CORE OF THE COACHING KATA\nThe Five Question card is available on the Toyota Kata Website\nFive-Question Card\nUsed by the COACH\nPDCA Cycles Record\nUsed by the LEARNER\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-49-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 50\nCurrent\nCondition\nTarget\nCondition\nLearner\nCoach\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-50-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 51\nTHE 2nd COACHES\nThey observe &amp; coach the coaches\nThere will be a need for some master coaches. These may\ninitially come from the Advance Group, Lean staff, etc.\nw\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-51-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 52\nTHE IMPORTANT ROLE\nOF THE 2nd COACH\nThe apparent simplicity of the Five Questions makes\ncoaching seem easier to learn than it is. We underestimate\nwhatʼs involved in coaching and what it takes to learn it. It\ntakes considerable practice and regular reflection to\nmaster the intent and pattern of the Coaching Kata.\nFor the Coach, coaching cycles are not only a means of\nteaching the Improvement Kata pattern but also a PDCA\ncycle whereby the Coach checks and reflects on the result\nof his/her last coaching. If the Learner isnʼt learning the\nImprovement Kata or a team is not achieving its target\nconditions the problem is usually in the coaching.\nIn other words, the Coach is practicing the Coaching Kata\nand for this needs someone with coaching experience to\nperiodically observe him conducting coaching cycles and\nprovide feedback (to coach the coach). Thatʼs the role of\nthe 2nd coach.\nPeriodic observation of coaching cycles by an\nexperienced second coach is essential if you want\nto teach managers effective coaching skills.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-52-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 53\n2nd Coach\nParticipates\nperiodically\n(eg. once / week)\nPays particular\nattention to the Coach\n(coaches the Coach)\nLearnerʼs\nStoryboard\nProcess\nLearnerCoach\n(Manager)\nCoach is responsible for\nteaching the Improvement Kata\npattern, and for the results\nLearner &amp; Team own\nthe target condition\nand work to achieve it\nTeam\nTHE ROLE OF THE 2nd COACH\nThe 2nd Coachʼs role is to ensure that middle managers are\nteaching/coaching the Improvement Kata correctly.\nThe 2nd Coach does this primarily by observing a managersʼ\ncoaching cycles.\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-53-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 54\nA COACHING CYCLE IN ACTION\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-54-2048.jpg)\n![How to Deploy the Improvement Kata© Mike Rother 55\nSummary:\nIMPROVEMENT KATA PRACTICE\nIS BRAIN TRAINING!\nDetailed practice instructions are available in the\nonline Improvement Kata and Coaching Kata Practice\nGuide, which is available on the Toyota Kata Website\n](https://image.slidesharecdn.com/deploying-110425150644-phpapp02/75/How-to-Deploy-the-Improvement-Kata-v7-0-55-2048.jpg)\n## Recommended\n[](https://www.slideshare.net/slideshow/developing-scientific-thinking-in-your-team/251209449)\nPPTX\nDeveloping Scientific Thinking in Your Team\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-slides-graphics/37399091)\nPPTX\nKata Slides &amp; Graphics v4.1\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/introduction-to-the-improvement-kata/6591786)\nPDF\nIntroduction to the Improvement Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-toyota-kata-starter-kata-91066009/91066009)\nPPTX\nThe Toyota Kata Starter Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/starter-kata-for-scientific-thinking-97744629/97744629)\nPPTX\nStarter Kata for Scientific Thinking\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-steps-of-the-improvement-kata/20690279)\nPDF\nThe Improvement Kata Pattern\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/starter-kata-for-coaching/83797308)\nPPTX\nStarter Kata for Coaching\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-walks/27392332)\nPDF\nKata Walks\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-coaching-kata-chain-of-coaching-84487545/84487545)\nPPTX\nThe Coaching Kata Chain of Coaching\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/adaptive-company/4966375)\nPDF\nThe Role of Challenge in Continuous Improvement\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-creates-culture/13755522)\nPDF\nKata Creates Culture\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-wrong-kata/11678459)\nPDF\nThe Wrong Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-3101182/3101182)\nPDF\nToyota Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/how-kata-fits-in/41869577)\nPPTX\nHow Kata Fits In\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-five-questions/10609725)\nPDF\nThe Five Coaching Kata Questions\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/turning-value-stream-maps-into-reality/249804738)\nPPTX\nTurning Value Stream Maps into Reality\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/make-your-a3-work-as-it-should/250764599)\nPDF\nMake your A3 work as it should!\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-five-question-card/238636674)\nPPTX\nToyota Kata Five Question Card\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-at-university-198463607/198463607)\nPDF\nToyota Kata at University\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/definition-of-lean-part-2-238543818/238543818)\nPPTX\nDefinition of &quot;Lean&quot; - Part 2\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/tk-forms-v1-1/28414020)\nPDF\nToyota Kata How to Use the Key Improvement Kata Forms\nby[RichardCGreen](https://www.slideshare.net/RichardCGreen)\n[](https://www.slideshare.net/slideshow/a-definition-of-lean-250602668/250602668)\nPPTX\nA Definition of Lean\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/value-stream-mapping-and-toyota-kata-123356815/123356815)\nPPTX\nVSM and Toyota Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/improvement-kata-reference-guide/27923595)\nPDF\nImprovement Kata Reference Guide\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/a3-and-the-improvement-kata/30551681)\nPPTX\nWhy Your A3 Needs the IK\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-coaching-pdca/12054586)\nPPTX\nToyota Kata Coaching &amp; PDCA\nby[W3 Group Consulting](https://www.slideshare.net/BillCW3)\n[](https://www.slideshare.net/slideshow/improvement-kat/27923247)\nPDF\nImprovement Kata Flowchart\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/how-to-use-vsm-correctly/80840672)\nPDF\nHow to Use VSM Correctly\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kataupdate-reflexion-by-mike-rother/83848082)\nPDF\nKATA-UPDATE / REFLEXION by Mike Rother\nby[KATA- Praktikertag](https://www.slideshare.net/KATAPraktikertag)\n[](https://www.slideshare.net/slideshow/improvement-kata-workshop-manual-february-2016/58501038)\nPPTX\nImprovement Kata Workshop\nby[W3 Group Canada Inc.](https://www.slideshare.net/MarekPiatkowski)\n## More Related Content\n[](https://www.slideshare.net/slideshow/developing-scientific-thinking-in-your-team/251209449)\nPPTX\nDeveloping Scientific Thinking in Your Team\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-slides-graphics/37399091)\nPPTX\nKata Slides &amp; Graphics v4.1\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/introduction-to-the-improvement-kata/6591786)\nPDF\nIntroduction to the Improvement Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-toyota-kata-starter-kata-91066009/91066009)\nPPTX\nThe Toyota Kata Starter Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/starter-kata-for-scientific-thinking-97744629/97744629)\nPPTX\nStarter Kata for Scientific Thinking\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-steps-of-the-improvement-kata/20690279)\nPDF\nThe Improvement Kata Pattern\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/starter-kata-for-coaching/83797308)\nPPTX\nStarter Kata for Coaching\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-walks/27392332)\nPDF\nKata Walks\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/developing-scientific-thinking-in-your-team/251209449)\nDeveloping Scientific Thinking in Your Team\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-slides-graphics/37399091)\nKata Slides &amp; Graphics v4.1\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/introduction-to-the-improvement-kata/6591786)\nIntroduction to the Improvement Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-toyota-kata-starter-kata-91066009/91066009)\nThe Toyota Kata Starter Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/starter-kata-for-scientific-thinking-97744629/97744629)\nStarter Kata for Scientific Thinking\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-steps-of-the-improvement-kata/20690279)\nThe Improvement Kata Pattern\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/starter-kata-for-coaching/83797308)\nStarter Kata for Coaching\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-walks/27392332)\nKata Walks\nby[Mike Rother](https://www.slideshare.net/mike734)\n### What&#x27;s hot\n[](https://www.slideshare.net/slideshow/the-coaching-kata-chain-of-coaching-84487545/84487545)\nPPTX\nThe Coaching Kata Chain of Coaching\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/adaptive-company/4966375)\nPDF\nThe Role of Challenge in Continuous Improvement\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-creates-culture/13755522)\nPDF\nKata Creates Culture\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-wrong-kata/11678459)\nPDF\nThe Wrong Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-3101182/3101182)\nPDF\nToyota Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/how-kata-fits-in/41869577)\nPPTX\nHow Kata Fits In\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-five-questions/10609725)\nPDF\nThe Five Coaching Kata Questions\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/turning-value-stream-maps-into-reality/249804738)\nPPTX\nTurning Value Stream Maps into Reality\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/make-your-a3-work-as-it-should/250764599)\nPDF\nMake your A3 work as it should!\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-five-question-card/238636674)\nPPTX\nToyota Kata Five Question Card\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-at-university-198463607/198463607)\nPDF\nToyota Kata at University\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/definition-of-lean-part-2-238543818/238543818)\nPPTX\nDefinition of &quot;Lean&quot; - Part 2\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/tk-forms-v1-1/28414020)\nPDF\nToyota Kata How to Use the Key Improvement Kata Forms\nby[RichardCGreen](https://www.slideshare.net/RichardCGreen)\n[](https://www.slideshare.net/slideshow/a-definition-of-lean-250602668/250602668)\nPPTX\nA Definition of Lean\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/value-stream-mapping-and-toyota-kata-123356815/123356815)\nPPTX\nVSM and Toyota Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/improvement-kata-reference-guide/27923595)\nPDF\nImprovement Kata Reference Guide\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/a3-and-the-improvement-kata/30551681)\nPPTX\nWhy Your A3 Needs the IK\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-coaching-pdca/12054586)\nPPTX\nToyota Kata Coaching &amp; PDCA\nby[W3 Group Consulting](https://www.slideshare.net/BillCW3)\n[](https://www.slideshare.net/slideshow/improvement-kat/27923247)\nPDF\nImprovement Kata Flowchart\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/how-to-use-vsm-correctly/80840672)\nPDF\nHow to Use VSM Correctly\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-coaching-kata-chain-of-coaching-84487545/84487545)\nThe Coaching Kata Chain of Coaching\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/adaptive-company/4966375)\nThe Role of Challenge in Continuous Improvement\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/kata-creates-culture/13755522)\nKata Creates Culture\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-wrong-kata/11678459)\nThe Wrong Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-3101182/3101182)\nToyota Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/how-kata-fits-in/41869577)\nHow Kata Fits In\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/the-five-questions/10609725)\nThe Five Coaching Kata Questions\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/turning-value-stream-maps-into-reality/249804738)\nTurning Value Stream Maps into Reality\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/make-your-a3-work-as-it-should/250764599)\nMake your A3 work as it should!\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-five-question-card/238636674)\nToyota Kata Five Question Card\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-at-university-198463607/198463607)\nToyota Kata at University\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/definition-of-lean-part-2-238543818/238543818)\nDefinition of &quot;Lean&quot; - Part 2\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/tk-forms-v1-1/28414020)\nToyota Kata How to Use the Key Improvement Kata Forms\nby[RichardCGreen](https://www.slideshare.net/RichardCGreen)\n[](https://www.slideshare.net/slideshow/a-definition-of-lean-250602668/250602668)\nA Definition of Lean\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/value-stream-mapping-and-toyota-kata-123356815/123356815)\nVSM and Toyota Kata\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/improvement-kata-reference-guide/27923595)\nImprovement Kata Reference Guide\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/a3-and-the-improvement-kata/30551681)\nWhy Your A3 Needs the IK\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/toyota-kata-coaching-pdca/12054586)\nToyota Kata Coaching &amp; PDCA\nby[W3 Group Consulting](https://www.slideshare.net/BillCW3)\n[](https://www.slideshare.net/slideshow/improvement-kat/27923247)\nImprovement Kata Flowchart\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/how-to-use-vsm-correctly/80840672)\nHow to Use VSM Correctly\nby[Mike Rother](https://www.slideshare.net/mike734)\n### Similar to How to Deploy the Improvement Kata v7.0\n[](https://www.slideshare.net/slideshow/kataupdate-reflexion-by-mike-rother/83848082)\nPDF\nKATA-UPDATE / REFLEXION by Mike Rother\nby[KATA- Praktikertag](https://www.slideshare.net/KATAPraktikertag)\n[](https://www.slideshare.net/slideshow/improvement-kata-workshop-manual-february-2016/58501038)\nPPTX\nImprovement Kata Workshop\nby[W3 Group Canada Inc.](https://www.slideshare.net/MarekPiatkowski)\n[](https://www.slideshare.net/slideshow/midwest-kata-practitioner-day-2019-128404566/128404566)\nPPTX\nMidwest Kata Practitioner Day 2019\nby[Melissa Christman](https://www.slideshare.net/MelissaChristman1)\n[](https://www.slideshare.net/slideshow/practice-guidelines/24064237)\nPDF\nPractice guidelines\nby[Kyle Eyrich](https://www.slideshare.net/KyleEyrich)\n[](https://www.slideshare.net/slideshow/midwest-kata-practitioners-day/76105559)\nPDF\nMidwest Kata Practitioners Day\nby[Tim Murphy](https://www.slideshare.net/tbsmca)\n[](https://www.slideshare.net/slideshow/toyota-kata-coaching-for-agile-teams-transformations/268701350)\nPDF\nToyota Kata Coaching for Agile Teams &amp; Transformations\nby[Stefan Wolpers](https://www.slideshare.net/wolpers1)\n[](https://www.slideshare.net/slideshow/twi-and-kata-skill-patterns-to-develop-a-culture-of-coaching/109837968)\nPDF\nTWI and Kata: Skill Patterns to Develop a Culture of Coaching\nby[KaiNexus](https://www.slideshare.net/KaiNexus)\n[](https://www.slideshare.net/slideshow/introduction-to-kata/63990230)\nPPTX\nIntroduction to Kata\nby[Emma Dickens](https://www.slideshare.net/EmmaDickens)\n[](https://www.slideshare.net/slideshow/wissenspool318vortrag-nr-1thechallengeofdevelopingleanmanagement544511/69582686)\nPDF\nWissenspool.318.vortrag nr \\_1\\_\\_the\\_challenge\\_of\\_developing\\_lean\\_management.54...\nby[Mario Charlin](https://www.slideshare.net/acharlin)\n[](https://www.slideshare.net/slideshow/kata-254469888/254469888)\nPPTX\nKATA\nby[jeremy696417](https://www.slideshare.net/jeremy696417)\n[](https://www.slideshare.net/slideshow/leadership-kata/87190888)\nPPTX\nLeadership kata\nby[Maris Prabhakaran M](https://www.slideshare.net/marisagility)\n[](https://www.slideshare.net/slideshow/kata-in-the-community/245004737)\nPDF\nKata in the Community\nby[KaiNexus](https://www.slideshare.net/KaiNexus)\n[](https://www.slideshare.net/slideshow/midwest-kata-practitioner-day-2018-part-1-86753757/86753757)\nPDF\nMidwest Kata Practitioner Day 2018 - Part 1\nby[Melissa Christman](https://www.slideshare.net/MelissaChristman1)\n[](https://www.slideshare.net/slideshow/top-10-toyota-kata-lessons/31686280)\nPPTX\nTOP 10 TOYOTA KATA LESSONS\nby[Michael Lombard](https://www.slideshare.net/MichaelLombard)\n[](https://www.slideshare.net/slideshow/about-the-toyota-kata-research/53136189)\nPDF\nAbout the Toyota Kata Research\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/lecture-1a-69459790/69459790)\nPDF\nLecture 1a\nby[Max Lyons](https://www.slideshare.net/MaxLyons1)\n[](https://www.slideshare.net/slideshow/tkcprefacepdf/262812761)\nPDF\nTKC\\_Preface.pdf\nby[Mohsen Khabir](https://www.slideshare.net/khabiran)\n[](https://www.slideshare.net/slideshow/lecture-5a/69459815)\nPDF\nLecture 5a\nby[Max Lyons](https://www.slideshare.net/MaxLyons1)\n[](https://www.slideshare.net/slideshow/what-is-kata-toyotas-karate-concept-for-lean-continuous-improvement-and-coaching-success/239051529)\nPDF\nWhat is Kata? Toyota’s Karate Concept for Lean Continuous Improvement and Coa...\nby[QuekelsBaro](https://www.slideshare.net/QuekelsBaro)\n[](https://www.slideshare.net/slideshow/rethinking-improvements-volume-1/248938409)\nPDF\nRe:Thinking Improvements, Volume 1\nby[Dominik Ortelt](https://www.slideshare.net/DominikOrtelt)\n[](https://www.slideshare.net/slideshow/kataupdate-reflexion-by-mike-rother/83848082)\nKATA-UPDATE / REFLEXION by Mike Rother\nby[KATA- Praktikertag](https://www.slideshare.net/KATAPraktikertag)\n[](https://www.slideshare.net/slideshow/improvement-kata-workshop-manual-february-2016/58501038)\nImprovement Kata Workshop\nby[W3 Group Canada Inc.](https://www.slideshare.net/MarekPiatkowski)\n[](https://www.slideshare.net/slideshow/midwest-kata-practitioner-day-2019-128404566/128404566)\nMidwest Kata Practitioner Day 2019\nby[Melissa Christman](https://www.slideshare.net/MelissaChristman1)\n[](https://www.slideshare.net/slideshow/practice-guidelines/24064237)\nPractice guidelines\nby[Kyle Eyrich](https://www.slideshare.net/KyleEyrich)\n[](https://www.slideshare.net/slideshow/midwest-kata-practitioners-day/76105559)\nMidwest Kata Practitioners Day\nby[Tim Murphy](https://www.slideshare.net/tbsmca)\n[](https://www.slideshare.net/slideshow/toyota-kata-coaching-for-agile-teams-transformations/268701350)\nToyota Kata Coaching for Agile Teams &amp; Transformations\nby[Stefan Wolpers](https://www.slideshare.net/wolpers1)\n[](https://www.slideshare.net/slideshow/twi-and-kata-skill-patterns-to-develop-a-culture-of-coaching/109837968)\nTWI and Kata: Skill Patterns to Develop a Culture of Coaching\nby[KaiNexus](https://www.slideshare.net/KaiNexus)\n[](https://www.slideshare.net/slideshow/introduction-to-kata/63990230)\nIntroduction to Kata\nby[Emma Dickens](https://www.slideshare.net/EmmaDickens)\n[](https://www.slideshare.net/slideshow/wissenspool318vortrag-nr-1thechallengeofdevelopingleanmanagement544511/69582686)\nWissenspool.318.vortrag nr \\_1\\_\\_the\\_challenge\\_of\\_developing\\_lean\\_management.54...\nby[Mario Charlin](https://www.slideshare.net/acharlin)\n[](https://www.slideshare.net/slideshow/kata-254469888/254469888)\nKATA\nby[jeremy696417](https://www.slideshare.net/jeremy696417)\n[](https://www.slideshare.net/slideshow/leadership-kata/87190888)\nLeadership kata\nby[Maris Prabhakaran M](https://www.slideshare.net/marisagility)\n[](https://www.slideshare.net/slideshow/kata-in-the-community/245004737)\nKata in the Community\nby[KaiNexus](https://www.slideshare.net/KaiNexus)\n[](https://www.slideshare.net/slideshow/midwest-kata-practitioner-day-2018-part-1-86753757/86753757)\nMidwest Kata Practitioner Day 2018 - Part 1\nby[Melissa Christman](https://www.slideshare.net/MelissaChristman1)\n[](https://www.slideshare.net/slideshow/top-10-toyota-kata-lessons/31686280)\nTOP 10 TOYOTA KATA LESSONS\nby[Michael Lombard](https://www.slideshare.net/MichaelLombard)\n[](https://www.slideshare.net/slideshow/about-the-toyota-kata-research/53136189)\nAbout the Toyota Kata Research\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/lecture-1a-69459790/69459790)\nLecture 1a\nby[Max Lyons](https://www.slideshare.net/MaxLyons1)\n[](https://www.slideshare.net/slideshow/tkcprefacepdf/262812761)\nTKC\\_Preface.pdf\nby[Mohsen Khabir](https://www.slideshare.net/khabiran)\n[](https://www.slideshare.net/slideshow/lecture-5a/69459815)\nLecture 5a\nby[Max Lyons](https://www.slideshare.net/MaxLyons1)\n[](https://www.slideshare.net/slideshow/what-is-kata-toyotas-karate-concept-for-lean-continuous-improvement-and-coaching-success/239051529)\nWhat is Kata? Toyota’s Karate Concept for Lean Continuous Improvement and Coa...\nby[QuekelsBaro](https://www.slideshare.net/QuekelsBaro)\n[](https://www.slideshare.net/slideshow/rethinking-improvements-volume-1/248938409)\nRe:Thinking Improvements, Volume 1\nby[Dominik Ortelt](https://www.slideshare.net/DominikOrtelt)\n### More from Mike Rother\n[](https://es.slideshare.net/slideshow/kata-in-the-classroom-overview-47711515/47711515)\nPDF\nKata in the Classroom\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/two-mindsets/28071235)\nPDF\nTwo Mindsets\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/a-definition-of-lean-238527111/238527111)\nPPTX\nA Definition of &quot;Lean&quot; - Part 1\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/scientific-thinking-for-everyone-233951821/233951821)\nPPTX\nScientific Thinking for Everyone\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/curiosity-and-schooling/63197415)\nPPTX\nWhat Kills Our Curiosity?\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/pdca-fast-start/27225394)\nPDF\nPDCA FAST START\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/a-definition-of-lean/32227319)\nPPTX\nWhat is &#x27;Lean&#x27; About?\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/learning-new-skills-45553501/45553501)\nPDF\nLearning New Skills\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/european-lean-educator-conference-closing-remarks/39901402)\nPPTX\nEuropean Lean Educator Conference 2014 - Closing Remarks\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/two-mindset-obstacles-to-effective-learning/37241081)\nPDF\nTwo Mindset Obstacles to Effective Learning\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://es.slideshare.net/slideshow/kata-in-the-classroom-overview-47711515/47711515)\nKata in the Classroom\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/two-mindsets/28071235)\nTwo Mindsets\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/a-definition-of-lean-238527111/238527111)\nA Definition of &quot;Lean&quot; - Part 1\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/scientific-thinking-for-everyone-233951821/233951821)\nScientific Thinking for Everyone\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/curiosity-and-schooling/63197415)\nWhat Kills Our Curiosity?\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/pdca-fast-start/27225394)\nPDCA FAST START\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/a-definition-of-lean/32227319)\nWhat is &#x27;Lean&#x27; About?\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/learning-new-skills-45553501/45553501)\nLearning New Skills\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/european-lean-educator-conference-closing-remarks/39901402)\nEuropean Lean Educator Conference 2014 - Closing Remarks\nby[Mike Rother](https://www.slideshare.net/mike734)\n[](https://www.slideshare.net/slideshow/two-mindset-obstacles-to-effective-learning/37241081)\nTwo Mindset Obstacles to Effective Learning\nby[Mike Rother](https://www.slideshare.net/mike734)\n### Recently uploaded\n[](https://www.slideshare.net/slideshow/top-13-resources-for-quickly-buying-instagram-followers-online-pdf/284829018)\nPDF\nTop 13 Resources for Quickly Buying Instagram Followers Online.pdf\nby[uf0ra36ft2pin03yy923](https://www.slideshare.net/uf0ra36ft2pin03yy923)\n[](https://www.slideshare.net/slideshow/best-platforms-to-buy-and-sell-facebook-accounts-safely-pdf/284829051)\nPDF\nBest Platforms to Buy and Sell Facebook Accounts Safely.pdf\nby[uf0ra36ft2pin03yy923](https://www.slideshare.net/uf0ra36ft2pin03yy923)\n[](https://www.slideshare.net/slideshow/5-siif_siif_recruitment_deck_251208-pdf/284764452)\nPDF\n5分でわかるSIIF\\_SIIF\\_Recruitment\\_Deck\\_251208.pdf\nby[media251291](https://www.slideshare.net/media251291)\n[](https://www.slideshare.net/slideshow/top-site-buy-twitter-accounts-a-complete-guide-new-old-pdf/284777272)\nPDF\nTop Site Buy Twitter Accounts A Complete Guide New &amp; Old.pdf\nby[5scktr81c3krcw3q0ubl](https://www.slideshare.net/5scktr81c3krcw3q0ubl)\n[](https://www.slideshare.net/slideshow/safe-and-secure-tiktok-shop-seller-center-accounts-for-sale-pdf/284815266)\nPDF\nSafe and Secure TikTok Shop Seller Center Accounts for Sale.pdf\nby[q335922mr8pvcoxpz82y](https://www.slideshare.net/q335922mr8pvcoxpz82y)\n[](https://www.slideshare.net/slideshow/the-fourth-industrial-revolution-and-its-components/284750005)\nPPTX\nThe fourth Industrial revolution and its components\nby[rosin4](https://www.slideshare.net/rosin4)\n[](https://www.slideshare.net/slideshow/how-to-buy-snapchat-account-a-step-by-step-guide-pdf/284814618)\nPDF\nHow to Buy Snapchat Account A Step-by-Step Guide..pdf\nby[ro0dfvr3lyp296oyw](https://www.slideshare.net/ro0dfvr3lyp296oyw)\n[](https://www.slideshare.net/slideshow/how-to-buy-snapchat-account-a-step-by-step-guide-in-new-year-pdf/284814619)\nPDF\nHow to Buy Snapchat Account A Step-by-Step Guide in new year..pdf\nby[ro0dfvr3lyp296oyw](https://www.slideshare.net/ro0dfvr3lyp296oyw)\n[](https://www.slideshare.net/slideshow/china-gold-internatinal-q3-results-english/284783302)\nPDF\nChina Gold Internatinal Q3 RESULTS ENGLISH\nby[China\\_Gold\\_International\\_Resources](https://www.slideshare.net/China_Gold_International_Resources)\n[](https://www.slideshare.net/slideshow/alvin-kressler-a-bronze-star-recipient/284791093)\nPDF\nAlvin Kressler - A Bronze Star Recipient\nby[Alvin Kressler](https://www.slideshare.net/alvinkressler1)\n[](https://www.slideshare.net/slideshow/best-7-platforms-to-buy-verified-chime-bank-accounts-pdf/284727231)\nPDF\nBest 7 Platforms to Buy Verified Chime Bank Accounts.pdf\nby[Socaialaccount](https://www.slideshare.net/Socaialaccount)\n[](https://www.slideshare.net/slideshow/buy-verified-chase-bank-account_-secure-fast-amp-pdf/284727233)\nPDF\nBuy Verified Chase Bank account\\_ Secure, Fast &amp;&amp;amp.pdf\nby[Socaialaccount](https://www.slideshare.net/Socaialaccount)\n[](https://www.slideshare.net/slideshow/how-to-buy-and-selling-linkedin-account-in-usa-pdf/284814127)\nPDF\nHow to Buy and Selling LinkedIn Account in USA .pdf\nby[keb2bq5cegc6m2xa32ay](https://www.slideshare.net/keb2bq5cegc6m2xa32ay)\n[](https://www.slideshare.net/slideshow/why-bu-ying-twitter-accounts-in-the-usa-and-uk_-pdf/284814123)\nPDF\nWhy Bu, Ying, Twitter Accounts In The USA And UK\\_.pdf\nby[keb2bq5cegc6m2xa32ay](https://www.slideshare.net/keb2bq5cegc6m2xa32ay)\n[](https://www.slideshare.net/slideshow/a-brief-introduction-about-john-michael-philbin/284792117)\nPDF\nA Brief Introduction About John Michael Philbin\nby[John Michael Philbin](https://www.slideshare.net/johnmichaelphilbinus)\n[](https://www.slideshare.net/slideshow/healing-money-wounds-a-guide-to-financial-wholeness-for-healers-spiritual-entrepreneurs/284789896)\nPDF\nHealing Money Wounds: A Guide to Financial Wholeness for Healers &amp; Spiritual ...\nby[Jenna Newbery](https://www.slideshare.net/jennanewbery)\n[](https://www.slideshare.net/slideshow/how-to-buy-instagramaccount-in-new-year-pdf/284814126)\nPDF\nHow to Buy InstagramAccount in new year.pdf\nby[keb2bq5cegc6m2xa32ay](https://www.slideshare.net/keb2bq5cegc6m2xa32ay)\n[](https://www.slideshare.net/slideshow/crb-money-correspondent-banking-relationships-2025-2026/284728367)\nPDF\nCRB.money :: Correspondent Banking Relationships 2025-2026\nby[Vladislav Solodkiy](https://www.slideshare.net/vsolodkiy)\n[](https://www.slideshare.net/slideshow/top-10-websites-to-buy-instagram-accounts-tone-pdf/284814620)\nPDF\nTop 10 Websites to Buy Instagram Accounts Tone.pdf\nby[ro0dfvr3lyp296oyw](https://www.slideshare.net/ro0dfvr3lyp296oyw)\n[](https://www.slideshare.net/slideshow/top-platforms-for-buying-and-selling-facebook-accounts-online-pdf/284815344)\nPDF\nTop Platforms for Buying and Selling Facebook Accounts Online.pdf\nby[q335922mr8pvcoxpz82y](https://www.slideshare.net/q335922mr8pvcoxpz82y)\n[](https://www.slideshare.net/slideshow/top-13-resources-for-quickly-buying-instagram-followers-online-pdf/284829018)\nTop 13 Resources for Quickly Buying Instagram Followers Online.pdf\nby[uf0ra36ft2pin03yy923](https://www.slideshare.net/uf0ra36ft2pin03yy923)\n[](https://www.slideshare.net/slideshow/best-platforms-to-buy-and-sell-facebook-accounts-safely-pdf/284829051)\nBest Platforms to Buy and Sell Facebook Accounts Safely.pdf\nby[uf0ra36ft2pin03yy923](https://www.slideshare.net/uf0ra36ft2pin03yy923)\n[](https://www.slideshare.net/slideshow/5-siif_siif_recruitment_deck_251208-pdf/284764452)\n5分でわかるSIIF\\_SIIF\\_Recruitment\\_Deck\\_251208.pdf\nby[media251291](https://www.slideshare.net/media251291)\n[](https://www.slideshare.net/slideshow/top-site-buy-twitter-accounts-a-complete-guide-new-old-pdf/284777272)\nTop Site Buy Twitter Accounts A Complete Guide New &amp; Old.pdf\nby[5scktr81c3krcw3q0ubl](https://www.slideshare.net/5scktr81c3krcw3q0ubl)\n[](https://www.slideshare.net/slideshow/safe-and-secure-tiktok-shop-seller-center-accounts-for-sale-pdf/284815266)\nSafe and Secure TikTok Shop Seller Center Accounts for Sale.pdf\nby[q335922mr8pvcoxpz82y](https://www.slideshare.net/q335922mr8pvcoxpz82y)\n[](https://www.slideshare.net/slideshow/the-fourth-industrial-revolution-and-its-components/284750005)\nThe fourth Industrial revolution and its components\nby[rosin4](https://www.slideshare.net/rosin4)\n[](https://www.slideshare.net/slideshow/how-to-buy-snapchat-account-a-step-by-step-guide-pdf/284814618)\nHow to Buy Snapchat Account A Step-by-Step Guide..pdf\nby[ro0dfvr3lyp296oyw](https://www.slideshare.net/ro0dfvr3lyp296oyw)\n[](https://www.slideshare.net/slideshow/how-to-buy-snapchat-account-a-step-by-step-guide-in-new-year-pdf/284814619)\nHow to Buy Snapchat Account A Step-by-Step Guide in new year..pdf\nby[ro0dfvr3lyp296oyw](https://www.slideshare.net/ro0dfvr3lyp296oyw)\n[](https://www.slideshare.net/slideshow/china-gold-internatinal-q3-results-english/284783302)\nChina Gold Internatinal Q3 RESULTS ENGLISH\nby[China\\_Gold\\_International\\_Resources](https://www.slideshare.net/China_Gold_International_Resources)\n[](https://www.slideshare.net/slideshow/alvin-kressler-a-bronze-star-recipient/284791093)\nAlvin Kressler - A Bronze Star Recipient\nby[Alvin Kressler](https://www.slideshare.net/alvinkressler1)\n[](https://www.slideshare.net/slideshow/best-7-platforms-to-buy-verified-chime-bank-accounts-pdf/284727231)\nBest 7 Platforms to Buy Verified Chime Bank Accounts.pdf\nby[Socaialaccount](https://www.slideshare.net/Socaialaccount)\n[](https://www.slideshare.net/slideshow/buy-verified-chase-bank-account_-secure-fast-amp-pdf/284727233)\nBuy Verified Chase Bank account\\_ Secure, Fast &amp;&amp;amp.pdf\nby[Socaialaccount](https://www.slideshare.net/Socaialaccount)\n[](https://www.slideshare.net/slideshow/how-to-buy-and-selling-linkedin-account-in-usa-pdf/284814127)\nHow to Buy and Selling LinkedIn Account in USA .pdf\nby[keb2bq5cegc6m2xa32ay](https://www.slideshare.net/keb2bq5cegc6m2xa32ay)\n[](https://www.slideshare.net/slideshow/why-bu-ying-twitter-accounts-in-the-usa-and-uk_-pdf/284814123)\nWhy Bu, Ying, Twitter Accounts In The USA And UK\\_.pdf\nby[keb2bq5cegc6m2xa32ay](https://www.slideshare.net/keb2bq5cegc6m2xa32ay)\n[](https://www.slideshare.net/slideshow/a-brief-introduction-about-john-michael-philbin/284792117)\nA Brief Introduction About John Michael Philbin\nby[John Michael Philbin](https://www.slideshare.net/johnmichaelphilbinus)\n[](https://www.slideshare.net/slideshow/healing-money-wounds-a-guide-to-financial-wholeness-for-healers-spiritual-entrepreneurs/284789896)\nHealing Money Wounds: A Guide to Financial Wholeness for Healers &amp; Spiritual ...\nby[Jenna Newbery](https://www.slideshare.net/jennanewbery)\n[](https://www.slideshare.net/slideshow/how-to-buy-instagramaccount-in-new-year-pdf/284814126)\nHow to Buy InstagramAccount in new year.pdf\nby[keb2bq5cegc6m2xa32ay](https://www.slideshare.net/keb2bq5cegc6m2xa32ay)\n[](https://www.slideshare.net/slideshow/crb-money-correspondent-banking-relationships-2025-2026/284728367)\nCRB.money :: Correspondent Banking Relationships 2025-2026\nby[Vladislav Solodkiy](https://www.slideshare.net/vsolodkiy)\n[](https://www.slideshare.net/slideshow/top-10-websites-to-buy-instagram-accounts-tone-pdf/284814620)\nTop 10 Websites to Buy Instagram Accounts Tone.pdf\nby[ro0dfvr3lyp296oyw](https://www.slideshare.net/ro0dfvr3lyp296oyw)\n[](https://www.slideshare.net/slideshow/top-platforms-for-buying-and-selling-facebook-accounts-online-pdf/284815344)\nTop Platforms for Buying and Selling Facebook Accounts Online.pdf\nby[q335922mr8pvcoxpz82y](https://www.slideshare.net/q335922mr8pvcoxpz82y)\n## How to Deploy the Improvement Kata v7.0\n* 1.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#1)the Improvement Kata© Mike Rother 1\nHow to Deploy the\nImprovement Kata\nBased on our experiences so far\nMike\nRother\nBill\nCostantino\nBeth\nCarrington\nGerd\nAulinger\nv 7.0\nCopyright ©2015 by Mike Rother, all rights reserved\n1217 Baldwin Avenue / Ann Arbor, MI 48104 USA / tel: (734) 665-5411 / mrother@umich.edu\nFor reference\nsee:\nChapter\n9\nPublished\nApril 2011\n&amp; periodically\nupdated\nIncludes\nHow to\nRun Your\nADVANCE\nGROUP\n* 2.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#2)the Improvement Kata© Mike Rother 2\nThe Improvement Kata and Coaching Kata are about teaching a\nsystematic and scientific way of working throughout an\norganization, to get better at reaching difficult goals.\nFor most organizations this will be a change process that involves\nhaving people develop new skills and mindset through deliberate,\ncoached practice. Managers guide the development of their\npeopleʼs skills by coaching them in daily practice on real goals. Of\ncourse, those managers will have to be among the first to practice\nand learn the new skills themselves, before they can coach others.\nIntentionally changing an organizationʼs culture is a significant\nundertaking. In this case there are scientific skills (the Improvement\nKata pattern) and teaching/coaching skills (the Coaching Kata). This\nSlideShare describes a well-tested approach for deploying IK/CK skill\ndevelopment in an organization. It is intended to be an input to your\nown deployment process and discoveries.\nINTRODUCTION\nMike Rother\n* 3.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#3)the Improvement Kata© Mike Rother 3\nWHAT ITʼS ALL ABOUT:\n-- Learning Scientific Skills --\nThe Improvement Kata &amp; Coaching Kata\ncombine a scientific working pattern\nwith techniques of deliberate practice,\nto make scientific thinking a teachable\nmeta-skill that anyone can learn.\nThese foundational thinking habits are the basis for:\n•Learning how to successfully\npursue seemingly unattainable\ngoals in complex systems.\n•Enabling teams who are nearer to\na situation to make their own\ndecisions &amp; maneuver effectively.\n* 4.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#4)the Improvement Kata© Mike Rother 4\nMike\nGerd\nBill\nBeth\nWEʼVE LEARNED A LOT ABOUT DEPLOYING\nIMPROVEMENT-KATA SKILL DEVELOPMENT\nPracticing the Improvement Kata helps anyone get better at\nnavigating unknown territory and meeting challenges. To\nmake the pattern of the Improvement Kata a habit it should\nbe practiced and coached every day.\n* 5.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#5)the Improvement Kata© Mike Rother 5\nDEPLOYING THE IMPROVEMENT KATA\nINVOLVES SKILL-BUILDING PRACTICE\nThis document describes how to set up a coaching process in your\norganization, to train people in applying the Improvement Kata pattern\n* 6.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#6)the Improvement Kata© Mike Rother 6\nFOUR INGREDIENTS\nFOR LEARNING A NEW HABIT AND SKILL\nPRACTICE\nDaily repetition\nCOACHING\nCorrective\nfeedback\nKATA\nStructured routine to\npractice (beginner)\nMASTERY\nOvercoming\nobstacles\n* 7.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#7)the Improvement Kata© Mike Rother 7\nCOACHING IS A KEY INGREDIENT\nWithout coaching we lose our way and donʼt practice\nthe right pattern, or practice ineffectively.\nIf the Learner isnʼt learning the Improvement\nKata pattern or if the target condition is not\nbeing reached, examine the coaching.\nCOACHING\nCorrective\nfeedback\n* 8.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#8)the Improvement Kata© Mike Rother 8\nTHE DEPLOYMENT GOAL IS TO MAKE PRACTICING\nAND COACHING THE IMPROVEMENT KATA PATTERN\nPART OF EVERY DAYʼS WORK\nPracticing the Improvement Kata should get integrated\ninto daily management, not just be an add-on project or workshop\nA slice of each day is focused on striving\ntoward a challenging target condition via\nthe Improvement Kata pattern.\nThis is guided via the Five Coaching Kata\nQuestions (Coach/Manager) and the\nPDCA Cycles Record (Learner) in daily\nCoaching Cycles.\nTroubleshooting\nStriving with the\nImprovement Kata\nThe Workday\n* 9.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#9)the Improvement Kata© Mike Rother 9\nPRACTICE THE IMPROVEMENT KATA BY APPLYING\nIT TO A REAL PROCESS &amp; TARGET CONDITION\nLearners do 2 things simultaneously:\nStrive to reach a real target condition + practice the\npattern of the Improvement Kata\nTraining Doing\nDoing &amp;\nTraining\nNot this\nBut this\n(combined)\nHere the Coach can see in\nreal time where the Learner\nis, and introduce appropriate\nadjustments right away\n* 10.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#10)the Improvement Kata© Mike Rother 10\nThe Four Steps of the IMPROVEMENT KATA\nIterate Toward\nthe Target\nCondition\nC C\nT C\nEstablish the\nNext Target\nCondition\nTarget\nCondition\nGrasp the\nCurrent\nCondition\nUnderstand\nthe\nDirection\nThe COACHING KATA\nʻExecutingʼ\nCoaching\nCycles\nCoach Learner\nʻPlanningʼ Coaching Cycles\nTHERE ARE PRACTICE ROUTINES FOR EACH STEP OF\nTHE IMPROVEMENT KATA + THE COACHING KATA\nLEARNER\nCOACH\n* 11.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#11)the Improvement Kata© Mike Rother 11\nTHE IMPROVEMENT KATA &amp; COACHING KATA\nPRACTICE GUIDE HAS THE PRACTICE ROUTINES\nThis free online guidebook gives you step-by-step instructions\nA practice routine for\nGrasping the\nCurrent Condition\nA practice routine for\nEstablishing a\nTarget Condition\nA practice routine for\nIterating to the\nTarget Condition\nA practice routine for\nCoaching the IK\nA practice routine for\nSetting the Challenge\nAvailable on the\nToyota Kata Website\n* 12.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#12)the Improvement Kata© Mike Rother 12\nLESSONS LEARNED\nABOUT DEPLOYING\nTHE IMPROVEMENT KATA\nThis is not something for every organization. Itʼs about a\ndifferent way of managing, not just adding techniques on top\nof how you currently manage. Itʼs a process of developing\nnew skill and mindset throughout an organization, not just a\nproblem-solving approach to implement.\nTo bring the pattern of the Improvement Kata into the\noperation of your organization and make it a habit, mid-level\nmanagement will have to actively coach it every day.\nYou may think deploying simply means getting people in the\norganization to start practicing the Improvement Kata, but in\nour experience an effort to deploy the Improvement Kata\nneeds to be monitored and guided. To do that be sure to\nEstablish an ʻAdvance Groupʼ as described in this document.\nR\nR\nR\nLessons\nLearned\n* 13.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#13)the Improvement Kata© Mike Rother 13\nA gating factor is how much Coaching-Kata capability you\nare developing in your organization. You cannot expand\nwider and faster than your coaching capacity.\nTo be able to coach the Improvement Kata, a person has to\nknow how to do the Improvement Kata. Demonstrated\nproficiency with the Improvement Kata is ideally required\nbefore starting to coach.\nIt&#x27;s not sufficient for the organization&#x27;s leaders to simply\nsay they support the working pattern of the Improvement\nKata. If they donʼt practice it themselves in some way,\nthey will not understand it.\nR\nR\nR\nLessons\nLearned\ncontinued\n* 14.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#14)the Improvement Kata© Mike Rother 14\n* 15.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#15)the Improvement Kata© Mike Rother 15\nIMPROVEMENT KATA SKILL\nCOMES BEFORE COACHING SKILL\nTo coach the Improvement Kata you need\nexperience in applying the Improvement Kata\nSome proficiency\nwith the Improvement\nKata is required\nbefore you can coach\nPRACTICE\nImprovement\nKata\nPRACTICE\nCoaching\nKata\nAWARE\nof it\nAble to\nDO it\nAble to\nCOACH it\nKnow what\nKnow about the\nImprovement Kata\nKnow why\nCan teach others\nKnow how\nCan effectively apply\nthe Improvement Kata\n* 16.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#16)the Improvement Kata© Mike Rother 16\nTHREE KINDS OF PRACTICING\n(1)\nAWARENESS\nʻPRACTICEʼ\nThis is the first real practice. Focused practice\nsessions with the Improvement Kata pattern,\nconducted on real processes in your\norganization, with real target conditions.\n(2)\nSKILL-BUILDING\nPRACTICE\n(3)\nDAILY\nPRACTICE\nInitial study of the topic\n- Read Toyota Kata &amp; The Talent Code.\n- Participate in a Toyota Kata course or workshop.\n- Get initial experience with the Improvement Kata\nand Coaching Kata routines.\nDaily practice and daily Coaching Cycles, now\nbuilt into your normal management routine\n* 17.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#17)the Improvement Kata© Mike Rother 17\nPHASE I:\nIf your organization is interested in the IK / CK, start by forming a small group of &#x27;scouts&#x27;\nto study the subject. The scouts should take an Improvement Kata course, such as as\nthe ones offered by the University of Michigan and the Lean Enterprise Institute.\nPHASE II:\nNow the team of scouts better understands the scope of the task and how much itʼs\nabout culture change through deliberate practice. If the organization is still interested\nat this point then the next step is to form an Advance Group of about 5 people who will\noversee the deployment. This group should include at least one senior manager.\nAt this point an external coach can start working with the organization by coaching the\nAdvance Group. The external coach does not have responsibility for bringing the\nImprovement Kata into the organization. Thatʼs the responsibility of the Advance Group,\nwhich canʼt be delegated. Note that the Advance Group is not the start of a cascade,\nbut rather a group that will conduct PDCA of skill development at the organization level.\nAt this point the Advance Group practices applying the Improvement Kata to selected\nwork processes, under guidance of the external coach, in order to learn the\nImprovement Kata. This takes about 2 months.\nPHASE III:\nNow you can expand into the normal daily activity of middle managers by focusing on\napplying the Improvement Kata and Coaching Kata at work processes and their\nassociated chain of persons. You add processes as coaching capacity permits.\nThe Advance Group now monitors and shepherds the skill-development process.\nA THREE-PHASE DEPLOYMENT APPROACH\nOne way to bring the Improvement Kata into an organization\n* 18.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#18)the Improvement Kata© Mike Rother 18\nTHE THREE-PHASE DEPLOYMENT APPROACH\nSupervisorsAdvance\nGroup\nPractices\nthe IK\nSenior\nManagers\nArea\nManagers\nSkill-Dev\nPlan\nPrepare\nForm an\nAdvance\nGroup\nScouts\nstudy the\nsubject\nBuilding\nPractice\nSkill\nPractice\nAwareness\nHave a few ʻScoutsʼ\nfamiliarize themselves\nwith the subject; by\nreading ʻToyota Kataʼ\n&amp; ʻThe Talent Codeʼ,\nand taking a Toyota\nKata course.\nPHASE I PHASE II\nPHASE III - Expansion into\nnormal business process of\nline managers, slice by slice\nPractice\nBuilding\nPractice\nSkill\nPractice\nAwareness\nCoaching\nCycles\nDaily\nExternal coach\nneeded here!\nThe basic deployment process is to\npractice the Improvement Kata pattern\nat one management level and pass it\ndown another level through one-on-\none coaching; so the behavior pattern\npermeates the organization.\nThe Advance Group observes and\nPDCAs the skill-development process\nPractice\nAwareness\n* 19.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#19)the Improvement Kata© Mike Rother 19\nPHASE III: EXPANDING SLICE BY SLICE\n•A slice = a process and itʼs associated chain of persons.\n•Add slices only as your coaching capacity permits.\n•Once you start applying the Improvement Kata to a process\nyou should never stop. So itʼs better to start too small than\nto involve too many people too quickly.\nCoach &lt;---&gt; Learner\nrelationships\nAdvance\nGroup\nSite\nManager\nArea Mgr. or\nSupervisor\nPROCESSES\nProcess A\nProcess B\nSupervisor or\nTeam Leader\n* 20.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#20)the Improvement Kata© Mike Rother 20\nWHAT YOUʼRE WORKING TOWARD\nThis is a depiction of what youʼre working toward:\nCoach-Learner relationships up-and-down a value stream.\nOf course, it takes time to build this kind of capability &amp; structure.\nResponsible for\na Value Stream\nResponsible for a\nValue Stream Loop\nResponsible\nfor a Process\nEach\nLearner\nhas a\nstoryboard\nVideo\nnext page\n3 minutes\non the\nwith\nJeff\nLiker\n* 21.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#21)the Improvement Kata© Mike Rother 21\nWHAT IT LOOKS LIKE / HOW IT WORKS\nBased on an illustration by Emiel van Est\nUnderstand the\nDirection or\nChallenge\n(from level above)\nGrasp the\nCurrent\nCondition\nEstablish the\nNext Target\nCondition\nExperiment\nToward the\nTarget Condition\nPLANNING EXECUTING\nValue Stream\nLevel\nOrganization\nLevel\nProcess\nLevel\nLonger-Cycle\nExperiments\nShort-Cycle\nExperiments\nThe higher your level in the value stream, the bigger the goal you are\nresponsible for. A Target Condition at one level is the Challenge for\nthe next level down, and one level coaches the next level down.  Future State\nValue Stream\nMapping\nCurrent State\nValue Stream\nMapping\n* 22.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#22)the Improvement Kata© Mike Rother 22\nSO WHO PRACTICES FIRST?\nAdvance\nGroup\nSite\nManager\nArea Mgr. or\nSupervisor\nPROCESSES\nProcess A\nProcess B\nSupervisor or\nTeam Leader\nPracticing is generally done top-down in a value stream. In\nPhase II the Advance Group and some designated coaches are\nthe first Learners (\\~9 persons).\nThen in Phase III you begin with managers, not supervisors,\npracticing on the actual processes they manage.\nWhy top down? Middle managers are key players in teaching\nand reinforcing habits of thinking and acting in an organization.\nIf you start IK projects with process supervisors but they are\nsurrounded by a different way of thinking among their\nmanagers then the projects are unlikely to sustain.\n* 23.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#23)the Improvement Kata© Mike Rother 23\nOrganization\nhas ʻscoutsʼ\nstudy the\nIK/CK topic\nForm\nAG\nAdvanceGroupmakes6or12-monthplan\nAdvance Group conducts bi-weekly reflections\nSlice 1\nSlice 2\nSlice 3\nSlice 4\nAG and first coaches\npractice the IK\nAdvanceGroupreflectionandnextplan\nIncreasing number of managers\nin the organization who are\nproficient coaches\nAdvance Group\nTraining:\nAG works on a series\nof 3 Target Conditions\n(does \\~ 25 PDCA cycles)\non real processes\nTHE DEPLOYMENT TIMELINE (not to scale)\nPHASE I PHASE II PHASE III\nEXTERNAL COACH ROLE\nInitial instructor &amp;&amp; coach\nOn site frequently\n(eg. every 2 weeks)\nEXTERNAL COACH ROLE\nAs 2nd Coach\nOn site every\n2 - 4 weeks\nEXTERNAL COACH ROLE\nAs needed\nYou canʼt expand faster than you can develop Coaching proficiency. It is often\na slow-spreading process at first, that accelerates as you develop more\ncapability to improve and coach, as shown by the curve in the drawing. It can\neasily take most of a year to do good work in one value stream. You should\nbe achieving your Target Conditions all along, but don&#x27;&#x27;t wonder if you are not\ngetting results that affect the bottom line of the entire organization right away.\n* 24.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#24)the Improvement Kata© Mike Rother 24\nLean tools, techniques and principles to improve quality,\ncost and delivery are as useful and important as ever, but\nthey should be applied within the context of the\nImprovement Kata. What are you trying to achieve?\nLean tools are brought in (pulled) situationally as needed.\nThe mindset youʼre trying to develop is one of working\niteratively to discover and do what is necessary to\nachieve a goal, as opposed to a mindset of pushing and\nimplementing pre-defined solutions or tools.\nFor example, if a kanban system will help a team achieve\nits target condition, then at that point kanban is brought\nin and utilized. Teams stay focused on their next target\ncondition.\nThis approach makes our efforts more meaningful and\nsuccessful. It teaches us more scientific &amp; effective\nhabits of thinking and acting.\nWHAT ABOUT THE\nLEAN TOOLS AND PRACTICES?\n* 25.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#25)the Improvement Kata© Mike Rother 25\nAdvance Group (The Shepherds)\nResponsible for overall deployment of the\nImprovement Kata in the organization. The\nAdvance Group plans &amp; monitors the\ndeployment process, and introduces course\ncorrections (PDCAs the skill-building process).\n2nd Coach (Coach the Managers)\nResponsible for the coaching process.\nPeriodically observes coaching cycles\nbetween middle managers and Learners.\nEnsures connection between an overall\nchallenge and process-level improvement.\nMiddle Managers (The Coaches/Teachers)\nResponsible for teaching the Improvement\nKata and for the team’s results. Conducts\ncoaching cycles daily using the 5 questions.\nEnsures the Learner is working and\npracticing scientifically and experimentally\naccording to the Improvement Kata. The\ncoach’s job is to develop the Learner, not to\nimprove the process.\nLearner and Team (The Process Owners)\nResponsible for required performance in the\nrequired time and quality, and for improving\nthe process with the Improvement Kata. The\nLearner conducts experiments with PDCA and\ndevelops solutions, in dialogue with process\noperators and 1st Coach.\nTHE ROLES IN DEPLOYMENT\nImprovement\nKata\nCoaching\nKata 2nd\nCoach\nCoach\n(Manager)\nLearner\n&amp; Team\nAdvance\nGroup\nu\nv\nwx\nExternal\nCoach\ny\n* 26.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#26)the Improvement Kata© Mike Rother 26\nAN EXTERNAL COACH\nThe role of an external coach is to help selected persons\nin your organization develop Coaching Kata proficiency as\nquickly and effectively as possible, so you can then teach\nand spread the Improvement Kata within your organization\nwith less and less reliance on outside expertise. \nAn external coach is used more at the beginning than later.\nItʼs important that IK training and coaching be done by\npersons inside your organization as soon as possible. The\nrole of the external coach is not to do all your training for\nyou, because that prevents your organization from\ndeveloping the necessary skills.\ny\n* 27.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#27)the Improvement Kata© Mike Rother 27\nTHE “ADVANCE GROUP”\nA small group that plans, monitors and course-corrects\nthe deployment of Improvement Kata skill development\nin the organization\nx\nItʼs called the\n“Advance Group”\nbecause they go first\n* 28.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#28)the Improvement Kata© Mike Rother 28\nEVERY IK DEPLOYMENT IS UNIQUE\nYou should apply the IK pattern to your IK deployment\nSince no two deployments of the Improvement Kata and Coaching Kata\nare alike, there is a need to go beyond just planning to continually\nexperimenting, observing and adjusting at the organizational (deployment)\nlevel. You can ask the Five Coaching Kata Questions at this level too.\nThis is a role for an “Advance Group.”\n* 29.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#29)the Improvement Kata© Mike Rother 29\nSTART DEPLOYMENT WITH THE ADVANCE GROUP\nAKA “The Shepherds”\n•The Advance Group is not responsible for conducting all\ncoaching and training, nor for making improvement happen at\nall processes. That will be the responsibility of middle managers\nand leaders who coach in their areas.\n•Because internal coaches are needed, this is also a good\ntime to simultaneously train a few high-potential coaches who\ncan later coach in various areas of the organization as needed.\n•The Advance Group plus initial coaches should total no more\nthan 9 persons. A larger group becomes too difficult to\nmanage when everyoneʼs skill levels is ʻbeginnerʼ.\n•The Advance Group should include a senior executive (the\nsenior executive in small and mid-sized companies or sites).\n•The Advance Group is not a Lean staff group, although a Lean\nstaff member can be on the Advance Group. If you have a\nlean staff, their role may migrate toward being “master coaches”\nfor middle managers, who will be the heart of the IK effort.\n•The Advance Group will initially need training and guidance from\nan external coach, which can be an outside consultant.\nAdvance Group refers to a team of 3-5 people who orchestrate\nthe deployment of Improvement Kata thinking and skill in the\norganization or site. There can be one Advance Group for the\noverall organization and an Advance Group at each site.\nSuggestions for forming your Advance Group:\n* 30.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#30)the Improvement Kata© Mike Rother 30\nWITHOUT AN ADVANCE GROUP TO SHEPHERD IT,\nCHANGE IS UNLIKELY TO SUCCEED\nPlanning a perfect deployment of new skills is impossible,\nso it will be important to sense obstacles, problems and\nweaknesses as they arise, learn from them and adapt the\ndeployment plan accordingly. This is normal and itʼs the\nresponsibility of the Advance Group.\nCurrent\nCondition\nObstacles\nProblems\nOld Habits\nAG\nTarget\nCondition\n(x) persons at (x) Dreyfus\nlevel of Improvement Kata\nskill, and (x) processes\nunder Improvement Kata\nmanagement, by (x) date.\nYouʼre working on a change in how your organization manages\npeople, so there&#x27;s a need for high-level PDCA.  The Advance\nGroup does this high-level reflecting and adjusting.\n* 31.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#31)the Improvement Kata© Mike Rother 31\nPhase II: ADVANCE GROUP PRACTICING\nTo be able to fulfill their shepherding role, the Advance Group members first\ndevelop some Improvement Kata skill by practicing on real work processes\n•The Advance Groupʼs practicing typically takes two months.\n•If the site does not already have a future-state value stream map\nto provide challenge, then the Advance Group may begin with\nVS Mapping, which adds additional time but is good experience.\n•To gain experience in all four steps of the IK, the Advance\nGroup members work toward three successive target conditions.\n•A key skill is “PDCA rigor,” and an Advance Group member should\npersonally experience at least 25 PDCA cycles.\n* 32.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#32)the Improvement Kata© Mike Rother 32\nSUGGESTIONS FOR\nADVANCE GROUP PRACTICING\nSelect focus processes that are well-suited for beginners to\npractice on. Typically these are compact processes that\nhave repetitive cycles. With beginners the primary goal is to\ninternalize the Improvement Kata pattern, not to address the\nmost complicated processes and problems.\nThe development of internal Kata coaches is a prerequisite\nfor teaching people how to work with the Improvement Kata\nevery day. However, at the start there are no experienced\ncoaches.\nTo bridge this gap you can do Phase II Advance Group\npracticing in a rotation model, whereby each person in turn\ntakes the role of Learner, Coach and 2nd Coach. This is a\ntemporary, artificial structure for Advance Group practicing\nand to quickly develop some internal coaching capacity.\nRemember, you can select a few extra persons to practice\ntogether with the Advance group, so youʼll have a few more\ncoaches for the initial deployment. (Eventually middle\nmanagers will be the coaches.)\nR\nR\n* 33.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#33)the Improvement Kata© Mike Rother 33\nGroup 1\nGroup 2\nGroup 3\nLearnerCoach2nd\nCoach\nProcess 2\nProcess and\nSupervisor\nProcess 1\nProcess 3\nEXAMPLE\n•Select 3 processes with 3 persons practicing per process. This is the\nAdvance Group members + the additional coaches in training, for a\ntotal of 9 persons.\n•Since these are artificially-selected processes, the Learner pairs with\nthe process Supervisor to apply the Improvement Kata to the process.\n•The members in each group periodically rotate roles within their group.\nYOU CAN USE A ROTATION MODEL FOR GETTING THE\nADVANCE GROUP &amp; FIRST COACHES UP TO SPEED\nFor example for 9 Persons\n* 34.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#34)the Improvement Kata© Mike Rother 34\nADVANCE GROUP PRACTICE-PLANNING FORM\nFill in persons and processes for Advance Group IK practicing\nProcess\nSupervisor(s)\n(pairs with Learner)\nAdvance Group\nMembers and\nCoaches in Training\nPRACTICE\nPROCESSES\nPractice\nDates\nStart:\nEnd:\nRotation\nFrequency\n* 35.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#35)the Improvement Kata© Mike Rother 35\nPhase III:\nONCE THE ADVANCE GROUP HAS PRACTICED THE IK\nThe Advance Groupʼs focus now shifts to the following tasks:\nExpand IK practice into the organization “slice” by “slice”\nPrepare a 6 or 12-month skill-development plan.\nHelp start the process by coaching as necessary. At the\nearly stages when there are too few coaches, Advance Group\nmembers may also coach managers or be 2nd coaches.\nObserve coaching cycles. Check and adjust the deployment\nvia PDCA. This is the most important Advance Group task.\nConduct regular reflections of actual current conditions\nagainst the skill-development plan.\nEnsure that teams applying the IK are working toward an\nappropriate challenge. Ensure IK activities are connected\nto meaningful goals.\nq\nq\nq\nq\nq\n* 36.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#36)the Improvement Kata© Mike Rother 36\nTHE ADVANCE GROUP PREPARES A\n6 or 12 MONTH SKILL-DEVELOPMENT PLAN\nThe basic question... what persons do you want to bring to what\nskill level with the Improvement Kata by 6 or 12 months from now?\nI. Vision (your ultimate goal related to IK skill)\nII. Challenge (related to IK skill, 6 to 12 months out)\nIII. Current Condition\nIV. Next Target Condition (1-3 months out)\nV. What We Will Measure\nUse the following headings in the plan\nObstacles &amp; necessary course corrections (PDCA)\nwill arise in the Advance Groupʼs bi-weekly reflections\n* 37.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#37)the Improvement Kata© Mike Rother 37\nTHE ADVANCE GROUP THEN REFLECTS REGULARLY\nThe Advance Group reflects against the skill development plan\n(for example bi-weekly) and introduces adjustments as necessary\nBy conducting regular checks the Advance Group learns what it\nneeds to work on to achieve its target condition of skill development\n* 38.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#38)the Improvement Kata© Mike Rother 38\nTHEORETICAL DEPLOYMENT\nCurrent\nManagement\nApproach\nImprovement\nKata Approach\nTime\nManagerʼs\nWorkday\n* 39.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#39)the Improvement Kata© Mike Rother 39\nManagerʼs\nWorkday\nTHE REALITY\nHereʼs why you need an Advance Group!\nThe Advance Group conducts PDCA at the deployment level.\nImprovement\nKata Approach\nTime\nCurrent\nManagement\nApproach\nUnforeseen deployment\nobstacles, problems, etc.\nWithout an\nAdvance Group,\nthe deployment\ndies here\n* 40.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#40)the Improvement Kata© Mike Rother 40\nWhen you execute a plan and work\ntoward a target condition youʼll need to\nmake adjustments based on what you\nlearn from the unforeseen obstacles and\nproblems you discover along the way.\nThe advance group does this by\nscheduling regular reflection times.\nBi-weekly, for example.\nCONDUCT REGULAR ADVANCE GROUP REFLECTIONS\nThis is where a lot of the success or failure in developing\nImprovement Kata skills and management will be determined\nAn Advance Group reflection\nis built around the same\n5 Coaching Kata Questions\nthat the Coaches use\nThe Five Question Card is a free download\non the Toyota Kata Website\n* 41.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#41)the Improvement Kata© Mike Rother 41\nu\nv\nw\nProgress toward the system-level challenge\nAre individual process-level target conditions\nrelated to a higher-level challenge (lead time,\nproductivity, etc.), and is progress being made?\nProgress toward process target conditions\nRelevant metric(s) can be taken right from each\nwork processʼs target condition.\nLearnerʼs skill development\nHow well are the coaches doing in developing\nImprovement Kata skill in their learners? Use\nthe Dreyfus Levels to assess skill level.\nFrequency and duration of coaching cycles\nFor each coach, track the start and stop times of\ntheir coaching cycles. (Longer is not better.)\nLength of Learnersʼ PDCA cycles\nPDCA cycles should ideally be short &amp; frequent\nFIVE THINGS FOR THE\nADVANCE GROUP TO MEASURE\nx\ny\n* 42.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#42)the Improvement Kata© Mike Rother 42\nLearnerʼs\nStoryboard\nProcess\nLearner\nCoaching is\nthe key variable\nIf the Learner is not\nlearning or the\ntarget condition is\nnot being reached,\nthe problem lies\nin the coaching\nCoach\nPAY PARTICULAR ATTENTION TO COACHING\n* 43.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#43)the Improvement Kata© Mike Rother 43\nTo all Advance Groups...\nWATCH THE\nROLLOUT SPEED\nResist the temptation to roll out the Improvement Kata\nas broadly and quickly as possible. Thatʼs a sure bet\nfor failure because it will...\n-&gt; Multiply mistakes due to shortcutting the\nnecessary PDCAs.\n-&gt; Outrun your organizationʼs coaching capacity.\nThe Advance Group should practice and learn first.\nThen move ahead slowly at first, experimenting and\nadjusting. Gain speed as coaching capacity increases.\nAfter the first year itʼs better to say, “We could have\ngone faster,” than to say, “We went too fast.”\n* 44.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#44)the Improvement Kata© Mike Rother 44\nMiddle managers, not Lean staff persons, should be\nthe main teachers of the Improvement Kata pattern\nin the organization. They are the primary coaches.\nMANAGERS\nManagers are the Improvement Kata teachers / coaches\nv\n* 45.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#45)the Improvement Kata© Mike Rother 45\nTHE IK + CK = A WAY OF MANAGING!\nManagers teach the Improvement Kata pattern to their people\nevery day while those people work on real goals\nAlthough the Improvement Kata describes a routine\nfor continuous improvement, keep in mind that this\nkata is a way of managing people every day.\nBecause they are automatically teachers every day,\nmiddle managers may have more influence on an\norganizationʼs capability than any other group.\nThe Improvement Kata is a way of managing that\ngenerates skills and initiative to improve, adapt and\nkeep the organization moving forward.\n* 46.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#46)the Improvement Kata© Mike Rother 46\n2nd Coach\nParticipates\nperiodically\nPays particular\nattention to the Coach\n(coaches the Coach)\nLearnerʼs\nStoryboard\nProcess\nLearnerCoach\n(Manager)\nThe Coach is responsible for\nteaching the Improvement\nKata pattern, and for the results\nThe Coach uses the Coaching\nKata, asking the 5 CK questions\nLine\nManager\nThe team owns\nthe target condition\nand works to achieve it\nThe Learner &amp; team apply\nthe Improvement Kata\nTeam\nuv\nw\nTHE THREE CORE ROLES\nFOR DAILY PRACTICING\n* 47.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#47)the Improvement Kata© Mike Rother 47\nCOACHING CYCLES ARE THE MANAGERʼS DAILY\nIMPROVEMENT-KATA TEACHING MECHANISM\nOnce they have practiced and learned the Improvement Kata,\nmanagers use daily Coaching Cycles as a teaching technique\nThe Coach uses the\nFive CK Questions\nThe Learner uses the\nPDCA Cycles Record\nCoaching cycles are a way to guide Learners\nin their Improvement Kata practice\n* 48.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#48)the Improvement Kata© Mike Rother 48\nAdditional coaching cycles\nif necessary\nOne Day\nScheduled\nCoaching\nCycle\nFor detailed instructions on how to conduct Coaching Cycles\nsee the online Improvement Kata &amp; Coaching Kata Practice Guide\nOne coaching cycle involves a Coach asking the Learner the\nFive CK Questions, while at the process. We usually strive for\nthis to be done at least once every shift, taking 10-15 minutes.\n(Note: it takes some practice to get to 10-15 minute coaching\ncycles that are not just a formality.)\nCoaching cycles are conducted at regularly-scheduled times\n+ spontaneously when the need arises.\nAs necessary, after a coaching cycle the Coach may opt to\naccompany the Learner - which would be coaching - or simply\nto return for the next coaching cycle.\nCOACHING CYCLES\nFOR DAILY IMPROVEMENT KATA TRAINING\n* 49.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#49)the Improvement Kata© Mike Rother 49\nRapid PDCA CyclesThe 5-Question Coaching Dialog\nTHESE ARE THE TWO FUNDAMENTAL ROUTINES\nAT THE CORE OF THE COACHING KATA\nThe Five Question card is available on the Toyota Kata Website\nFive-Question Card\nUsed by the COACH\nPDCA Cycles Record\nUsed by the LEARNER\n* 50.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#50)the Improvement Kata© Mike Rother 50\nCurrent\nCondition\nTarget\nCondition\nLearner\nCoach\n* 51.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#51)the Improvement Kata© Mike Rother 51\nTHE 2nd COACHES\nThey observe &amp; coach the coaches\nThere will be a need for some master coaches. These may\ninitially come from the Advance Group, Lean staff, etc.\nw\n* 52.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#52)the Improvement Kata© Mike Rother 52\nTHE IMPORTANT ROLE\nOF THE 2nd COACH\nThe apparent simplicity of the Five Questions makes\ncoaching seem easier to learn than it is. We underestimate\nwhatʼs involved in coaching and what it takes to learn it. It\ntakes considerable practice and regular reflection to\nmaster the intent and pattern of the Coaching Kata.\nFor the Coach, coaching cycles are not only a means of\nteaching the Improvement Kata pattern but also a PDCA\ncycle whereby the Coach checks and reflects on the result\nof his/her last coaching. If the Learner isnʼt learning the\nImprovement Kata or a team is not achieving its target\nconditions the problem is usually in the coaching.\nIn other words, the Coach is practicing the Coaching Kata\nand for this needs someone with coaching experience to\nperiodically observe him conducting coaching cycles and\nprovide feedback (to coach the coach). Thatʼs the role of\nthe 2nd coach.\nPeriodic observation of coaching cycles by an\nexperienced second coach is essential if you want\nto teach managers effective coaching skills.\n* 53.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#53)the Improvement Kata© Mike Rother 53\n2nd Coach\nParticipates\nperiodically\n(eg. once / week)\nPays particular\nattention to the Coach\n(coaches the Coach)\nLearnerʼs\nStoryboard\nProcess\nLearnerCoach\n(Manager)\nCoach is responsible for\nteaching the Improvement Kata\npattern, and for the results\nLearner &amp; Team own\nthe target condition\nand work to achieve it\nTeam\nTHE ROLE OF THE 2nd COACH\nThe 2nd Coachʼs role is to ensure that middle managers are\nteaching/coaching the Improvement Kata correctly.\nThe 2nd Coach does this primarily by observing a managersʼ\ncoaching cycles.\n* 54.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#54)the Improvement Kata© Mike Rother 54\nA COACHING CYCLE IN ACTION\n* 55.\n[How to Deploy](https://www.slideshare.net/slideshow/how-to-deploy-the-improvement-kata/7730624#55)the Improvement Kata© Mike Rother 55\nSummary:\nIMPROVEMENT KATA PRACTICE\nIS BRAIN TRAINING!\nDetailed practice instructions are available in the\nonline Improvement Kata and Coaching Kata Practice\nGuide, which is available on the Toyota Kata Website\nDownload"
      },
      {
        "title": "Books by Mike Rother (Author of Toyota Kata)",
        "url": "https://www.goodreads.com/author/list/86312.Mike_Rother",
        "snippet": "# Books by Mike Rother\n\n[![Mike Rother](https://s.gr-assets.com/assets/nophoto/user/u_50x66-632230dc9882b4352d753eedf9396530.png)](https://www.goodreads.com/author/show/86312.Mike_Rother)\n\n[Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother)\n\nAverage rating 4.18 ·\n2,866 ratings ·\n165 reviews ·\nshelved 10,141 times\n\nShowing 15 distinct works.\n\nsort bypopularityoriginal publication yeartitleaverage ratingnumber of pages\n\n| | | |\n| --- | --- | --- |\n| [![Toyota Kata: Managing Peopl...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348317098i/6736366._SX50_.jpg)](https://www.goodreads.com/book/show/6736366-toyota-kata) | [Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results](https://www.goodreads.com/book/show/6736366-toyota-kata) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) 4.19 avg rating — 1,859 ratings — published 2009 — [21 editions](https://www.goodreads.com/work/editions/6932664-toyota-kata-managing-people-for-improvement-adaptiveness-and-superior) | Want to Readsaving… - Want to Read![saving…](https://s.gr-assets.com/assets/loading-trans-ced157046184c3bc7c180ffbfc6825a4.gif) - Currently Reading![saving…](https://s.gr-assets.com/assets/loading-trans-ced157046184c3bc7c180ffbfc6825a4.gif) - Read![saving…](https://s.gr-assets.com/assets/loading-trans-ced157046184c3bc7c180ffbfc6825a4.gif) Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Learning to See: Value Stre...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1172201423i/149279._SX50_.jpg)](https://www.goodreads.com/book/show/149279.Learning_to_See) | [Learning to See: Value Stream Mapping to Add Value and Eliminate MUDA](https://www.goodreads.com/book/show/149279.Learning_to_See) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother), [James P. Womack](https://www.goodreads.com/author/show/15060996.James_P_Womack)(Foreword), [Dan Jones](https://www.goodreads.com/author/show/75599.Dan_Jones)(Foreword), [John Shook](https://www.goodreads.com/author/show/86310.John_Shook) 4.13 avg rating — 749 ratings — published 1999 — [9 editions](https://www.goodreads.com/work/editions/144073-learning-to-see-version-1-3) | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![The Toyota Kata Practice Gu...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1507410060i/36370823._SX50_.jpg)](https://www.goodreads.com/book/show/36370823-the-toyota-kata-practice-guide) | [The Toyota Kata Practice Guide: Practicing Scientific Thinking Skills for Superior Results in 20 Minutes a Day](https://www.goodreads.com/book/show/36370823-the-toyota-kata-practice-guide) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) 4.21 avg rating — 96 ratings — [5 editions](https://www.goodreads.com/work/editions/58057184-the-toyota-kata-practice-guide-practicing-scientific-thinking-skills-fo) | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Creating Continuous Flow: A...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1390282497i/189874._SX50_.jpg)](https://www.goodreads.com/book/show/189874.Creating_Continuous_Flow) | [Creating Continuous Flow: An Action Guide for Managers, Engineers & Production Associates](https://www.goodreads.com/book/show/189874.Creating_Continuous_Flow) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother), [Rick Harris](https://www.goodreads.com/author/show/110642.Rick_Harris) 4.30 avg rating — 87 ratings — published 2001 — [2 editions](https://www.goodreads.com/work/editions/183553-creating-continuous-flow-an-action-guide-for-managers-engineers-and-pr) | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Toyota Kata Culture: Buildi...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1478643713i/31381266._SX50_.jpg)](https://www.goodreads.com/book/show/31381266-toyota-kata-culture) | [Toyota Kata Culture: Building Organizational Capability and Mindset through Kata Coaching](https://www.goodreads.com/book/show/31381266-toyota-kata-culture) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother), [Gerd Aulinger](https://www.goodreads.com/author/show/16760450.Gerd_Aulinger) 3.98 avg rating — 65 ratings — [7 editions](https://www.goodreads.com/work/editions/52072097-toyota-kata-culture-building-organizational-capability-and-mindset-thro) | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![LEVEL UP AGILE WITH TOYOTA ...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1551144766i/44137805._SY75_.jpg)](https://www.goodreads.com/book/show/44137805-level-up-agile-with-toyota-kata) | [LEVEL UP AGILE WITH TOYOTA KATA: Beyond Method Wars, Establishing Core Lean/Agile Capabilities Through Systematic Improvement](https://www.goodreads.com/book/show/44137805-level-up-agile-with-toyota-kata) by [Jesper Boeg](https://www.goodreads.com/author/show/6623462.Jesper_Boeg), [Diana Larsen](https://www.goodreads.com/author/show/383872.Diana_Larsen)(Goodreads Author)(Foreword), [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother)(Foreword) 4.83 avg rating — 6 ratings — [2 editions](https://www.goodreads.com/work/editions/68634200-level-up-agile-with-toyota-kata-beyond-method-wars-establishing-core-l) | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![The Toyota Kata Field Guide...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1520091886i/38918138._SX50_.jpg)](https://www.goodreads.com/book/show/38918138-the-toyota-kata-field-guide-power-pack) | [The Toyota Kata Field Guide Power Pack](https://www.goodreads.com/book/show/38918138-the-toyota-kata-field-guide-power-pack) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) it was amazing 5.00 avg rating — 3 ratings — [2 editions](https://www.goodreads.com/work/editions/56965527-the-toyota-kata-field-guide-power-pack) | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![The Essential Toyota Kata B...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1681653516i/122135649._SX50_.jpg)](https://www.goodreads.com/book/show/122135649-the-essential-toyota-kata-bundle) | [The Essential Toyota Kata Bundle](https://www.goodreads.com/book/show/122135649-the-essential-toyota-kata-bundle) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) it was amazing 5.00 avg rating — 2 ratings — [3 editions](https://www.goodreads.com/work/editions/70866201-the-essential-toyota-kata-bundle) | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Value-Stream Mapping Worksh...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1564265707l/52037636._SX50_SY75_.jpg)](https://www.goodreads.com/book/show/52037636-value-stream-mapping-workshop-participant-guide) | [Value-Stream Mapping Workshop Participant Guide](https://www.goodreads.com/book/show/52037636-value-stream-mapping-workshop-participant-guide) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother), [John Shook](https://www.goodreads.com/author/show/86310.John_Shook) 4.50 avg rating — 2 ratings | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![VSM Participant Guide for T...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1677793085i/2287523._SX50_.jpg)](https://www.goodreads.com/book/show/2287523.VSM_Participant_Guide_for_Training_to_See) | [VSM Participant Guide for Training to See: A Value Stream Mapping Workshop](https://www.goodreads.com/book/show/2287523.VSM_Participant_Guide_for_Training_to_See) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother), [John Shook](https://www.goodreads.com/author/show/86310.John_Shook) it was amazing 5.00 avg rating — 1 rating — published 2000 | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Learning to See: Value Stre...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1697717066i/133360598._SX50_.jpg)](https://www.goodreads.com/book/show/133360598-learning-to-see) | [Learning to See: Value Stream Mapping to Add Value and Eliminate MUDA by Mike Rother John Shook Jim WomackSpi edition (Textbook ONLY, Spiral-bound )](https://www.goodreads.com/book/show/133360598-learning-to-see) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) it was amazing 5.00 avg rating — 1 rating | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![TOYOTA KATA - GESTIRE LE PERSO](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1678695526i/93450461._SY75_.jpg)](https://www.goodreads.com/book/show/93450461-toyota-kata---gestire-le-perso) | [TOYOTA KATA - GESTIRE LE PERSO](https://www.goodreads.com/book/show/93450461-toyota-kata---gestire-le-perso) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) 0.00 avg rating — 0 ratings | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Das KATA Praxishandbuch](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1678872782i/95888284._SX50_.jpg)](https://www.goodreads.com/book/show/95888284-das-kata-praxishandbuch) | [Das KATA Praxishandbuch](https://www.goodreads.com/book/show/95888284-das-kata-praxishandbuch) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) 0.00 avg rating — 0 ratings | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Créer un flux continu : Un ...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1678984645i/102264027._SX50_.jpg)](https://www.goodreads.com/book/show/102264027-cr-er-un-flux-continu) | [Créer un flux continu : Un guide d'action destiné aux managers, ingénieurs et personnels de production](https://www.goodreads.com/book/show/102264027-cr-er-un-flux-continu) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother) 0.00 avg rating — 0 ratings | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n| [![Toyota Kata Culture: Buildi...](https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1681571991i/132651387._SX50_.jpg)](https://www.goodreads.com/book/show/132651387-toyota-kata-culture) | [Toyota Kata Culture: Building Organizational Capability and Mindset through Kata Coaching](https://www.goodreads.com/book/show/132651387-toyota-kata-culture) by [Mike Rother](https://www.goodreads.com/author/show/86312.Mike_Rother), [Gerd Aulinger](https://www.goodreads.com/author/show/16760450.Gerd_Aulinger) 0.00 avg rating — 0 ratings | Want to Readsaving… Error rating book. Refresh and try again. Rate this book Clear rating [1 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [2 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [3 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [4 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) [5 of 5 stars](https://www.goodreads.com/author/list/86312.Mike_Rother) |\n\n\\\\* Note: these are all the books on Goodreads for this author. To add more books, [click here](https://www.goodreads.com/book/new?author%5Bname%5D=Mike+Rother).\n\nWelcome back. Just a moment while we sign you in to your Goodreads account.\n\n![Login animation](https://s.gr-assets.com/assets/facebook/login_animation-085464711e6c1ed5ba287a2f40ba3343.gif)"
      },
      {
        "title": "Toyota Kata - Continuous Improvement (Lean) methodology to develop everyday habits",
        "url": "https://www.mfgsolutions.org/toyotakata/",
        "snippet": "[Skip to content](https://www.mfgsolutions.org/toyotakata/#content)\n\n- [Home](https://www.mfgsolutions.org/)\n- [Contact Us](https://www.mfgsolutions.org/contact-us/)\n\nTop\n\nSearch:\n\n(501) 682-7386\n\n[Facebook page opens in new window](https://www.facebook.com/armanufacturing) [X page opens in new window](https://twitter.com/ARManufacturing/) [YouTube page opens in new window](https://www.youtube.com/user/ARMfgSolutions)\n\n- [About Us](https://www.mfgsolutions.org/about-us/)\n - [NIST MEP](https://www.mfgsolutions.org/about-us/nist-mep/)\n - [Our Team](https://www.mfgsolutions.org/our-team/)\n - [Newsroom](https://www.mfgsolutions.org/about-us/newsroom/)\n - [Frequently Asked Questions](https://www.mfgsolutions.org/about-us/frequently-asked-questions/)\n - [KiC – Kata in the Classroom](https://www.mfgsolutions.org/kic-kata-classroom/)\n- [Services](https://www.mfgsolutions.org/services/)\n - [Growth & Innovation](https://www.mfgsolutions.org/services/growth-innovation/)\n - [ExporTech™](https://www.mfgsolutions.org/services/exportech/)\n - [MCI](https://www.mfgsolutions.org/mci-2/)\n - [Operational Excellence](https://www.mfgsolutions.org/services/operational-excellence/)\n - [Toyota Kata](https://www.mfgsolutions.org/toyotakata/)\n - [Leader Starter Kata](https://www.mfgsolutions.org/leader-starter-kata/)\n - [Leadership Development](https://www.mfgsolutions.org/services/leadership-development/)\n - [Sustainability](https://www.mfgsolutions.org/services/sustainability/)\n - [Supply Chain Optimization](https://www.mfgsolutions.org/services/supply-chain-optimization/)\n - [Technology Transfer Assistance Grant Program (TTAG)](https://www.mfgsolutions.org/services/technology-transfer-assistance-grant-program-ttag/)\n - [TTAG Guidelines](https://www.mfgsolutions.org/services/technology-transfer-assistance-grant-program-ttag/ttag-guidelines/)\n - [TTAG Application](https://www.mfgsolutions.org/services/technology-transfer-assistance-grant-program-ttag/technology-transfer-assistance-grant-ttag-application/)\n - [Cybersecurity](https://www.mfgsolutions.org/services/cybersecurity/)\n - [Family Business Resources](https://www.mfgsolutions.org/services/fba/)\n- [Training Calendar](https://www.mfgsolutions.org/training/)\n- [Online Training](https://www.mfgsolutions.org/services/online-training/)\n- [Success Stories](https://www.mfgsolutions.org/success-stories/)\n- [Resources](https://www.mfgsolutions.org/resources/)\n - [Manufacturing Day](https://www.mfgsolutions.org/mfgday/)\n- [Manufacturing Data](https://www.mfgsolutions.org/arkansas-manufacturing-data/)\n\n# Toyota Kata\n\n**Have you ever found yourself asking:**\n\n- **How do we keep improvement going?**\n- **How do we align our organization so that daily improvements move us toward strategic goals?**\n- **How can we work to develop solutions scientifically, instead of trying to implement preconceived solutions?**\n\nWhat is Toyota Kata?\n\nAround the world, within the United States, and here in Arkansas, Toyota Kata is being utilized to address process, people and communication issues.\n\nThe practice routines of the Improvement Kata and Coaching Kata will make you, your team and your organization better at improving, adapting, innovating and achieving whatever you set out to do.  It’s about the practical application of Scientific Thinking for pursuing challenging goals, while simultaneously developing people to solve problems.  The Improvement Kata and Coaching Kata turn scientific thinking into a practical skill anyone can learn, by combining a four-step scientific working pattern with techniques of deliberate practice.\n\nKata are systematic and scientific problem solving routines that address challenges and opportunities in areas such as:\n\n- **Process:** Quality, Cost and Delivery\n- **Communication:** Accurate, Complete and Timely\n- **People:** Safety, Environment and Morale\n\nThe Improvement Kata\n\nThe Improvement Kata is a routine for moving from the current situation to the new situation in a creative, directed, meaningful way.\n\n**Four-Part Model:**\n\n- Vision or Direction\n- Understanding of Current Condition\n- Defining the Target Condition\n- Uncovering Obstacles While Working Toward Target Condition\n\nThe Improvement Kata builds on what is discovered along the way. Teams using the Improvement Kata learn and adapt based on what they’ve discovered while on their journey to reaching their Target Condition.\n\n![The Improvement Kata](https://www.mfgsolutions.org/wp-content/uploads/2017/01/kata.png)\n\nCoaching Kata\n\nThe Coaching Kata is a practice routine for teaching the **Improvement Kata** pattern.\n\nAs with every skill, practicing should be done under regular observation of an experienced coach. Without coaching we lose our way and don’t practice the correct pattern, or become inefficient in our practice.\n\nOnce **Improvement Kata** is learned, the **Coaching Kata** develops your skill for teaching the Improvement Kata pattern in everyday work environments. The Coaching Kata is a practice routine specifically for teaching a scientific working pattern like the Improvement Kata.\n\n## Coaching Cycles\n\nThe core practice routine of the Coaching Kata is Coaching Cycles. One coaching cycle involves the Coach asking the **Five Coaching Kata Questions** of the learner while using the PDCA Cycles Record. This is done daily at a regularly scheduled time.\n\n[iframe](https://www.youtube.com/embed/_es3hYCMMmc?feature=oembed)\n\n[iframe](https://www.youtube.com/embed/n3G0V7Wthbc?feature=oembed)\n\n[iframe](https://www.youtube.com/embed/k5QVC2kW5ww?feature=oembed)\n\n[iframe](https://www.youtube.com/embed/uqZOu1D639Q?feature=oembed)\n\n2017 Kata Practitioner Day Videos\n\n[2017 Arkansas Kata Practitioner Day - Full Video](http://video1.aetn.org/vod/edu/videos/KataPractitionerDay-FULL.mp4)[Toyota Kata: Daily Practice for Scientific Skill, Mindset, and Culture Video](http://video1.aetn.org/vod/edu/videos/1-Rother-ToyotaKata.mp4)[MPG Gear Technologies - Video Presentation](http://video1.aetn.org/vod/edu/videos/2-MPG.mp4)[NIce Pak - Video Presentation](http://video1.aetn.org/vod/edu/videos/3-NicePak.mp4)[Baptist Health - Video Presentation](http://video1.aetn.org/vod/edu/videos/5-BaptistHealth.mp4)[KiC Puzzle Exercise](http://video1.aetn.org/vod/edu/videos/6-Rother-Exercise.mp4)[Kata in the Classroom](http://video1.aetn.org/vod/edu/videos/7-KataClassroom.mp4)[Kata: Arkansas Economic Development Commission Presentation](http://video1.aetn.org/vod/edu/videos/8-AEDC.mp4)[Q&A with Mike Rother](http://video1.aetn.org/vod/edu/videos/9-Rother-QA.mp4)\n\n2017 Kata Practitioner Day Presentations\n\n[![Nice Pak](https://www.mfgsolutions.org/wp-content/uploads/2017/04/nice-pak.png)](https://www.mfgsolutions.org/wp-content/uploads/2017/04/NICE-PAK-KATA-JOURNEY-032917.pdf) Nice Pak Transformational Journey (So Far)\n\n[![Baptist](https://www.mfgsolutions.org/wp-content/uploads/2017/04/baptist.png)](https://www.mfgsolutions.org/wp-content/uploads/2017/04/BMHC-KATA-JOURNEY-032917.pdf) Baptist - Continuously Improving the Way We Write Obstacles\n\n[![AEDC](https://www.mfgsolutions.org/wp-content/uploads/2017/04/aedc.png)](https://www.mfgsolutions.org/wp-content/uploads/2017/04/AEDC-KATA-JOURNEY-032917.pdf) AEDC Development Commission\n\n[![Rother Video 1 Link](https://www.mfgsolutions.org/wp-content/uploads/2017/04/rother-video-1.png)](https://www.youtube.com/watch?v=ELpfYCZa87g) Neuroplasticity\n\n[![Career Ed Presentation](https://www.mfgsolutions.org/wp-content/uploads/2017/04/career-ed-presentation.png)](https://www.mfgsolutions.org/wp-content/uploads/2017/04/KATA-in-the-Classroom-kelli.pdf) Arkansas Career & Technical Education - Kata In The Classroom\n\n[![MPG Gear](https://www.mfgsolutions.org/wp-content/uploads/2017/04/MPG-Gear.png)](https://www.mfgsolutions.org/wp-content/uploads/2017/04/MPG-GEAR-KATA-JOURNEY-032917.pdf) MPG Gear Technologies - The Kata Journey\n\n[![Almatis](https://www.mfgsolutions.org/wp-content/uploads/2017/04/almatis.png)](https://www.mfgsolutions.org/wp-content/uploads/2017/04/ALMATIS-KATA-JOURNEY-032917.pdf) Almatis Bauxite - Transformation Using Kata\n\n[![Rother Presentation](https://www.mfgsolutions.org/wp-content/uploads/2017/04/rother-presentation.png)](https://www.mfgsolutions.org/wp-content/uploads/2017/04/Rother-Presentation.pptx) Mike Rother's Toyota Kata Daily Practice for Scientific-Thinking Skills, Mindset & Culture Presentation\n\n[![BJ Fogg: Baby Steps for Behavior Change](https://www.mfgsolutions.org/wp-content/uploads/2017/04/rother-video-2.png)](https://www.youtube.com/watch?v=cfAQ8oJIGoA) BJ Fogg: Baby Steps for Behavior Change\n\n[Go to Top](https://www.mfgsolutions.org/toyotakata/)"
      },
      {
        "title": "The Toyota Kata Practice Guide",
        "url": "https://www.mheducation.com/highered/product/toyota-kata-practice-guide.html",
        "snippet": "[Skip to main content](https://www.mheducation.com/highered/product/toyota-kata-practice-guide.html#jumptomain)\n\n![The Toyota Kata Practice Guide](https://www.mheducation.com/cover-images/Webp_400-wide/1259861023.webp)\n\n**ISBN10**: 1259861023 \\| **ISBN13:** 9781259861024\n\n![The Toyota Kata Practice Guide](https://www.mheducation.com/cover-images/Webp_400-wide/1259861023.webp)\n\n# The Toyota Kata Practice Guide, 1st Edition\n\n**ISBN10**: 1259861023\n\n**ISBN13**: 9781259861024\n\nBy Mike Rother\n\n© 2018\n\nFor StudentsFor Instructors\n\n- Printfrom $50.00\n\n\n## Hardcopy\n\nISBN10:1259861023 \\|\nISBN13: 9781259861024\n\nFeatures\n\nComplete text bound in hardcover or softcover\n\n[View shipping options](https://www.mheducation.com/highered/product/toyota-kata-practice-guide.html)\n\n$50.00\n\nView Price\n\n## Hardcopy\n\nISBN10:1259861023 \\|\nISBN13: 9781259861024\n\nView Price\n\n\\\\* The estimated amount of time this product will be on the market is based on a number of factors, including faculty input to instructional design and the prior revision cycle and updates to academic research-which typically results in a revision cycle ranging from every two to four years for this product. Pricing subject to change at any time.\n\n## Instructor Information\n\nQuick Actions ( _Only for Validated Instructor Accounts_):\n\n[Contact a Rep](https://shop.mheducation.com/store/paris/user/findltr.html)\n\n## Overview\n\n**Take the Kata path to scientific thinking and superior results!**\n\nIn this long-awaited companion to the groundbreaking book _Toyota Kata_, Mike Rother takes you to the next level of developing business mindset and capability for the 21st Century. Much more than a list of management concepts, _The Toyota Kata Practice Guide_ walks you through the process of making improvement, adaptation, and even innovation routine behavior.\n\nDesigned to help a coach (the manager) and a learner work together for developing new skillsets, _The_ _Toyota Kata Practice Guide_ delivers the information, insight, and frameworks you need to:\n\n\\\\* Form habits that help you solve problems and achieve challenging goals\n\n\\\\* Modify the thought patterns that drive your behavior\n\n\\\\* Develop an organizational mindset that drives superior results\n\nThe Improvement Kata gives learners the means to experiment their way through obstacles and achieve tough goals; the Coaching Kata gives managers the means to accelerate and cement their people's learning.\n\nIn the new age of business, increasing efficiency and decreasing costs is no longer the end game. A manager’s job today is to develop patterns of thinking and acting in their people that lead to success with any challenge. Consistent, mindful practice is the best way to do it—and _The Toyota Kata Practice Guide_ is the best way to get there.\n\n## Table of Contents\n\nAcknowledgments\n\nExcerpt from _Toyota Kata_\n\nIntroduction: A Way to Learn and Teach Scientific Thinking\n\n**Part I: Bringing Together Scientific Thinking and Practice**\n\nChapter 1: Scientific Thinking for Everyone\n\nChapter 2: Guidelines for Good Practice\n\nChapter 3: Roles and Structure for Daily Practice\n\nChapter 4: Get Ready to Practice\n\n**Part II: Practice Routines for the Learner (The Improvement Kata)**\n\nChapter 5: Understand the Direction or Challenge (Step 1)\n\nChapter 6: Grasp the Current Condition (Step 2)\n\nChapter 7: Establish the Next Target Condition (Step 3)\n\nChapter 8: Experiment Toward the Target Condition (Step 4)\n\nChapter 9: The Summary Reflection\n\n**Part III: Practice Routines for the Coach (The Coaching Kata)**\n\nChapter 10: Introduction to the Coaching Kata\n\nChapter 11: Coaching Cycles: Concept Overview\n\nChapter 12: How to Do a Coaching Cycle: Practice Routines\n\nConclusion\n\nAppendix: Forms and Templates\n\nIndex\n\n## Author Bios\n\n### About the Author\n\n**Mike Rother**\n\n**Need support?**   We're here to help - [Get real-world support and resources every step of the way.](https://www.mheducation.com/highered/support.html)\n\nTop"
      },
      {
        "title": "Michael Rother | Association for Manufacturing Excellence",
        "url": "https://www.ame.org/hall-of-fame-inductee/michael-rother",
        "snippet": "[Skip to main content](https://www.ame.org/hall-of-fame-inductee/michael-rother#main-content)\n\n# Michael Rother\n\n2013 Hall of Fame Inductee\n\n![](https://www.ame.org/files/rother_bw.jpg)\n\nMichael Rother\n\nMike Rother is an engineer, independent researcher, teacher, author and speaker whose groundbreaking insights make the leap between theory and practice of lean thinking. Rother is a best-selling author with previous affiliations with the University of Michigan, Industrial Technology Institute, Fraunhofer Institute and Technical University Dortmund. His most recent book, “Toyota Kata” examines the improvement Kata, which is a teachable, repeatable routine that makes scientific working a daily habit and provides a clear path for leveraging human potential. Additionally, Rother’s book “Learning to See,” co-authored with John Shook, is widely regarded as the standard explanation and user guide for Value Stream Mapping. He has studied Toyota since 1989 and toured hundreds of production facilities around the world to collaborate with organizations where senior managers have a sense of curiosity, are willing to experiment and are open to learning together.\n\n![](https://www.ame.org/files/logo.png)\n\n### Regions\n\n### Education\n\n### Events\n\n### Contact"
      }
    ],
    "input_count": 30,
    "output_count": 16,
    "dropped": 2,
    "threshold": 0.78,
    "use_embeddings": false
  },
  "telemetry": {
    "brave": {
      "cost": 0.001,
      "calls": 1,
      "success": 1,
      "new_facts": 1,
      "avg_latency_ms": 566.3847720134072
    },
    "exa": {
      "cost": 0.06,
      "calls": 1,
      "success": 1,
      "new_facts": 1,
      "avg_latency_ms": 1651.552460010862
    },
    "firecrawl": {
      "cost": 0.08,
      "calls": 2,
      "success": 2,
      "new_facts": 4,
      "avg_latency_ms": 2503.0477339896606
    },
    "semantic_merge": {
      "cost": 0.0,
      "calls": 1,
      "success": 1,
      "new_facts": 16,
      "avg_latency_ms": 0.0
    }
  },
  "enrichment_used": true,
  "enrichment_info": {
    "query": "Mike Rother Improvement Kata Coaching Kata Scientific Thinking Person occupation affiliation alumni award sameAs officialWebsite publications biography",
    "schema_type": "Person",
    "yago_label": null,
    "yago_confidence": 0.0,
    "fallback": true
  },
  "cost_spent": 0.14099999999999996,
  "budget_remaining": 0.35900000000000004,
  "baseline": {}
}